video_notes/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-06-17 Thu 22:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MIT 6.001 1986 Video Notes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Nebhrajani A.V." />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">MIT 6.001 1986 Video Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd88d791">1. Prologue</a>
<ul>
<li><a href="#orgae5d882">1.1. About</a></li>
<li><a href="#orgb75bff5">1.2. License</a></li>
</ul>
</li>
<li><a href="#orgab2b604">2. Lecture 1A: Overview and Introduction to Lisp</a>
<ul>
<li><a href="#org9b4389b">2.1. Managing Complexity: Key Ideas of 6.001</a></li>
<li><a href="#orgaf3c2b2">2.2. Let&rsquo;s Learn Lisp</a>
<ul>
<li><a href="#org115bcc5">2.2.1. Primitive Elements</a></li>
<li><a href="#org822992a">2.2.2. Means of Combination</a></li>
<li><a href="#org4f4f7ff">2.2.3. Means of Abstraction</a></li>
</ul>
</li>
<li><a href="#org177258d">2.3. Case Analysis in Lisp</a></li>
<li><a href="#org1c6d239">2.4. Finding Square Roots</a></li>
<li><a href="#orgbd9cb69">2.5. Inbuilt/Primitive Procedures Aren&rsquo;t Special</a></li>
</ul>
</li>
<li><a href="#orgf0dffad">3. Lecture 1B: Procedures and Processes, Substitution Model</a>
<ul>
<li><a href="#orgd19d0bf">3.1. Substitution Rule/Model</a>
<ul>
<li><a href="#orgcc2fdcc">3.1.1. Kinds of Expressions in Lisp</a></li>
<li><a href="#orgcd80e24">3.1.2. Example</a></li>
</ul>
</li>
<li><a href="#org864c59c">3.2. Peano Arithmetic</a>
<ul>
<li><a href="#org4980c07">3.2.1. Simple Peano Addition</a></li>
<li><a href="#org1726c81">3.2.2. Another Peano Adder</a></li>
</ul>
</li>
<li><a href="#orgb424a0c">3.3. Differentiating Between Iterative and Recursive Processes</a></li>
<li><a href="#org586a9c7">3.4. Fibonacci Numbers</a></li>
<li><a href="#org2f75381">3.5. Towers of Hanoi</a></li>
<li><a href="#orged40f06">3.6. Iterative Fibonacci</a></li>
</ul>
</li>
<li><a href="#org2373aa3">4. Lecture 2A: Higher-Order Procedures</a>
<ul>
<li><a href="#org9d0e24a">4.1. Abstracting Procedural Ideas</a></li>
<li><a href="#org35f35b0">4.2. More on Square Roots</a>
<ul>
<li><a href="#org260aed9">4.2.1. Fixed Points</a></li>
<li><a href="#org1a35ccd">4.2.2. Damping Oscillations</a></li>
</ul>
</li>
<li><a href="#orgf4d68a0">4.3. Newton&rsquo;s Method</a></li>
<li><a href="#org5849bba">4.4. Procedures are First-Class Citizens</a></li>
</ul>
</li>
<li><a href="#orge130eef">5. Lecture 2B: Compound Data</a>
<ul>
<li><a href="#org687865c">5.1. Rational Number Arithmetic</a>
<ul>
<li><a href="#org4569215">5.1.1. Abstraction</a></li>
<li><a href="#orgdaa7ffb">5.1.2. Data Object Creation</a></li>
</ul>
</li>
<li><a href="#org6e1af5f">5.2. Representing Points on a Plane</a></li>
<li><a href="#org7914e53">5.3. Pairs</a></li>
</ul>
</li>
<li><a href="#org02db6cd">6. Lecture 3A: Henderson Escher Example</a>
<ul>
<li><a href="#org0b30152">6.1. Lists</a>
<ul>
<li><a href="#org987b324">6.1.1. Procedures on Lists</a></li>
</ul>
</li>
<li><a href="#org094bcd7">6.2. Henderson&rsquo;s Picture Language</a>
<ul>
<li><a href="#orga15f9df">6.2.1. Primitives</a></li>
<li><a href="#orgc2f83fc">6.2.2. Means of Combination and Operations</a></li>
<li><a href="#org00dd696">6.2.3. An Implementation</a></li>
<li><a href="#orga4885f5">6.2.4. Means of Abstraction</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org29127fd">7. Lecture 3B: Symbolic Differentiation; Quotation</a>
<ul>
<li><a href="#org5f27bef">7.1. Differentiation v. Integration</a></li>
<li><a href="#org9f6f879">7.2. Some Wishful Thinking</a></li>
<li><a href="#orgae9dcf1">7.3. Representing Algebraic Expressions</a>
<ul>
<li><a href="#orgef0b6c3">7.3.1. Using Lisp Syntax</a></li>
<li><a href="#org5eb9df7">7.3.2. Representation Implementation</a></li>
<li><a href="#org4bac4f9">7.3.3. Simplification</a></li>
</ul>
</li>
<li><a href="#org50c6f66">7.4. On Abstract Syntax</a></li>
</ul>
</li>
<li><a href="#orgdc5c673">8. Lecture 4A: Pattern Matching and Rule-Based Substitution</a>
<ul>
<li><a href="#orga3dd5b4">8.1. Rule Language</a>
<ul>
<li><a href="#org3b4b26e">8.1.1. Pattern Matching</a></li>
<li><a href="#org6ef267a">8.1.2. Skeleton and Instantiation</a></li>
</ul>
</li>
<li><a href="#orge7381df">8.2. Desired Behaviour</a></li>
<li><a href="#org6b1e4f5">8.3. Implementation</a>
<ul>
<li><a href="#org30b967a">8.3.1. Matcher</a></li>
<li><a href="#orgd0c41f8">8.3.2. Instantiator</a></li>
<li><a href="#org718f9fb">8.3.3. GIGO Simplifier</a></li>
<li><a href="#orge2589df">8.3.4. Dictionary Implementation</a></li>
<li><a href="#orgb5de8fc">8.3.5. Predicates</a></li>
</ul>
</li>
<li><a href="#orgd9cc50f">8.4. Usage</a>
<ul>
<li><a href="#org9332c0d">8.4.1. Algebraic Simplification</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org347593e">9. Lecture 4B: Generic Operators</a>
<ul>
<li><a href="#orgf99fe15">9.1. Dispatch on Type</a>
<ul>
<li><a href="#orga40476e">9.1.1. On Complex Numbers</a></li>
<li><a href="#org6c2da3c">9.1.2. Arithmetic Implementation</a></li>
<li><a href="#orgd7fdfed">9.1.3. George&rsquo;s Representation</a></li>
<li><a href="#org1e9f668">9.1.4. Martha&rsquo;s Representation</a></li>
<li><a href="#org93df0a7">9.1.5. Type Dispatch Manager</a></li>
<li><a href="#orga5cc5bb">9.1.6. Usage</a></li>
<li><a href="#orgbf73897">9.1.7. Review</a></li>
</ul>
</li>
<li><a href="#org409eae3">9.2. Data-Directed Programming</a>
<ul>
<li><a href="#org4190d8f">9.2.1. Putting George&rsquo;s Procedures</a></li>
<li><a href="#org8e9dced">9.2.2. Putting Martha&rsquo;s Procedures</a></li>
<li><a href="#org123d4a4">9.2.3. Manager Automation</a></li>
<li><a href="#org7a8f45c">9.2.4. Usage</a></li>
</ul>
</li>
<li><a href="#org2c21f98">9.3. Advanced Example: Semi-Complete Arithmetic System</a>
<ul>
<li><a href="#orga9dffd8">9.3.1. Architecture</a></li>
<li><a href="#org543cabf">9.3.2. Implementation</a></li>
<li><a href="#org4896871">9.3.3. Usage</a></li>
<li><a href="#org162edd2">9.3.4. Adding Polynomials</a></li>
<li><a href="#org82f46f7">9.3.5. Recursive Data Directed Programming</a></li>
</ul>
</li>
<li><a href="#org4a0efd8">9.4. Review</a></li>
</ul>
</li>
<li><a href="#org2e05097">10. Lecture 5A: Assignment, State, and Side-Effects</a>
<ul>
<li><a href="#org27f865f">10.1. Functional v. Imperative Style</a>
<ul>
<li><a href="#orgfa0b6f7">10.1.1. Functional Programming</a></li>
<li><a href="#org8a874c5">10.1.2. Imperative Programming</a></li>
<li><a href="#org2cf0b87">10.1.3. Direct Comparison</a></li>
</ul>
</li>
<li><a href="#org9d393be">10.2. Environment Model</a>
<ul>
<li><a href="#org1f522aa">10.2.1. Bound and Free Variables</a></li>
<li><a href="#org17d200c">10.2.2. Scope</a></li>
<li><a href="#org7a62b11">10.2.3. Frames and Environments</a></li>
<li><a href="#org5e6cda4">10.2.4. Procedure Objects</a></li>
<li><a href="#orge53ca4e">10.2.5. Rules for Environment Model</a></li>
<li><a href="#org02448ae">10.2.6. Assignment</a></li>
<li><a href="#orgfa39873">10.2.7. Some Philosophy</a></li>
</ul>
</li>
<li><a href="#orgfe24657">10.3. Advantages of Assignment</a>
<ul>
<li><a href="#org0df3d23">10.3.1. Cesàro&rsquo;s Pi Finder</a></li>
<li><a href="#org01e2557">10.3.2. Functional Cesàro&rsquo;s Pi Finder</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd88d791" class="outline-2">
<h2 id="orgd88d791"><span class="section-number-2">1</span> Prologue</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgae5d882" class="outline-3">
<h3 id="orgae5d882"><span class="section-number-3">1.1</span> About</h3>
<div class="outline-text-3" id="text-1-1">
<p>
These are my notes of the twenty SICP lectures of June 1986,
produced by Hewlett-Packard Television. These videos are available
under a Creative Commons license.
</p>

<p>
These notes aim to be concise and as example-heavy as possible. The
language used and referred to as &ldquo;Lisp&rdquo; is MIT-Scheme. These notes,
however, use the SICP language provided by Racket, a modern Scheme
dialect. This is because Racket&rsquo;s integration with Emacs and
Org mode is orders of magnitude better than MIT-Scheme&rsquo;s. In
general, all &ldquo;Lisp&rdquo; code looks exactly the same as in SICP, with the
exception of having to prefix some numbers with <code>#i</code> to ensure
Racket treats them as imprecise.
</p>
</div>
</div>

<div id="outline-container-orgb75bff5" class="outline-3">
<h3 id="orgb75bff5"><span class="section-number-3">1.2</span> License</h3>
<div class="outline-text-3" id="text-1-2">
</div>
</div>
</div>

<div id="outline-container-orgab2b604" class="outline-2">
<h2 id="orgab2b604"><span class="section-number-2">2</span> Lecture 1A: Overview and Introduction to Lisp</h2>
<div class="outline-text-2" id="text-2">
<p>
Computer science isn&rsquo;t really a science, and it isn&rsquo;t really about
computers. Computer science is the study of how-to or imperative
knowledge (as opposed to declarative knowledge). To illustrate the
difference, consider:
</p>

<p>
\[y = \sqrt{x} \mathrm{~such~that~} y^2=x, y \geq 0\]
</p>

<p>
This is declarative, in that we could recognize if \(y\) is the square
root of \(x\) given \(x\) and \(y\), but we&rsquo;re no closer to knowing how to
<i>find</i> \(y\) if we are given \(x\). Imperative knowledge would look
like:
</p>

<p>
To find the square root \(y\) of \(x\):
</p>
<ul class="org-ul">
<li>Make a guess \(g\).</li>
<li>If \(g^2\) is close enough to \(x\), \(y=g\).</li>
<li>Otherwise, make a new guess equal to the average of \(g\) and \(x/g\).</li>
</ul>

<p>
This method will eventually come up with a \(g\) close enough to the
actual square root \(y\) of \(x\).
</p>

<p>
Computer science focuses on this kind of imperative knowledge, and,
specifically, how to communicate that knowledge to a computer.
</p>
</div>

<div id="outline-container-org9b4389b" class="outline-3">
<h3 id="org9b4389b"><span class="section-number-3">2.1</span> Managing Complexity: Key Ideas of 6.001</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Computer science is also about managing complexity, in that large
programs that you can&rsquo;t hold in your head should still be manageable
and easy to work with. We explore this theme in 6.001 by learning
three key ideas:
</p>

<ul class="org-ul">
<li>Black-box abstractions</li>
<li>Conventional interfaces</li>
<li>Metalinguistic abstraction.</li>
</ul>
</div>
</div>


<div id="outline-container-orgaf3c2b2" class="outline-3">
<h3 id="orgaf3c2b2"><span class="section-number-3">2.2</span> Let&rsquo;s Learn Lisp</h3>
<div class="outline-text-3" id="text-2-2">
<p>
When learning a new language, always ask about its:
</p>
<ul class="org-ul">
<li>Primitive elements,</li>
<li>Means of combination, and</li>
<li>Means of abstraction.</li>
</ul>
</div>

<div id="outline-container-org115bcc5" class="outline-4">
<h4 id="org115bcc5"><span class="section-number-4">2.2.1</span> Primitive Elements</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
These are numbers like 3, 17.4, or 5. Other primitives are
discussed later in the course.
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #2e8b57;">4</span>
<span style="color: #2e8b57;">17.4</span>
<span style="color: #2e8b57;">5</span>
</pre>
</div>

<pre class="example">
4
17.4
5
</pre>
</div>
</div>
