video_notes/index.html

<div id="outline-container-org822992a" class="outline-4">
<h4 id="org822992a"><span class="section-number-4">2.2.2</span> Means of Combination</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Lisp&rsquo;s numerical primitives can be combined with &ldquo;operations&rdquo; such
as addition, written in prefix notation.
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #a626a4;">+</span> <span style="color: #2e8b57;">3</span> <span style="color: #2e8b57;">17.4</span> <span style="color: #2e8b57;">5</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
25.4
</pre>


<p>
Other basic operations are provided by Lisp, such as
multiplication and division. Of course, combinations can be
combined recursively:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #a626a4;">+</span> <span style="color: #2e8b57;">3</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">*</span> <span style="color: #2e8b57;">5</span> <span style="color: #2e8b57;">6</span><span style="color: #a626a4;">)</span> <span style="color: #2e8b57;">8</span> <span style="color: #2e8b57;">2</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
43
</pre>


<p>
This should show you the tree structure inherent in all of Lisp:
</p>
<p>
In Lisp, () is the application of an operation or function in
prefix notation.
</p>
</div>
</div>

<div id="outline-container-org4f4f7ff" class="outline-4">
<h4 id="org4f4f7ff"><span class="section-number-4">2.2.3</span> Means of Abstraction</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
Abstraction can simply be done by naming things. Giving
complicated things a name prevents us from having to understand
how the thing the name refers to <i>works</i>, and instead lets us
&ldquo;abstractly&rdquo; use the name for our purposes.
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">a</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">*</span> <span style="color: #2e8b57;">5</span> <span style="color: #2e8b57;">5</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
a
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">*</span> a a<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">b</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">+</span> a <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> <span style="color: #2e8b57;">5</span> a<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
b
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">+</span> a <span style="color: #a626a4;">(</span><span style="color: #a626a4;">/</span> b <span style="color: #2e8b57;">5</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
25
625
150
55
</pre>


<p>
Now, it&rsquo;s often more useful to abstract away imperative how-to
knowledge. Consider:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orgcac276c"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">square</span> x<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">*</span> x x<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket">
<span style="color: #4078f2;">(</span>square <span style="color: #2e8b57;">10</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
100
</pre>


<p>
This defines <code>square</code> as a function taking a single argument <code>x</code>,
and returning <code>(* x x)</code>. Note that this way of writing a define is
actually &ldquo;syntactic sugar&rdquo; for:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">square</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #50a14f;">(</span>x<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> x x<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>square <span style="color: #2e8b57;">25</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
625
</pre>


<p>
<code>lambda (x)</code> means &ldquo;make a procedure that takes argument <code>x</code>&rdquo;. The
second argument to lambda is the actual procedure body. The
<code>define</code> names this anonymous procedure <code>square</code>.
</p>

<p>
Just like we can use combinations recursively, so we can
abstractions. Consider:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org2427d57"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">average</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">/</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> x y<span style="color: #50a14f;">)</span> <span style="color: #2e8b57;">2</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket">

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">mean-square</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>average <span style="color: #50a14f;">(</span>square x<span style="color: #50a14f;">)</span>
           <span style="color: #50a14f;">(</span>square y<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>mean-square <span style="color: #2e8b57;">2</span> <span style="color: #2e8b57;">3</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
13/2
</pre>


<p>
Note the indentation: since Lisp is parenthesis heavy, we use
indentation. Good editors like Emacs should do this automatically.
</p>
</div>
</div>
</div>

<div id="outline-container-org177258d" class="outline-3">
<h3 id="org177258d"><span class="section-number-3">2.3</span> Case Analysis in Lisp</h3>
<div class="outline-text-3" id="text-2-3">
<p>
To represent functions like:
\[abs(x) = \begin{cases}
   -x & x<0\\
   0 & x = 0\\
   x & x > 0
   \end{cases}\]
Lisp needs some form of conditional execution. In Lisp, this
function would look like:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">abs</span> x<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">cond</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #a626a4;">&lt;</span> x <span style="color: #2e8b57;">0</span><span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">-</span> x<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #a626a4;">=</span> x <span style="color: #2e8b57;">0</span><span style="color: #da8548;">)</span> <span style="color: #2e8b57;">0</span><span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #a626a4;">&gt;</span> x <span style="color: #2e8b57;">0</span><span style="color: #da8548;">)</span> x<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">abs</span> <span style="color: #2e8b57;">-3</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">abs</span> <span style="color: #2e8b57;">0</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">abs</span> <span style="color: #2e8b57;">5</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
3
0
5
</pre>


<p>
<code>cond</code> takes any number of arguments. Each argument must be
structured as <code>(predicate) (consequent)</code>. If <code>predicate</code> is true,
we do the <code>consequent</code>. Otherwise, we don&rsquo;t. Lisp also provides a
way to write conditionals that only have two branches (an if-else):
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org40719ef"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">abs</span> x<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">&lt;</span> x <span style="color: #2e8b57;">0</span><span style="color: #50a14f;">)</span>
      <span style="color: #50a14f;">(</span><span style="color: #a626a4;">-</span> x<span style="color: #50a14f;">)</span>
      x<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket">
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">abs</span> <span style="color: #2e8b57;">-11</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">abs</span> <span style="color: #2e8b57;">0</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">abs</span> <span style="color: #2e8b57;">33</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
11
0
33
</pre>


<p>
<code>cond</code> and <code>if</code> are syntactical sugar for each other. The Lisp
implementation picks any one and defines the other in terms of it.
</p>

<p>
We now know most of Lisp. Lisp doesn&rsquo;t have <code>do...while</code> or <code>for</code>,
since anything a loop can do can be done via recursion.
</p>
</div>
</div>
