video_notes/video_notes.org
** Finding Square Roots

   Remember our square root finding algorithm?

   To find the square root $y$ of $x$:
   - Make a guess $g$.
   - If $g^2$ is close enough to $x$, $y=g$.
   - Otherwise, make a new guess equal to the average of $g$ and
     $x/g$.

   Or, in Lisp,

   #+NAME: try
   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define (try g x)
       (if (good-enough? g x)
           g
           (try (improve g x) x)))
   #+END_SRC

   This is a form of programming called "wishful thinking": we assume
   =good-enough?= (good enough predicate) and =improve= are already
   implemented. Now that we can try a guess and improve it till it's
   good enough, we can write a simple square root function:

   #+NAME: sqrt
   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define (sqrt x)
       (try 1 x))
   #+END_SRC

   This function simply starts the guess at 1, then improves it. Let's
   now write the functions we don't have:

   #+NAME: improve
   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define (improve g x)
       (average g (/ x g)))
   #+END_SRC

   #+NAME: good-enough?
   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define (good-enough? g x)
       (< (abs (- (square g) x))
          0.00001))
   #+END_SRC

   This tests if $g^2$ is within 0.0001 of $x$. Putting it all
   together, we can finally try to find square roots:

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
     <<square>>
     <<average>>
     <<abs>>
     <<improve>>
     <<good-enough?>>
     <<try>>
     <<sqrt>>
     (sqrt #i2)
     (sqrt #i3)
     (sqrt #i4)
   #+END_SRC

   #+RESULTS:
   : 1.4142156862745097
   : 1.7320508100147274
   : 2.0000000929222947

   #+begin_quote
   *Note:* The =#i4= is Racket's syntax for using imprecise
   (decimals) instead of precise (fractions). Ignore it, and treat it
   as the number =4=.
   #+end_quote

   See that =try= actually runs a loop, but does so recursively,
   calling itself every time the =if= condition fails to improve the
   guess. Also note that these functions can all be nested inside the
   square root function to hide them from the outer scope, thus:

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define (sqrt x)
       (define (good-enough? g)
         (define (square g)
           (* g g))
         (define (abs y)
           (if (< y 0)
               (- y)
               y))
         (< (abs (- (square g) x))
            0.0001))
       (define (improve g)
         (define (average y z)
           (/ (+ y z) 2))
         (average g (/ x g)))
       (define (try g)
         (if (good-enough? g)
             g
             (try (improve g))))
       (try 1))

     (sqrt #i2)
   #+END_SRC

   #+RESULTS:
   : 1.4142156862745097

   This program should also show you a tree-like dependency of the
   functions, with each function containing the definitions of the
   functions it depends on. For someone using =sqrt=, all the functions
   within it are hidden.

   #+LATEX: \begin{center}
   #+LATEX: \begin{forest}
   #+LATEX: [\texttt{sqrt}
   #+LATEX: [\texttt{try}
   #+LATEX: [\texttt{good-enough?}
   #+LATEX: [\texttt{abs}] [\texttt{square}]]
   #+LATEX: [\texttt{improve}
   #+LATEX: [\texttt{average}]]
   #+LATEX: [\texttt{try}]]]
   #+LATEX: \end{forest}
   #+LATEX: \end{center}

   This discipline of writing procedures is called lexical scoping.


** Inbuilt/Primitive Procedures Aren't Special

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
     <<square>>
     square
     +
   #+END_SRC

   #+RESULTS:
   : #<procedure:square>
   : #<procedure:+>

* Lecture 1B: Procedures and Processes, Substitution Model

** Substitution Rule/Model
   The substitution rule states that,

   #+begin_quote
   To evaluate an application:
   - Evaluate the operator to get procedure.
   - Evaluate the operands to get arguments.
   - Apply procedure to arguments.
     - Copy body of procedure.
     - Replace formal parameters with actual arguments.
   - Evaluate new body.
   #+end_quote

   Note that this isn't necessarily how the /interpreter/ evaluates a
   Lisp application, but the substitution rule is a "good enough"
   model for our purposes.

*** Kinds of Expressions in Lisp
    - Numbers (evaluate to "themselves")
    - Symbols (represent some procedure)
    - Combinations
    - \lambda-expressions (used to build procedures)
    - Definitions (used to name symbols)
    - Conditionals

    We will focus our use of the substitution rule on the first three.
    The last three are called "special forms", and we'll worry about
    them later.

