video_notes/index.html

<div id="outline-container-org1c6d239" class="outline-3">
<h3 id="org1c6d239"><span class="section-number-3">2.4</span> Finding Square Roots</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Remember our square root finding algorithm?
</p>

<p>
To find the square root \(y\) of \(x\):
</p>
<ul class="org-ul">
<li>Make a guess \(g\).</li>
<li>If \(g^2\) is close enough to \(x\), \(y=g\).</li>
<li>Otherwise, make a new guess equal to the average of \(g\) and
\(x/g\).</li>
</ul>

<p>
Or, in Lisp,
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orgda2091d"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">try</span> g x<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span>good-enough? g x<span style="color: #50a14f;">)</span>
      g
      <span style="color: #50a14f;">(</span>try <span style="color: #da8548;">(</span>improve g x<span style="color: #da8548;">)</span> x<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
This is a form of programming called &ldquo;wishful thinking&rdquo;: we assume
<code>good-enough?</code> (good enough predicate) and <code>improve</code> are already
implemented. Now that we can try a guess and improve it till it&rsquo;s
good enough, we can write a simple square root function:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org1020b0e"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">sqrt</span> x<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>try <span style="color: #2e8b57;">1</span> x<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
This function simply starts the guess at 1, then improves it. Let&rsquo;s
now write the functions we don&rsquo;t have:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orgae8b62c"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">improve</span> g x<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>average g <span style="color: #50a14f;">(</span><span style="color: #a626a4;">/</span> x g<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket" id="org56cf9ce"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">good-enough?</span> g x<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">&lt;</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">abs</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">-</span> <span style="color: #b751b6;">(</span>square g<span style="color: #b751b6;">)</span> x<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
     <span style="color: #2e8b57;">0.00001</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
This tests if \(g^2\) is within 0.0001 of \(x\). Putting it all
together, we can finally try to find square roots:
</p>

<div class="org-src-container">
<pre class="src src-racket">






<span style="color: #4078f2;">(</span><span style="color: #a626a4;">sqrt</span> <span style="color: #2e8b57;">#i2</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">sqrt</span> <span style="color: #2e8b57;">#i3</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">sqrt</span> <span style="color: #2e8b57;">#i4</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
1.4142156862745097
1.7320508100147274
2.0000000929222947
</pre>


<blockquote>
<p>
<b>Note:</b> The <code>#i4</code> is Racket&rsquo;s syntax for using imprecise
(decimals) instead of precise (fractions). Ignore it, and treat it
as the number <code>4</code>.
</p>
</blockquote>

<p>
See that <code>try</code> actually runs a loop, but does so recursively,
calling itself every time the <code>if</code> condition fails to improve the
guess. Also note that these functions can all be nested inside the
square root function to hide them from the outer scope, thus:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">sqrt</span> x<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">define</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">good-enough?</span> g<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">define</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">square</span> g<span style="color: #da8548;">)</span>
      <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> g g<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">define</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">abs</span> y<span style="color: #da8548;">)</span>
      <span style="color: #da8548;">(</span><span style="color: #e45649;">if</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">&lt;</span> y <span style="color: #2e8b57;">0</span><span style="color: #b751b6;">)</span>
          <span style="color: #b751b6;">(</span><span style="color: #a626a4;">-</span> y<span style="color: #b751b6;">)</span>
          y<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #a626a4;">&lt;</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">abs</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">-</span> <span style="color: #986801;">(</span>square g<span style="color: #986801;">)</span> x<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
       <span style="color: #2e8b57;">0.0001</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">define</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">improve</span> g<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">define</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">average</span> y z<span style="color: #da8548;">)</span>
      <span style="color: #da8548;">(</span><span style="color: #a626a4;">/</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">+</span> y z<span style="color: #b751b6;">)</span> <span style="color: #2e8b57;">2</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span>average g <span style="color: #da8548;">(</span><span style="color: #a626a4;">/</span> x g<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">define</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">try</span> g<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">if</span> <span style="color: #da8548;">(</span>good-enough? g<span style="color: #da8548;">)</span>
        g
        <span style="color: #da8548;">(</span>try <span style="color: #b751b6;">(</span>improve g<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>try <span style="color: #2e8b57;">1</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #a626a4;">sqrt</span> <span style="color: #2e8b57;">#i2</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
1.4142156862745097
</pre>


<p>
This program should also show you a tree-like dependency of the
functions, with each function containing the definitions of the
functions it depends on. For someone using <code>sqrt</code>, all the functions
within it are hidden.
</p>

<p>
This discipline of writing procedures is called lexical scoping.
</p>
</div>
</div>


<div id="outline-container-orgbd9cb69" class="outline-3">
<h3 id="orgbd9cb69"><span class="section-number-3">2.5</span> Inbuilt/Primitive Procedures Aren&rsquo;t Special</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-racket">
square
<span style="color: #a626a4;">+</span>
</pre>
</div>

<pre class="example">
#&lt;procedure:square&gt;
#&lt;procedure:+&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf0dffad" class="outline-2">
<h2 id="orgf0dffad"><span class="section-number-2">3</span> Lecture 1B: Procedures and Processes, Substitution Model</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgd19d0bf" class="outline-3">
<h3 id="orgd19d0bf"><span class="section-number-3">3.1</span> Substitution Rule/Model</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The substitution rule states that,
</p>

<blockquote>
<p>
To evaluate an application:
</p>
<ul class="org-ul">
<li>Evaluate the operator to get procedure.</li>
<li>Evaluate the operands to get arguments.</li>
<li>Apply procedure to arguments.
<ul class="org-ul">
<li>Copy body of procedure.</li>
<li>Replace formal parameters with actual arguments.</li>
</ul></li>
<li>Evaluate new body.</li>
</ul>
</blockquote>

<p>
Note that this isn&rsquo;t necessarily how the <i>interpreter</i> evaluates a
Lisp application, but the substitution rule is a &ldquo;good enough&rdquo;
model for our purposes.
</p>
</div>

<div id="outline-container-orgcc2fdcc" class="outline-4">
<h4 id="orgcc2fdcc"><span class="section-number-4">3.1.1</span> Kinds of Expressions in Lisp</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>Numbers (evaluate to &ldquo;themselves&rdquo;)</li>
<li>Symbols (represent some procedure)</li>
<li>Combinations</li>
<li>&lambda;-expressions (used to build procedures)</li>
<li>Definitions (used to name symbols)</li>
<li>Conditionals</li>
</ul>

<p>
We will focus our use of the substitution rule on the first three.
The last three are called &ldquo;special forms&rdquo;, and we&rsquo;ll worry about
them later.
</p>
</div>
</div>
