video_notes/video_notes.org
*** Example

    Consider:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<square>>
      (define (sum-of-squares x y)
        (+ (square x) (square y)))

      (sum-of-squares 3 4)
    #+END_SRC

    #+RESULTS:
    : 25

    Let's try to apply the substitution rule to our application,

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (sum-of-squares 3 4)
      (+ (square 3) (square 4))
      (+ (square 3) (* 4 4))
      (+ (square 3) 16)
      (+ (* 3 3) 16)
      (+ 9 16)
      25
    #+END_SRC

** Peano Arithmetic

*** Simple Peano Addition
    Peano arithmetic defines addition as:

    #+NAME: peano-a
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      (define (pa+ x y)
        (if (= x 0)
            y
            (pa+ (dec x) (inc y))))
    #+END_SRC

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<peano-a>>
      (pa+ 3 4)
    #+END_SRC

    #+RESULTS:
    : 7

    Assume that =inc= and =dec= are primitives available that increment
    and decrement the argument respectively. How is the procedure =pa+=
    working? Let's apply the substitution rule.

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (pa+ 3 4)
      (if (= 3 0)
          4
          (pa+ (dec 3) (inc 4)))
      (pa+ 2 5)
      ...
      (pa+ 1 6)
      ...
      (pa+ 0 7)
      7
    #+END_SRC

    We're skipping some steps, but the idea is that =x= keeps giving
    one "unit" to =y= until it reaches zero. Then the sum is =y=.
    Written with steps skipped:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (pa+ 3 4)
      (pa+ 2 5)
      (pa+ 1 6)
      (pa+ 0 7)
      7
    #+END_SRC

