video_notes/index.html

<div id="outline-container-orgcd80e24" class="outline-4">
<h4 id="orgcd80e24"><span class="section-number-4">3.1.2</span> Example</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Consider:
</p>

<div class="org-src-container">
<pre class="src src-racket">
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">sum-of-squares</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">+</span> <span style="color: #50a14f;">(</span>square x<span style="color: #50a14f;">)</span> <span style="color: #50a14f;">(</span>square y<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>sum-of-squares <span style="color: #2e8b57;">3</span> <span style="color: #2e8b57;">4</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
25
</pre>


<p>
Let&rsquo;s try to apply the substitution rule to our application,
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span>sum-of-squares <span style="color: #2e8b57;">3</span> <span style="color: #2e8b57;">4</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">+</span> <span style="color: #a626a4;">(</span>square <span style="color: #2e8b57;">3</span><span style="color: #a626a4;">)</span> <span style="color: #a626a4;">(</span>square <span style="color: #2e8b57;">4</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">+</span> <span style="color: #a626a4;">(</span>square <span style="color: #2e8b57;">3</span><span style="color: #a626a4;">)</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">*</span> <span style="color: #2e8b57;">4</span> <span style="color: #2e8b57;">4</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">+</span> <span style="color: #a626a4;">(</span>square <span style="color: #2e8b57;">3</span><span style="color: #a626a4;">)</span> <span style="color: #2e8b57;">16</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">+</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">*</span> <span style="color: #2e8b57;">3</span> <span style="color: #2e8b57;">3</span><span style="color: #a626a4;">)</span> <span style="color: #2e8b57;">16</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">+</span> <span style="color: #2e8b57;">9</span> <span style="color: #2e8b57;">16</span><span style="color: #4078f2;">)</span>
<span style="color: #2e8b57;">25</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org864c59c" class="outline-3">
<h3 id="org864c59c"><span class="section-number-3">3.2</span> Peano Arithmetic</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org4980c07" class="outline-4">
<h4 id="org4980c07"><span class="section-number-4">3.2.1</span> Simple Peano Addition</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Peano arithmetic defines addition as:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org2dc4eea"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">pa+</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">=</span> x <span style="color: #2e8b57;">0</span><span style="color: #50a14f;">)</span>
      y
      <span style="color: #50a14f;">(</span>pa+ <span style="color: #da8548;">(</span>dec x<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>inc y<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket">
<span style="color: #4078f2;">(</span>pa+ <span style="color: #2e8b57;">3</span> <span style="color: #2e8b57;">4</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
7
</pre>


<p>
Assume that <code>inc</code> and <code>dec</code> are primitives available that increment
and decrement the argument respectively. How is the procedure <code>pa+</code>
working? Let&rsquo;s apply the substitution rule.
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span>pa+ <span style="color: #2e8b57;">3</span> <span style="color: #2e8b57;">4</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">if</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">=</span> <span style="color: #2e8b57;">3</span> <span style="color: #2e8b57;">0</span><span style="color: #a626a4;">)</span>
    <span style="color: #2e8b57;">4</span>
    <span style="color: #a626a4;">(</span>pa+ <span style="color: #50a14f;">(</span>dec <span style="color: #2e8b57;">3</span><span style="color: #50a14f;">)</span> <span style="color: #50a14f;">(</span>inc <span style="color: #2e8b57;">4</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>pa+ <span style="color: #2e8b57;">2</span> <span style="color: #2e8b57;">5</span><span style="color: #4078f2;">)</span>
<span style="color: #e45649;">...</span>
<span style="color: #4078f2;">(</span>pa+ <span style="color: #2e8b57;">1</span> <span style="color: #2e8b57;">6</span><span style="color: #4078f2;">)</span>
<span style="color: #e45649;">...</span>
<span style="color: #4078f2;">(</span>pa+ <span style="color: #2e8b57;">0</span> <span style="color: #2e8b57;">7</span><span style="color: #4078f2;">)</span>
<span style="color: #2e8b57;">7</span>
</pre>
</div>

<p>
We&rsquo;re skipping some steps, but the idea is that <code>x</code> keeps giving
one &ldquo;unit&rdquo; to <code>y</code> until it reaches zero. Then the sum is <code>y</code>.
Written with steps skipped:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span>pa+ <span style="color: #2e8b57;">3</span> <span style="color: #2e8b57;">4</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>pa+ <span style="color: #2e8b57;">2</span> <span style="color: #2e8b57;">5</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>pa+ <span style="color: #2e8b57;">1</span> <span style="color: #2e8b57;">6</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>pa+ <span style="color: #2e8b57;">0</span> <span style="color: #2e8b57;">7</span><span style="color: #4078f2;">)</span>
<span style="color: #2e8b57;">7</span>
</pre>
</div>
</div>
</div>
