video_notes/index.html

<div id="outline-container-org1726c81" class="outline-4">
<h4 id="org1726c81"><span class="section-number-4">3.2.2</span> Another Peano Adder</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
Consider:
</p>
<div class="org-src-container">
<pre class="src src-racket" id="org9c445cb"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">pb+</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">=</span> x <span style="color: #2e8b57;">0</span><span style="color: #50a14f;">)</span>
      y
      <span style="color: #50a14f;">(</span>inc <span style="color: #da8548;">(</span>pb+ <span style="color: #b751b6;">(</span>dec x<span style="color: #b751b6;">)</span> y<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>


<p>
This is also a Peano adder: but it&rsquo;s implemented <i>slightly</i>
differently syntax-wise, a few characters here and there. Let&rsquo;s
use the substitution rule to see how it works.
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span>pb+ <span style="color: #2e8b57;">3</span> <span style="color: #2e8b57;">4</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>inc <span style="color: #a626a4;">(</span>pb+ <span style="color: #2e8b57;">2</span> <span style="color: #2e8b57;">4</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>inc <span style="color: #a626a4;">(</span>inc <span style="color: #50a14f;">(</span>pb+ <span style="color: #2e8b57;">1</span> <span style="color: #2e8b57;">4</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>inc <span style="color: #a626a4;">(</span>inc <span style="color: #50a14f;">(</span>inc <span style="color: #da8548;">(</span>pb+ <span style="color: #2e8b57;">0</span> <span style="color: #2e8b57;">4</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>inc <span style="color: #a626a4;">(</span>inc <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>inc <span style="color: #2e8b57;">4</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>inc <span style="color: #a626a4;">(</span>inc <span style="color: #2e8b57;">5</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>inc <span style="color: #2e8b57;">6</span><span style="color: #4078f2;">)</span>
<span style="color: #2e8b57;">7</span>
</pre>
</div>

<p>
See that it <i>does</i> work:
</p>

<div class="org-src-container">
<pre class="src src-racket">
<span style="color: #4078f2;">(</span>pb+ <span style="color: #2e8b57;">3</span> <span style="color: #2e8b57;">4</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
7
</pre>


<p>
Now, consider how these two, <code>pa+</code> and <code>pb+</code>, are different. While
the <i>procedures</i> do the same thing, the processes are wildly
different. Let&rsquo;s discuss their time and space complexity.
It should be obvious to you that the time complexity is the
vertical axis in the substitution rule application, since the
interpreter &ldquo;executes&rdquo; these instructions line by line. More lines
means more time.
</p>

<p>
In the case of <code>pa+</code>, the number of lines increases by 1 if you
increase input <code>x</code> by 1. Thus, the time complexity is \(O(x)\).
Similarly, in the case of <code>pb+</code>, the number of lines increases by
2 (once in the expansion, once in the contraction) when you
increase <code>x</code> by 1. Thus, it is also \(O(x)\).
</p>

<p>
Now, the horizontal axis shows us how much space is being used. In
the case of <code>pa+</code>, the space used is a constant. Thus, \(O(1)\). On
the other hand, see that <code>pb+</code> first <i>expands</i> then <i>contracts</i>.
The length of the maximum expansion increases by 1 if we increase
\(x\) by 1, since there&rsquo;s one more increment to do. Thus, \(O(x)\).
</p>

<p>
Now, we call a process like <code>pa+</code> <i>linear iterative</i> and a process
like <code>pb+</code> <i>linear recursive</i>.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Process</th>
<th scope="col" class="org-left">Time Complexity</th>
<th scope="col" class="org-left">Space Complexity</th>
<th scope="col" class="org-left">Type</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>pa+</code></td>
<td class="org-left">\(O(x)\)</td>
<td class="org-left">\(O(1)\)</td>
<td class="org-left">Linear iterative</td>
</tr>

<tr>
<td class="org-left"><code>pb+</code></td>
<td class="org-left">\(O(x)\)</td>
<td class="org-left">\(O(x)\)</td>
<td class="org-left">Linear recursive</td>
</tr>
</tbody>
</table>

<p>
Note that the <i>process</i> <code>pa+</code> being iterative has nothing to do
with the implementation/definition of the <i>procedure</i>, which is
recursive. Iteration refers to the constant space requirement.
</p>
</div>
</div>
</div>

<div id="outline-container-orgb424a0c" class="outline-3">
<h3 id="orgb424a0c"><span class="section-number-3">3.3</span> Differentiating Between Iterative and Recursive Processes</h3>
<div class="outline-text-3" id="text-3-3">
<p>
One of the primary ways to differentiate between an iterative and
recursive process is to imagine what&rsquo;d happen if you turned the
computer off, then resumed the current computation.
</p>

<p>
In a recursive process, we&rsquo;ve lost some important information: how
deep into the recursion we are. In the <code>pb+</code> example, we wouldn&rsquo;t
know how many <code>inc</code>&rsquo;s deep we are (information stored in the RAM by
the interpreter, not by the process), meaning that we can&rsquo;t return
the right value.
</p>

<p>
In an iterative process, we can pick up right where we left off,
since <i>all</i> state information is contained by the process.
</p>
</div>
</div>

<div id="outline-container-org586a9c7" class="outline-3">
<h3 id="org586a9c7"><span class="section-number-3">3.4</span> Fibonacci Numbers</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Fibonacci numbers are defined as:
</p>

<p>
\[F(x) =
   \begin{cases}
   0, & x = 0\\
   1, & x = 1\\
   F(x-1) + F(x-2), & \mathrm{otherwise}
   \end{cases}\]
</p>

<p>
The series itself is:
\[0,1,1,2,3,5,8,13,21,34,55\dots\]
</p>

<p>
Let&rsquo;s write a Lisp function to calculate the \(n\mathrm{th}\) Fibonacci
number, assuming 0 is the 0th.
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">fib</span> n<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">&lt;</span> n <span style="color: #2e8b57;">2</span><span style="color: #50a14f;">)</span>
      n
      <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span>fib <span style="color: #b751b6;">(</span><span style="color: #a626a4;">-</span> n <span style="color: #2e8b57;">1</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span>fib <span style="color: #b751b6;">(</span><span style="color: #a626a4;">-</span> n <span style="color: #2e8b57;">2</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>fib <span style="color: #2e8b57;">10</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
55
</pre>


<p>
It works, that&rsquo;s true. But how <i>well</i> does it work. Let&rsquo;s see. When
we call (say) <code>(fib 4)</code>, we also call <code>(fib 3)</code> and <code>(fib 2)</code>, both
of which also call \(\dots\) let&rsquo;s draw it:
</p>

<p>
A tree! Clearly, this is an exponential-time process, since
computing \(n+1\) takes exponentially more effort. Also note that
it&rsquo;s a pretty bad process, since we constantly recompute many
values. The space complexity is the maximum depth of the tree
(depth of recursion), which is at most \(n\). Therefore, the time
complexity is \(O(\mathrm{fib}(n))\) and space complexity is \(O(n)\).
</p>

<p>
It is useful to try and write an iterative Fibonacci with better
performance as an exercise.
</p>
</div>
</div>
