video_notes/video_notes.org
** Towers of Hanoi

   From Wikipedia:

   #+begin_quote
   The Tower of Hanoi is a mathematical game or puzzle. It consists of
   three rods and a number of disks of different diameters, which can
   slide onto any rod. The puzzle starts with the disks stacked on one
   rod in order of decreasing size, the smallest at the top, thus
   approximating a conical shape. The objective of the puzzle is to
   move the entire stack to the last rod, obeying the following simple
   rules:

   - Only one disk may be moved at a time.
   - Each move consists of taking the upper disk from one of the
     stacks and placing it on top of another stack or an empty rod.
   - No disk may be placed on top of a disk that is smaller than it.
   #+end_quote

   Let's try to solve Hanoi for 4 disks, from rod A to rod C. Again
   --- "wishful thinking". Let's assume that we know how to solve for
   3 disks. To solve, we'd take the top 3 disks, put it on the spare
   rod B. Then, we'd take the fourth and largest disk, and put it on
   destination rod C. Finally, we'd move the three disk pile from B
   to C. Solved!

   But wait --- to solve the 3 disk case, let's assume we know how to
   solve the 2 disk case.

   To solve the 2 disk case, we should know how
   to solve the one disk case, which is just moving a disk from a rod
   to another.

   Or, in Lisp,

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define (move n from to spare)
       (cond ((= n 1) (display "Move disk at rod ")
                      (display from)
                      (display " to rod ")
                      (display to)
                      (display ".\n"))
             (else
              (move (- n 1) from spare to)
              (move 1 from to spare)
              (move (- n 1) spare to from))))

     (move 4 "A" "C" "B")
   #+END_SRC

   #+RESULTS:
   #+begin_example
   Move disk at rod A to rod B.
   Move disk at rod A to rod C.
   Move disk at rod B to rod C.
   Move disk at rod A to rod B.
   Move disk at rod C to rod A.
   Move disk at rod C to rod B.
   Move disk at rod A to rod B.
   Move disk at rod A to rod C.
   Move disk at rod B to rod C.
   Move disk at rod B to rod A.
   Move disk at rod C to rod A.
   Move disk at rod B to rod C.
   Move disk at rod A to rod B.
   Move disk at rod A to rod C.
   Move disk at rod B to rod C.
   #+end_example

   Note, of course, that this procedure too, is an exponential time
   procedure. However, any procedure for Hanoi will be exponential
   time, since for $n$ disks, Hanoi requires $2^{n-1}$ moves. Even if
   you compute every move in $O(1)$ (which we do, since it's just a
   print), the complexity will be $O(2^n)$.

** Iterative Fibonacci

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define (iter-fib n a b)
       (if (= n 1)
           b
           (iter-fib (dec n) b (+ a b))))

     (define (fib n)
       (iter-fib n 0 1))

     (fib 10)
   #+END_SRC

   #+RESULTS:
   : 55

* Lecture 2A: Higher-Order Procedures

