video_notes/index.html

<div id="outline-container-org2f75381" class="outline-3">
<h3 id="org2f75381"><span class="section-number-3">3.5</span> Towers of Hanoi</h3>
<div class="outline-text-3" id="text-3-5">
<p>
From Wikipedia:
</p>

<blockquote>
<p>
The Tower of Hanoi is a mathematical game or puzzle. It consists of
three rods and a number of disks of different diameters, which can
slide onto any rod. The puzzle starts with the disks stacked on one
rod in order of decreasing size, the smallest at the top, thus
approximating a conical shape. The objective of the puzzle is to
move the entire stack to the last rod, obeying the following simple
rules:
</p>

<ul class="org-ul">
<li>Only one disk may be moved at a time.</li>
<li>Each move consists of taking the upper disk from one of the
stacks and placing it on top of another stack or an empty rod.</li>
<li>No disk may be placed on top of a disk that is smaller than it.</li>
</ul>
</blockquote>

<p>
Let&rsquo;s try to solve Hanoi for 4 disks, from rod A to rod C. Again
&#x2014; &ldquo;wishful thinking&rdquo;. Let&rsquo;s assume that we know how to solve for
3 disks. To solve, we&rsquo;d take the top 3 disks, put it on the spare
rod B. Then, we&rsquo;d take the fourth and largest disk, and put it on
destination rod C. Finally, we&rsquo;d move the three disk pile from B
to C. Solved!
</p>

<p>
But wait &#x2014; to solve the 3 disk case, let&rsquo;s assume we know how to
solve the 2 disk case.
</p>

<p>
To solve the 2 disk case, we should know how
to solve the one disk case, which is just moving a disk from a rod
to another.
</p>

<p>
Or, in Lisp,
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">move</span> n from to spare<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">cond</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #a626a4;">=</span> n <span style="color: #2e8b57;">1</span><span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">display</span> <span style="color: #50a14f;">"Move disk at rod "</span><span style="color: #da8548;">)</span>
                 <span style="color: #da8548;">(</span><span style="color: #a626a4;">display</span> from<span style="color: #da8548;">)</span>
                 <span style="color: #da8548;">(</span><span style="color: #a626a4;">display</span> <span style="color: #50a14f;">" to rod "</span><span style="color: #da8548;">)</span>
                 <span style="color: #da8548;">(</span><span style="color: #a626a4;">display</span> to<span style="color: #da8548;">)</span>
                 <span style="color: #da8548;">(</span><span style="color: #a626a4;">display</span> <span style="color: #50a14f;">".\n"</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span><span style="color: #e45649;">else</span>
         <span style="color: #da8548;">(</span>move <span style="color: #b751b6;">(</span><span style="color: #a626a4;">-</span> n <span style="color: #2e8b57;">1</span><span style="color: #b751b6;">)</span> from spare to<span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span>move <span style="color: #2e8b57;">1</span> from to spare<span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span>move <span style="color: #b751b6;">(</span><span style="color: #a626a4;">-</span> n <span style="color: #2e8b57;">1</span><span style="color: #b751b6;">)</span> spare to from<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>move <span style="color: #2e8b57;">4</span> <span style="color: #50a14f;">"A"</span> <span style="color: #50a14f;">"C"</span> <span style="color: #50a14f;">"B"</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
Move disk at rod A to rod B.
Move disk at rod A to rod C.
Move disk at rod B to rod C.
Move disk at rod A to rod B.
Move disk at rod C to rod A.
Move disk at rod C to rod B.
Move disk at rod A to rod B.
Move disk at rod A to rod C.
Move disk at rod B to rod C.
Move disk at rod B to rod A.
Move disk at rod C to rod A.
Move disk at rod B to rod C.
Move disk at rod A to rod B.
Move disk at rod A to rod C.
Move disk at rod B to rod C.
</pre>

<p>
Note, of course, that this procedure too, is an exponential time
procedure. However, any procedure for Hanoi will be exponential
time, since for \(n\) disks, Hanoi requires \(2^{n-1}\) moves. Even if
you compute every move in \(O(1)\) (which we do, since it&rsquo;s just a
print), the complexity will be \(O(2^n)\).
</p>
</div>
</div>

<div id="outline-container-orged40f06" class="outline-3">
<h3 id="orged40f06"><span class="section-number-3">3.6</span> Iterative Fibonacci</h3>
<div class="outline-text-3" id="text-3-6">
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">iter-fib</span> n a b<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">=</span> n <span style="color: #2e8b57;">1</span><span style="color: #50a14f;">)</span>
      b
      <span style="color: #50a14f;">(</span>iter-fib <span style="color: #da8548;">(</span>dec n<span style="color: #da8548;">)</span> b <span style="color: #da8548;">(</span><span style="color: #a626a4;">+</span> a b<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">fib</span> n<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>iter-fib n <span style="color: #2e8b57;">0</span> <span style="color: #2e8b57;">1</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>fib <span style="color: #2e8b57;">10</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
55
</pre>
</div>
</div>
</div>

<div id="outline-container-org2373aa3" class="outline-2">
<h2 id="org2373aa3"><span class="section-number-2">4</span> Lecture 2A: Higher-Order Procedures</h2>
<div class="outline-text-2" id="text-4">
</div>
