video_notes/index.html
<div id="outline-container-org9d0e24a" class="outline-3">
<h3 id="org9d0e24a"><span class="section-number-3">4.1</span> Abstracting Procedural Ideas</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Consider the functions and their respective (recursive) procedures:
</p>

<p>
\[\sum_{i=a}^{b} i\]
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">sum-int</span> a b<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">&gt;</span> a b<span style="color: #50a14f;">)</span>
      <span style="color: #2e8b57;">0</span>
      <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> a
         <span style="color: #da8548;">(</span>sum-int <span style="color: #b751b6;">(</span>inc a<span style="color: #b751b6;">)</span> b<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>sum-int <span style="color: #2e8b57;">0</span> <span style="color: #2e8b57;">10</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
55
</pre>


<p>
\[\sum_{i=a}^{b} i^{2}\]
</p>

<div class="org-src-container">
<pre class="src src-racket">
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">sum-sq</span> a b<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">&gt;</span> a b<span style="color: #50a14f;">)</span>
      <span style="color: #2e8b57;">0</span>
      <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span>square a<span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span>sum-sq <span style="color: #b751b6;">(</span>inc a<span style="color: #b751b6;">)</span> b<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>sum-sq <span style="color: #2e8b57;">0</span> <span style="color: #2e8b57;">4</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
30
</pre>


<p>
\[\sum_{i=a_{\mathrm{~by~}4}}^{b} \frac{1}{i(i+2)}\]
</p>

<p>
Note that this series estimates \(\pi /8\).
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">sum-pi</span> a b<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">&gt;</span> a b<span style="color: #50a14f;">)</span>
      <span style="color: #2e8b57;">0</span>
      <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">/</span> <span style="color: #2e8b57;">1</span>
            <span style="color: #b751b6;">(</span><span style="color: #a626a4;">*</span> a <span style="color: #986801;">(</span><span style="color: #a626a4;">+</span> a <span style="color: #2e8b57;">2</span><span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span>sum-pi <span style="color: #b751b6;">(</span><span style="color: #a626a4;">+</span> a <span style="color: #2e8b57;">4</span><span style="color: #b751b6;">)</span> b<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #a626a4;">*</span> <span style="color: #2e8b57;">8</span> <span style="color: #a626a4;">(</span>sum-pi <span style="color: #2e8b57;">#i1</span> <span style="color: #2e8b57;">#i1000000</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
3.141590653589793
</pre>



<p>
See that the commonality between these procedures comes from the
fact that the notion of &ldquo;summation&rdquo; from <code>a</code> to <code>b</code> is the same,
but the <i>function</i> being summed is different in each case. Or, in
general form:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">&lt;name&gt;</span> a b<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">&gt;</span> a b<span style="color: #50a14f;">)</span>
      <span style="color: #2e8b57;">0</span>
      <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span>&lt;term&gt; a<span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span>&lt;name&gt; <span style="color: #b751b6;">(</span>&lt;next&gt; a<span style="color: #b751b6;">)</span> b<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
The way to solve this is by writing a procedure <code>sum</code>, which has
available to it two procedures <code>term</code> and <code>next</code>. We supply these
as arguments. Consider:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org2765fc0"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">sum</span> term a next b<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">&gt;</span> a b<span style="color: #50a14f;">)</span>
      <span style="color: #2e8b57;">0</span>
      <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span>term a<span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span>sum term <span style="color: #b751b6;">(</span>next a<span style="color: #b751b6;">)</span> next b<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
When we call <code>sum</code> recursively, see that we pass to it the <i>same
procedures</i> <code>term</code> and <code>next</code>, along with <code>b</code> and the next value of
<code>a</code>. Now, it is easy to define <code>sum-int</code>, <code>sum-sq</code>, and <code>sum-pi</code>
using <code>sum</code>, thus:
</p>

<div class="org-src-container">
<pre class="src src-racket">
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">sum-int</span> a b<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">define</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">identity</span> x<span style="color: #50a14f;">)</span> x<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>sum <span style="color: #a626a4;">identity</span>
       a
       inc
       b<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>sum-int <span style="color: #2e8b57;">0</span> <span style="color: #2e8b57;">10</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
55
</pre>


<p>
<code>identity</code> is the function \(p(x) = x\).
</p>

<div class="org-src-container">
<pre class="src src-racket">

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">sum-sq</span> a b<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>sum square
       a
       inc
       b<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>sum-sq <span style="color: #2e8b57;">0</span> <span style="color: #2e8b57;">4</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
30
</pre>


<div class="org-src-container">
<pre class="src src-racket">
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">sum-pi</span> a b<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>sum <span style="color: #50a14f;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #da8548;">(</span>x<span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span><span style="color: #a626a4;">/</span> <span style="color: #2e8b57;">1</span>
            <span style="color: #b751b6;">(</span><span style="color: #a626a4;">*</span> x <span style="color: #986801;">(</span><span style="color: #a626a4;">+</span> x <span style="color: #2e8b57;">2</span><span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
       a
       <span style="color: #50a14f;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #da8548;">(</span>x<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">+</span> x <span style="color: #2e8b57;">4</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
       b<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #a626a4;">*</span> <span style="color: #2e8b57;">8</span> <span style="color: #a626a4;">(</span>sum-pi <span style="color: #2e8b57;">#i1</span> <span style="color: #2e8b57;">#i1000000</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
3.141590653589793
</pre>


<p>
Recall that <code>lambda</code> means &ldquo;make a procedure&rdquo; that is nameless. In
<code>sum-pi</code>, we choose to give <code>sum</code> anonymous functions as arguments
instead of defining our own, because there&rsquo;s no reason to name a
procedure we won&rsquo;t later use.
</p>

<p>
The big advantage of abstracting away <code>sum</code> this way is that in
case we want to implement it in a different way, we merely have to
change the implementation of one function (<code>sum</code>) and not that of
the three functions that use it. In fact, those functions can
remain exactly the same.
</p>

<p>
Here&rsquo;s another implementation of <code>sum</code>. See that <code>sum-pi</code> still
works without changes, because it doesn&rsquo;t care about how <code>sum</code> is
implemented as long as the argument number and order remains
constant.
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">sum</span> term a next b<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">define</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">iter</span> j ans<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">if</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">&gt;</span> j b<span style="color: #da8548;">)</span>
        ans
        <span style="color: #da8548;">(</span>iter <span style="color: #b751b6;">(</span>next j<span style="color: #b751b6;">)</span>
              <span style="color: #b751b6;">(</span><span style="color: #a626a4;">+</span> <span style="color: #986801;">(</span>term j<span style="color: #986801;">)</span>
                 ans<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>iter a <span style="color: #2e8b57;">0</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">sum-pi</span> a b<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>sum <span style="color: #50a14f;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #da8548;">(</span>x<span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span><span style="color: #a626a4;">/</span> <span style="color: #2e8b57;">1</span>
            <span style="color: #b751b6;">(</span><span style="color: #a626a4;">*</span> x <span style="color: #986801;">(</span><span style="color: #a626a4;">+</span> x <span style="color: #2e8b57;">2</span><span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
       a
       <span style="color: #50a14f;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #da8548;">(</span>x<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">+</span> x <span style="color: #2e8b57;">4</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
       b<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #a626a4;">*</span> <span style="color: #2e8b57;">8</span> <span style="color: #a626a4;">(</span>sum-pi <span style="color: #2e8b57;">#i1</span> <span style="color: #2e8b57;">#i1000000</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
3.1415906535898936
</pre>
</div>
</div>
