video_notes/index.html

<div id="outline-container-org35f35b0" class="outline-3">
<h3 id="org35f35b0"><span class="section-number-3">4.2</span> More on Square Roots</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Recall our square root procedure. When seen in Lisp code, it&rsquo;s not
very clear what it&rsquo;s doing, or how it&rsquo;s working.
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org76d81ce"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">sqrt</span> x<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">define</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">good-enough?</span> g<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">define</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">square</span> g<span style="color: #da8548;">)</span>
      <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> g g<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">define</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">abs</span> y<span style="color: #da8548;">)</span>
      <span style="color: #da8548;">(</span><span style="color: #e45649;">if</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">&lt;</span> y <span style="color: #2e8b57;">0</span><span style="color: #b751b6;">)</span>
          <span style="color: #b751b6;">(</span><span style="color: #a626a4;">-</span> y<span style="color: #b751b6;">)</span>
          y<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #a626a4;">&lt;</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">abs</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">-</span> <span style="color: #986801;">(</span>square g<span style="color: #986801;">)</span> x<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
       <span style="color: #2e8b57;">0.0001</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">define</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">improve</span> g<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">define</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">average</span> y z<span style="color: #da8548;">)</span>
      <span style="color: #da8548;">(</span><span style="color: #a626a4;">/</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">+</span> y z<span style="color: #b751b6;">)</span> <span style="color: #2e8b57;">2</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span>average g <span style="color: #da8548;">(</span><span style="color: #a626a4;">/</span> x g<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">define</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">try</span> g<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">if</span> <span style="color: #da8548;">(</span>good-enough? g<span style="color: #da8548;">)</span>
        g
        <span style="color: #da8548;">(</span>try <span style="color: #b751b6;">(</span>improve g<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>try <span style="color: #2e8b57;">1</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket">
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">sqrt</span> <span style="color: #2e8b57;">#i2</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
1.4142156862745097
</pre>


<p>
Let&rsquo;s use higher-order procedure abstraction to make it clearer.
</p>
</div>

<div id="outline-container-org260aed9" class="outline-4">
<h4 id="org260aed9"><span class="section-number-4">4.2.1</span> Fixed Points</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
Recall that the algorithm itself relies on writing a function
</p>

<p>
\[f\colon y\mapsto \frac{y+\frac{x}{y}}{2}\]
</p>

<p>
Note that this works because \(f(\sqrt{x}) = \sqrt{x}\):
</p>

<p>
\[f(\sqrt{x})=\frac{\sqrt{x}+\frac{x}{\sqrt{x}}}{2} = \frac{2\sqrt{x}}{2} = \sqrt{x}\]
</p>

<p>
See that this is <i>actually</i> an algorithm for finding a fixed point
of a function \(f\), which is defined as finding the point where
\(f(z)=z\). This algorithm is merely an instance of a function \(f\)
whose fixed point happens to be the square root.
</p>

<blockquote>
<p>
For some functions, the fixed point can be found by iterating it.
</p>
</blockquote>

<p>
This is the top-level abstraction we&rsquo;ll write a function for.
First, let&rsquo;s see how we&rsquo;d write a square-root function by wishful
thinking:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org0c4e68d">
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">sqrt</span> x<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>fixed-point
   <span style="color: #50a14f;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #da8548;">(</span>y<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>average <span style="color: #b751b6;">(</span><span style="color: #a626a4;">/</span> x y<span style="color: #b751b6;">)</span>
                        y<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #2e8b57;">1</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Now writing <code>fixed-point</code>:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org811a758">
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">fixed-point</span> f start<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">define</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">close-enough-p</span> x y<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #a626a4;">&lt;</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">abs</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">-</span> x y<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
       <span style="color: #2e8b57;">0.00001</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">define</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">iter</span> old <span style="color: #a626a4;">new</span><span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">if</span> <span style="color: #da8548;">(</span>close-enough-p old <span style="color: #a626a4;">new</span><span style="color: #da8548;">)</span>
        <span style="color: #a626a4;">new</span>
        <span style="color: #da8548;">(</span>iter <span style="color: #a626a4;">new</span> <span style="color: #b751b6;">(</span>f <span style="color: #a626a4;">new</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>iter start <span style="color: #50a14f;">(</span>f start<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Let&rsquo;s try it out!
</p>

<div class="org-src-container">
<pre class="src src-racket">

<span style="color: #4078f2;">(</span><span style="color: #a626a4;">sqrt</span> <span style="color: #2e8b57;">#i2</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
1.4142135623746899
</pre>
</div>
</div>
