video_notes/video_notes.org
*** Damping Oscillations

    A fair question when seeing the function
    $$f_1\colon y\mapsto \frac{y+\frac{x}{y}}{2}$$
    is why another function
    $$f\colon y\mapsto \frac{x}{y}$$
    wouldn't work in its place. This question is best
    answered by trying to find its fixed point by iteration. Let's try
    to find it for $x=2$, starting at $y=1$. Then,

    $$f(1) = \frac{2}{1} = 2$$
    $$f(2) = \frac{2}{2} = 1$$
    $$f(1) = \frac{2}{1} = 2$$
    $$f(2) = \frac{2}{2} = 1$$
    $$~\dots$$

    It seems that instead of converging, this function is
    /oscillating/ between two values. We know that it's easy to fix
    this: we have to damp these oscillations. The most natural way to
    do this is to take the average of successive values $y$ and
    $f(y)$. A =sqrt= function that uses average damping would be:

    #+NAME: fp-avg-sqrt
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<fixed-point>>
      (define (sqrt x)
        (fixed-point
         (avg-damp (lambda (y) (/ x y)))
         1))
    #+END_SRC

    The =avg-damp= function takes in a procedure, creates an average damping
    procedure, and returns it. Or, in Lisp:

    #+NAME: avg-damp
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<average>>
      (define avg-damp
        (lambda (f)
          (lambda (x) (average (f x) x))))
    #+END_SRC

    It is worth discussing how =avg-damp= works. It is defined as a
    procedure which takes the argument of a function =f=. It then
    returns an anonymous procedure which takes an argument =x=, and
    computes the average of $f(x)$ and $x$. This is finally the
    highest level of abstraction we can reach for the =sqrt=
    algorithm --- finding the fixed point of a damped oscillating
    function.

    Using the =sqrt= function,

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<avg-damp>>
      <<fp-avg-sqrt>>
      (sqrt #i2)
    #+END_SRC

    #+RESULTS:
    : 1.4142135623746899

** Newton's Method

   Newton's method is used to find the zeros of a function ($y \ni
   f(y)=0$). To use it, start with some guess $y_0$. Then,

   $$y_{n+1} = y_n - \frac{f(y_n)}{f'(y_n)}$$

   where $$f'(y) = \frac{\mathrm{d}f(y)}{\mathrm{d}y}$$

   We can, of course, find the zero of the square root finding function
   $f(y) =  x-y^2$ using Newton's method. Note that Newton's method
   /itself/ is based on fixed points, since it aims to find a fixed
   point where $y_{n+1}\approx y_n$.

   Defining =sqrt=:

   #+NAME: newton-sqrt
   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
     <<square>>
     (define (sqrt x)
       (newton (lambda (y) (- x (square y)))
               1))
   #+END_SRC

   We pass to =newton= a function $f(y)=x-y^2$, since its zero is $x=y^2$.

   #+NAME: newton
   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
     <<fixed-point>>
     (define (newton f guess)
       (define df (deriv f))
       (fixed-point
        (lambda (x) (- x
                       (/ (f x)
                          (df x))))
        guess))
   #+END_SRC


   It is important to note that defining =df= to be =(deriv f)= once
   prevents wasteful recomputation of =df= every time =fixed-point=
   calls itself.

   Of course, we now have to define a derivative function. We can
   simply use the standard limit definition to find it numerically:

   $$f'(x) = \lim_{\Delta x\to 0} \frac{f(x+\Delta x) - f(x)}{\Delta
   x}$$

   Or, in Lisp,

   #+NAME: deriv
   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define dx 0.0000001)

     (define deriv
       (lambda (f)
         (lambda (x)
           (/ (- (f (+ x dx))
                 (f x))
              dx))))


   #+END_SRC

   This function returns a function which is the derivative of =f=,
   and can be used as such. Consider:

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
     <<deriv>>
     ((deriv (lambda (x) (* x x x))) 2)
   #+END_SRC

   #+RESULTS:
   : 12.000000584322379

   Which is the expected value of differentiating $x^{3}$ w.r.t $x$
   ($3x^2$) and evaluating at 2.

   Testing out our =sqrt= function:

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
     <<deriv>>
     <<newton>>
     <<newton-sqrt>>
     (sqrt #i2)
   #+END_SRC

   #+RESULTS:
   : 1.4142135623747674

** Procedures are First-Class Citizens

   This means that procedures can be:
   - Named using variables.
   - Passed as arguments to procedures.
   - Returned as values from procedures.
   - Included in data structures.

* Lecture 2B: Compound Data

  Consider our =sqrt= function that uses =good-enough?=. What we did
  while writing =sqrt= is assume the existence of =good-enough?=.
  That is, we divorced the task of building =sqrt= from the task of
  implementing its parts.

  Let's do this for data.

