video_notes/index.html

<div id="outline-container-org1a35ccd" class="outline-4">
<h4 id="org1a35ccd"><span class="section-number-4">4.2.2</span> Damping Oscillations</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
A fair question when seeing the function
\[f_1\colon y\mapsto \frac{y+\frac{x}{y}}{2}\]
is why another function
\[f\colon y\mapsto \frac{x}{y}\]
wouldn&rsquo;t work in its place. This question is best
answered by trying to find its fixed point by iteration. Let&rsquo;s try
to find it for \(x=2\), starting at \(y=1\). Then,
</p>

<p>
\[f(1) = \frac{2}{1} = 2\]
\[f(2) = \frac{2}{2} = 1\]
\[f(1) = \frac{2}{1} = 2\]
\[f(2) = \frac{2}{2} = 1\]
\[~\dots\]
</p>

<p>
It seems that instead of converging, this function is
<i>oscillating</i> between two values. We know that it&rsquo;s easy to fix
this: we have to damp these oscillations. The most natural way to
do this is to take the average of successive values \(y\) and
\(f(y)\). A <code>sqrt</code> function that uses average damping would be:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org8b0f7c8">
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">sqrt</span> x<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>fixed-point
   <span style="color: #50a14f;">(</span>avg-damp <span style="color: #da8548;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #b751b6;">(</span>y<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">/</span> x y<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #2e8b57;">1</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
The <code>avg-damp</code> function takes in a procedure, creates an average damping
procedure, and returns it. Or, in Lisp:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org225e185">
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">avg-damp</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #50a14f;">(</span>f<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #da8548;">(</span>x<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>average <span style="color: #b751b6;">(</span>f x<span style="color: #b751b6;">)</span> x<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
It is worth discussing how <code>avg-damp</code> works. It is defined as a
procedure which takes the argument of a function <code>f</code>. It then
returns an anonymous procedure which takes an argument <code>x</code>, and
computes the average of \(f(x)\) and \(x\). This is finally the
highest level of abstraction we can reach for the <code>sqrt</code>
algorithm &#x2014; finding the fixed point of a damped oscillating
function.
</p>

<p>
Using the <code>sqrt</code> function,
</p>

<div class="org-src-container">
<pre class="src src-racket">

<span style="color: #4078f2;">(</span><span style="color: #a626a4;">sqrt</span> <span style="color: #2e8b57;">#i2</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
1.4142135623746899
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf4d68a0" class="outline-3">
<h3 id="orgf4d68a0"><span class="section-number-3">4.3</span> Newton&rsquo;s Method</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Newton&rsquo;s method is used to find the zeros of a function (\(y \ni
   f(y)=0\)). To use it, start with some guess \(y_0\). Then,
</p>

<p>
\[y_{n+1} = y_n - \frac{f(y_n)}{f'(y_n)}\]
</p>

<p>
where \[f'(y) = \frac{\mathrm{d}f(y)}{\mathrm{d}y}\]
</p>

<p>
We can, of course, find the zero of the square root finding function
\(f(y) =  x-y^2\) using Newton&rsquo;s method. Note that Newton&rsquo;s method
<i>itself</i> is based on fixed points, since it aims to find a fixed
point where \(y_{n+1}\approx y_n\).
</p>

<p>
Defining <code>sqrt</code>:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org4a87811">
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">sqrt</span> x<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>newton <span style="color: #50a14f;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #da8548;">(</span>y<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">-</span> x <span style="color: #b751b6;">(</span>square y<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
          <span style="color: #2e8b57;">1</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
We pass to <code>newton</code> a function \(f(y)=x-y^2\), since its zero is \(x=y^2\).
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org505a2f7">
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">newton</span> f guess<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">df</span> <span style="color: #50a14f;">(</span>deriv f<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>fixed-point
   <span style="color: #50a14f;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #da8548;">(</span>x<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">-</span> x
                  <span style="color: #b751b6;">(</span><span style="color: #a626a4;">/</span> <span style="color: #986801;">(</span>f x<span style="color: #986801;">)</span>
                     <span style="color: #986801;">(</span>df x<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   guess<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>


<p>
It is important to note that defining <code>df</code> to be <code>(deriv f)</code> once
prevents wasteful recomputation of <code>df</code> every time <code>fixed-point</code>
calls itself.
</p>

<p>
Of course, we now have to define a derivative function. We can
simply use the standard limit definition to find it numerically:
</p>

<p>
\[f'(x) = \lim_{\Delta x\to 0} \frac{f(x+\Delta x) - f(x)}{\Delta
   x}\]
</p>

<p>
Or, in Lisp,
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org4d6bedd"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">dx</span> <span style="color: #2e8b57;">0.0000001</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">deriv</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #50a14f;">(</span>f<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #da8548;">(</span>x<span style="color: #da8548;">)</span>
      <span style="color: #da8548;">(</span><span style="color: #a626a4;">/</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">-</span> <span style="color: #986801;">(</span>f <span style="color: #4db5bd;">(</span><span style="color: #a626a4;">+</span> x dx<span style="color: #4db5bd;">)</span><span style="color: #986801;">)</span>
            <span style="color: #986801;">(</span>f x<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span>
         dx<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>


</pre>
</div>

<p>
This function returns a function which is the derivative of <code>f</code>,
and can be used as such. Consider:
</p>

<div class="org-src-container">
<pre class="src src-racket">
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">(</span>deriv <span style="color: #50a14f;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #da8548;">(</span>x<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> x x x<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span> <span style="color: #2e8b57;">2</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
12.000000584322379
</pre>


<p>
Which is the expected value of differentiating \(x^{3}\) w.r.t \(x\)
(\(3x^2\)) and evaluating at 2.
</p>

<p>
Testing out our <code>sqrt</code> function:
</p>

<div class="org-src-container">
<pre class="src src-racket">


<span style="color: #4078f2;">(</span><span style="color: #a626a4;">sqrt</span> <span style="color: #2e8b57;">#i2</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
1.4142135623747674
</pre>
</div>
</div>

<div id="outline-container-org5849bba" class="outline-3">
<h3 id="org5849bba"><span class="section-number-3">4.4</span> Procedures are First-Class Citizens</h3>
<div class="outline-text-3" id="text-4-4">
<p>
This means that procedures can be:
</p>
<ul class="org-ul">
<li>Named using variables.</li>
<li>Passed as arguments to procedures.</li>
<li>Returned as values from procedures.</li>
<li>Included in data structures.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge130eef" class="outline-2">
<h2 id="orge130eef"><span class="section-number-2">5</span> Lecture 2B: Compound Data</h2>
<div class="outline-text-2" id="text-5">
<p>
Consider our <code>sqrt</code> function that uses <code>good-enough?</code>. What we did
while writing <code>sqrt</code> is assume the existence of <code>good-enough?</code>.
That is, we divorced the task of building <code>sqrt</code> from the task of
implementing its parts.
</p>

<p>
Let&rsquo;s do this for data.
</p>
</div>
