video_notes/video_notes.org
** Rational Number Arithmetic

   Let's design a system which can add fractions:
   $$\frac{1}{2}+\frac{1}{4}=\frac{3}{4}$$
   and multiply them:
   $$\frac{3}{4}\times \frac{2}{3} = \frac{1}{2}$$

   The /procedures/ for these two tasks are well known to most people:

   $$\frac{n_1}{d_1} + \frac{n_2}{d_2} = \frac{n_1d_2+n_2d_2}{d_1d_2}$$
   and
   $$\frac{n_1}{d_1} \times \frac{n_2}{d_2} = \frac{n_1n_2}{d_1d_2}$$

*** Abstraction
    We don't know, however, how to represent this data in a Lisp
    procedure. Let's use our powerful "wishful thinking" strategy.
    Assume that we have the following procedures available to us:

    - A constructor =(make-rat n d)= which makes a fraction with
      numerator =n= and denominator =d=.
    - Two selectors:
      - =(numer x)= which takes in a fraction =x= and returns its
        numerator.
      - =(denom x)= which takes in a fraction =x= and returns its
        denominator.

    Then, our procedures are easy to write:

    #+NAME: frac-proc
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (+rat x y)
        (make-rat
         (+ (* (numer x) (denom y))
            (* (numer y) (denom x)))
         (* (denom x) (denom y))))

      (define (*rat x y)
        (make-rat
         (* (numer x) (numer y))
         (* (denom x) (denom y))))
    #+END_SRC

    Why do we need this data object abstraction anyway? We could very
    well define =+rat= to take in four numbers, two numerators and two
    denominators. But to return, we can't return /both/ numerator and
    denominator. We now have to define two summation functions, one for
    the numerator and one for the denominator, and somehow keep track
    of the fact that one of these numbers is the numerator and the other
    the denominator. Furthermore, when applying more complex operations
    like:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (*rat (+rat x y)
            (+rat s t))
    #+END_SRC

    The data abstraction helps. If it weren't there, we'd have to
    maintain some temporary registers to store the numerator and
    denominator values of the =+rat= operations into, then pass them to
    =*rat=.

    Worse than confusing the program, such a design philosophy would
    confuse us, the programmers.

