video_notes/index.html

<div id="outline-container-org687865c" class="outline-3">
<h3 id="org687865c"><span class="section-number-3">5.1</span> Rational Number Arithmetic</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Let&rsquo;s design a system which can add fractions:
\[\frac{1}{2}+\frac{1}{4}=\frac{3}{4}\]
and multiply them:
\[\frac{3}{4}\times \frac{2}{3} = \frac{1}{2}\]
</p>

<p>
The <i>procedures</i> for these two tasks are well known to most people:
</p>

<p>
\[\frac{n_1}{d_1} + \frac{n_2}{d_2} = \frac{n_1d_2+n_2d_2}{d_1d_2}\]
and
\[\frac{n_1}{d_1} \times \frac{n_2}{d_2} = \frac{n_1n_2}{d_1d_2}\]
</p>
</div>

<div id="outline-container-org4569215" class="outline-4">
<h4 id="org4569215"><span class="section-number-4">5.1.1</span> Abstraction</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
We don&rsquo;t know, however, how to represent this data in a Lisp
procedure. Let&rsquo;s use our powerful &ldquo;wishful thinking&rdquo; strategy.
Assume that we have the following procedures available to us:
</p>

<ul class="org-ul">
<li>A constructor <code>(make-rat n d)</code> which makes a fraction with
numerator <code>n</code> and denominator <code>d</code>.</li>
<li>Two selectors:
<ul class="org-ul">
<li><code>(numer x)</code> which takes in a fraction <code>x</code> and returns its
numerator.</li>
<li><code>(denom x)</code> which takes in a fraction <code>x</code> and returns its
denominator.</li>
</ul></li>
</ul>

<p>
Then, our procedures are easy to write:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org5687931"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">+rat</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>make-rat
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> <span style="color: #b751b6;">(</span>numer x<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span>denom y<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
      <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> <span style="color: #b751b6;">(</span>numer y<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span>denom x<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> <span style="color: #da8548;">(</span>denom x<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>denom y<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">*rat</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>make-rat
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> <span style="color: #da8548;">(</span>numer x<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>numer y<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> <span style="color: #da8548;">(</span>denom x<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>denom y<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Why do we need this data object abstraction anyway? We could very
well define <code>+rat</code> to take in four numbers, two numerators and two
denominators. But to return, we can&rsquo;t return <i>both</i> numerator and
denominator. We now have to define two summation functions, one for
the numerator and one for the denominator, and somehow keep track
of the fact that one of these numbers is the numerator and the other
the denominator. Furthermore, when applying more complex operations
like:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span>*rat <span style="color: #a626a4;">(</span>+rat x y<span style="color: #a626a4;">)</span>
      <span style="color: #a626a4;">(</span>+rat s t<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
The data abstraction helps. If it weren&rsquo;t there, we&rsquo;d have to
maintain some temporary registers to store the numerator and
denominator values of the <code>+rat</code> operations into, then pass them to
<code>*rat</code>.
</p>

<p>
Worse than confusing the program, such a design philosophy would
confuse us, the programmers.
</p>
</div>
</div>
