video_notes/video_notes.org
*** Data Object Creation

    The glue we use to stick two numbers together is provided by three
    Lisp primitives:
    - A constructor =cons=, which generates an ordered pair.
    - Two selectors:
      - =car=, which selects the first element of the pair, and
      - =cdr=, which selects the second element of the pair.

    In use,
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define x (cons 1 2))
      (car x)
      (cdr x)
    #+END_SRC

    #+RESULTS:
    : 1
    : 2

    We can now write the procedures that we'd deferred writing
    earlier:

    #+NAME: make-rat
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (make-rat x y)
        (cons x y))

      (define (numer x)
        (car x))

      (define (denom x)
        (cdr x))
    #+END_SRC

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<frac-proc>>
      <<make-rat>>

      (define x (make-rat 1 2))
      (define y (make-rat 1 4))
      (define z (+rat x y))
      (numer z)
      (denom z)
    #+END_SRC

    #+RESULTS:
    : 6
    : 8

    Agh. We forgot to reduce results to the simplest form. We can
    easily include this in the =make-rat= procedure:[fn:1]

    #+NAME: make-rat-gcd
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (make-rat x y)
        (let ((g (gcd x y)))
          (cons (/ x g)
                (/ y g))))

      (define (numer x)
        (car x))

      (define (denom x)
        (cdr x))
    #+END_SRC

    Note that we could shift the =gcd= bit to functions =numer= and
    =denom=, which would display the simplest form at access time
    rather than creation time. Deciding between the two is a matter of
    system efficiency: a system which displays often should use
    creation time simplification, while a system which creates many
    fractions should use access time simplification.
    We now need a GCD function:

    #+NAME: gcd
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (gcd a b)
        (if (= b 0)
            a
            (gcd b (remainder a b))))
    #+END_SRC

    We can now use =+rat= in /exactly/ the same way, since the
    interface is the same. This is the advantage of abstraction.

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<make-rat-gcd>>
      <<frac-proc>>

      (define x (make-rat 1 2))
      (define y (make-rat 1 4))
      (define z (+rat x y))
      (numer z)
      (denom z)
    #+END_SRC

    #+RESULTS:
    : 3
    : 4

    Excellent: we now have a working system. The data abstraction
    model can be visualised as follows:

    #+ATTR_LATEX: :booktabs t :align c
    | =+rat=, =*rat= ...           |
    |------------------------------|
    | =make-rat=, =numer=, =denom= |
    |------------------------------|
    | =gcd=                        |
    |------------------------------|
    | Pairs                        |

    At each layer of abstraction, we merely care about the usage of
    the lower layers and not their implementation or underlying
    representation.

