video_notes/index.html

<div id="outline-container-orgdaa7ffb" class="outline-4">
<h4 id="orgdaa7ffb"><span class="section-number-4">5.1.2</span> Data Object Creation</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
The glue we use to stick two numbers together is provided by three
Lisp primitives:
</p>
<ul class="org-ul">
<li>A constructor <code>cons</code>, which generates an ordered pair.</li>
<li>Two selectors:
<ul class="org-ul">
<li><code>car</code>, which selects the first element of the pair, and</li>
<li><code>cdr</code>, which selects the second element of the pair.</li>
</ul></li>
</ul>

<p>
In use,
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">x</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">1</span> <span style="color: #2e8b57;">2</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">car</span> x<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">cdr</span> x<span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
1
2
</pre>


<p>
We can now write the procedures that we&rsquo;d deferred writing
earlier:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org4149221"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">make-rat</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cons</span> x y<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">numer</span> x<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">car</span> x<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">denom</span> x<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cdr</span> x<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket">


<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">x</span> <span style="color: #a626a4;">(</span>make-rat <span style="color: #2e8b57;">1</span> <span style="color: #2e8b57;">2</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">y</span> <span style="color: #a626a4;">(</span>make-rat <span style="color: #2e8b57;">1</span> <span style="color: #2e8b57;">4</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">z</span> <span style="color: #a626a4;">(</span>+rat x y<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>numer z<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>denom z<span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
6
8
</pre>


<p>
Agh. We forgot to reduce results to the simplest form. We can
easily include this in the <code>make-rat</code> procedure:<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orgad94883"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">make-rat</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">let</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #6a1868;">g</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">gcd</span> x y<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">/</span> x g<span style="color: #da8548;">)</span>
          <span style="color: #da8548;">(</span><span style="color: #a626a4;">/</span> y g<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">numer</span> x<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">car</span> x<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">denom</span> x<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cdr</span> x<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Note that we could shift the <code>gcd</code> bit to functions <code>numer</code> and
<code>denom</code>, which would display the simplest form at access time
rather than creation time. Deciding between the two is a matter of
system efficiency: a system which displays often should use
creation time simplification, while a system which creates many
fractions should use access time simplification.
We now need a GCD function:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orga52fab8"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">gcd</span> a b<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">=</span> b <span style="color: #2e8b57;">0</span><span style="color: #50a14f;">)</span>
      a
      <span style="color: #50a14f;">(</span><span style="color: #a626a4;">gcd</span> b <span style="color: #da8548;">(</span><span style="color: #a626a4;">remainder</span> a b<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
We can now use <code>+rat</code> in <i>exactly</i> the same way, since the
interface is the same. This is the advantage of abstraction.
</p>

<div class="org-src-container">
<pre class="src src-racket">


<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">x</span> <span style="color: #a626a4;">(</span>make-rat <span style="color: #2e8b57;">1</span> <span style="color: #2e8b57;">2</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">y</span> <span style="color: #a626a4;">(</span>make-rat <span style="color: #2e8b57;">1</span> <span style="color: #2e8b57;">4</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">z</span> <span style="color: #a626a4;">(</span>+rat x y<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>numer z<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>denom z<span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
3
4
</pre>


<p>
Excellent: we now have a working system. The data abstraction
model can be visualised as follows:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>+rat</code>, <code>*rat</code> &#x2026;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>make-rat</code>, <code>numer</code>, <code>denom</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>gcd</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Pairs</td>
</tr>
</tbody>
</table>

<p>
At each layer of abstraction, we merely care about the usage of
the lower layers and not their implementation or underlying
representation.
</p>
</div>
</div>
</div>
