video_notes/index.html

<div id="outline-container-org6e1af5f" class="outline-3">
<h3 id="org6e1af5f"><span class="section-number-3">5.2</span> Representing Points on a Plane</h3>
<div class="outline-text-3" id="text-5-2">
<p>
This is now an easy problem &#x2014; the code should be
self-explanatory.
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orgc1c8355"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">make-vec</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cons</span> x y<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">xcor</span> v<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">car</span> v<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">ycor</span> v<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cdr</span> v<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
We could now define a segment as a pair of vectors:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org0c24b10"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">make-seg</span> v w<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cons</span> v w<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">seg-start</span> s<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">car</span> s<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">seg-end</span> s<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cdr</span> s<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Some sample operations:
</p>

<div class="org-src-container">
<pre class="src src-racket">





<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">midpoint</span> s<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">let</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #6a1868;">a</span> <span style="color: #b751b6;">(</span>seg-start s<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
        <span style="color: #da8548;">(</span><span style="color: #6a1868;">b</span> <span style="color: #b751b6;">(</span>seg-end s<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span>make-vec
     <span style="color: #da8548;">(</span>average <span style="color: #b751b6;">(</span>xcor a<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span>xcor b<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
     <span style="color: #da8548;">(</span>average <span style="color: #b751b6;">(</span>ycor a<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span>ycor b<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">length</span> s<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">let</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #6a1868;">dx</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">-</span> <span style="color: #986801;">(</span>xcor <span style="color: #4db5bd;">(</span>seg-end s<span style="color: #4db5bd;">)</span><span style="color: #986801;">)</span>
               <span style="color: #986801;">(</span>xcor <span style="color: #4db5bd;">(</span>seg-start s<span style="color: #4db5bd;">)</span><span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
        <span style="color: #da8548;">(</span><span style="color: #6a1868;">dy</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">-</span> <span style="color: #986801;">(</span>ycor <span style="color: #4db5bd;">(</span>seg-end s<span style="color: #4db5bd;">)</span><span style="color: #986801;">)</span>
               <span style="color: #986801;">(</span>ycor <span style="color: #4db5bd;">(</span>seg-start s<span style="color: #4db5bd;">)</span><span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #a626a4;">sqrt</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">+</span> <span style="color: #b751b6;">(</span>square dx<span style="color: #b751b6;">)</span>
             <span style="color: #b751b6;">(</span>square dy<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">side-a</span> <span style="color: #a626a4;">(</span>make-vec <span style="color: #2e8b57;">#i3</span> <span style="color: #2e8b57;">#i0</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">side-b</span> <span style="color: #a626a4;">(</span>make-vec <span style="color: #2e8b57;">#i0</span> <span style="color: #2e8b57;">#i4</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">segment</span> <span style="color: #a626a4;">(</span>make-seg side-a side-b<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #a626a4;">length</span> segment<span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">mp</span> <span style="color: #a626a4;">(</span>midpoint segment<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>xcor mp<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>ycor mp<span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
5.000000000053722
1.5
2.0
</pre>


<p>
The abstraction layer diagram of this code is:
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Segments</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Vectors</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Pairs</td>
</tr>
</tbody>
</table>

<p>
It is interesting to note that segments are pairs of vectors,
which are pairs of numbers, so segments are actually pairs of
pairs. Represented as a tree:
</p>

<p>
This property is called <i>closure</i> (from abstract algebra<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>): that means
of combination can be nested recursively. It&rsquo;s an important and
powerful technique.
</p>

<p>
For instance, a three-dimensional vector can be represented by a
pair whose one element is a number and whose other element is a
pair of numbers. Or, in Lisp:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">three-d-vec</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">3</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">4</span> <span style="color: #2e8b57;">5</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">car</span> three-d-vec<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">car</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cdr</span> three-d-vec<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">cdr</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cdr</span> three-d-vec<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
3
4
5
</pre>
</div>
</div>
