video_notes/video_notes.org
** Pairs

   Let's go back to when we assumed that =make-rat=, =numer=, and
   =denom=, were already implemented. The procedures we then wrote
   were written using /abstract data/, with the only "assured"
   property being that:

   #+begin_verse
   =if x = (make-rat n d):=

     $\displaystyle \frac{\mathtt{numer~x}}{\mathtt{denom~x}} = \frac{\mathtt{n}}{\mathtt{d}}$
   #+end_verse

   Beyond this basic "spec", or the interface contract, we know
   nothing about its implementation.

   Now, it's easy not to appreciate how knowing /merely/ the
   specification of the layer below is sufficient to use it, so let's
   discuss how pairs work. When we wanted to implement =make-rat=, we
   kind of "cheated" in that we said, "Okay, Lisp has a primitive to
   do this so we don't have to implement a pair." Let's now take a
   look at a possible implementation of a pair that doesn't use data
   objects at all, and instead mimics them from thin air. Consider:

   #+NAME: our-cons
   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define (our-cons a b)
       (lambda (pick)
         (cond ((= pick 1) a)
               ((= pick 2) b))))

     (define (our-car x) (x 1))
     (define (our-cdr x) (x 2))
   #+END_SRC

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
     <<our-cons>>
     (define pair (our-cons 3 4))
     (our-car pair)
     (our-cdr pair)
   #+END_SRC

   #+RESULTS:
   : 3
   : 4

   Before thinking about how it works: consider the fact that Lisp's
   pairs could be implemented this way, and not only would we not know
   about this while implementing =make-rat= --- we wouldn't care,
   since it's below the level of abstraction we're working at. As long
   as it behaves the way we expect it to --- that is, it follows the
   "spec", we don't know or care about its implementation[fn:3]. Such is the
   power of abstraction.

   Now, how is this implementation even working? Well:
   - =cons= is a procedure that returns a lambda (anonymous procedure)
     which, by the substitution model, looks like:
     #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
       (lambda (pick)
         (cond ((= pick 1) 3)
               ((= pick 2) 4)))
     #+END_SRC
   - =car= expects this procedure as an input, and returns the result of
     supplying this procedure with the value 1. This is naturally the
     first of the two numbers given to =cons= (=a=).
   - =cdr= is identical to =car=, except that /it/ supplies the input
     procedure with argument 2 to get =b=.

   We can thus implement a pair "data structure" using only lambdas.
   In fact, these pairs are closed:

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
     <<our-cons>>
     (define three-d-vec (our-cons 3 (our-cons 4 5)))
     (our-car three-d-vec)
     (our-car (our-cdr three-d-vec))
     (our-cdr (our-cdr three-d-vec))
     (our-cdr three-d-vec)
   #+END_SRC

   #+RESULTS:
   : 3
   : 4
   : 5
   : #<procedure:...6f_i/ob-2136OZJ.rkt:4:2>

   It is worth thinking about the structure of =three-d-vec=:
   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (lambda (pick)
       (cond ((= pick 1) 3)
             ((= pick 2) (lambda (pick)
                           (cond ((= pick 1) 4)
                                 ((= pick 2) 5))))))
   #+END_SRC

   Picking =2= in the top-level lambda gives us another lambda, in
   which we can pick either the first number (4) or the second (5).
   Note that this is precisely the nested pair structure we were going
   for.

   #+LATEX: \begin{center}
   #+LATEX: \begin{forest}
   #+LATEX: [$\lambda$(p) [3] [$\lambda$(p) [4] [5]]]
   #+LATEX: \end{forest}
   #+LATEX: \end{center}

