video_notes/index.html

<div id="outline-container-org7914e53" class="outline-3">
<h3 id="org7914e53"><span class="section-number-3">5.3</span> Pairs</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Let&rsquo;s go back to when we assumed that <code>make-rat</code>, <code>numer</code>, and
<code>denom</code>, were already implemented. The procedures we then wrote
were written using <i>abstract data</i>, with the only &ldquo;assured&rdquo;
property being that:
</p>

<p class="verse">
<code>if x = (make-rat n d):</code><br />
<br />
&#xa0;&#xa0;\(\displaystyle \frac{\mathtt{numer~x}}{\mathtt{denom~x}} = \frac{\mathtt{n}}{\mathtt{d}}\)<br />
</p>

<p>
Beyond this basic &ldquo;spec&rdquo;, or the interface contract, we know
nothing about its implementation.
</p>

<p>
Now, it&rsquo;s easy not to appreciate how knowing <i>merely</i> the
specification of the layer below is sufficient to use it, so let&rsquo;s
discuss how pairs work. When we wanted to implement <code>make-rat</code>, we
kind of &ldquo;cheated&rdquo; in that we said, &ldquo;Okay, Lisp has a primitive to
do this so we don&rsquo;t have to implement a pair.&rdquo; Let&rsquo;s now take a
look at a possible implementation of a pair that doesn&rsquo;t use data
objects at all, and instead mimics them from thin air. Consider:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orgc8872f3"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">our-cons</span> a b<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #50a14f;">(</span>pick<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">cond</span> <span style="color: #da8548;">(</span><span style="color: #b751b6;">(</span><span style="color: #a626a4;">=</span> pick <span style="color: #2e8b57;">1</span><span style="color: #b751b6;">)</span> a<span style="color: #da8548;">)</span>
          <span style="color: #da8548;">(</span><span style="color: #b751b6;">(</span><span style="color: #a626a4;">=</span> pick <span style="color: #2e8b57;">2</span><span style="color: #b751b6;">)</span> b<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">our-car</span> x<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">(</span>x <span style="color: #2e8b57;">1</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">our-cdr</span> x<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">(</span>x <span style="color: #2e8b57;">2</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket">
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">pair</span> <span style="color: #a626a4;">(</span>our-cons <span style="color: #2e8b57;">3</span> <span style="color: #2e8b57;">4</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>our-car pair<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>our-cdr pair<span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
3
4
</pre>


<p>
Before thinking about how it works: consider the fact that Lisp&rsquo;s
pairs could be implemented this way, and not only would we not know
about this while implementing <code>make-rat</code> &#x2014; we wouldn&rsquo;t care,
since it&rsquo;s below the level of abstraction we&rsquo;re working at. As long
as it behaves the way we expect it to &#x2014; that is, it follows the
&ldquo;spec&rdquo;, we don&rsquo;t know or care about its implementation<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>. Such is the
power of abstraction.
</p>

<p>
Now, how is this implementation even working? Well:
</p>
<ul class="org-ul">
<li><p>
<code>cons</code> is a procedure that returns a lambda (anonymous procedure)
which, by the substitution model, looks like:
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #a626a4;">(</span>pick<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">cond</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #a626a4;">=</span> pick <span style="color: #2e8b57;">1</span><span style="color: #da8548;">)</span> <span style="color: #2e8b57;">3</span><span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #a626a4;">=</span> pick <span style="color: #2e8b57;">2</span><span style="color: #da8548;">)</span> <span style="color: #2e8b57;">4</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div></li>
<li><code>car</code> expects this procedure as an input, and returns the result of
supplying this procedure with the value 1. This is naturally the
first of the two numbers given to <code>cons</code> (<code>a</code>).</li>
<li><code>cdr</code> is identical to <code>car</code>, except that <i>it</i> supplies the input
procedure with argument 2 to get <code>b</code>.</li>
</ul>

<p>
We can thus implement a pair &ldquo;data structure&rdquo; using only lambdas.
In fact, these pairs are closed:
</p>

<div class="org-src-container">
<pre class="src src-racket">
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">three-d-vec</span> <span style="color: #a626a4;">(</span>our-cons <span style="color: #2e8b57;">3</span> <span style="color: #50a14f;">(</span>our-cons <span style="color: #2e8b57;">4</span> <span style="color: #2e8b57;">5</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>our-car three-d-vec<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>our-car <span style="color: #a626a4;">(</span>our-cdr three-d-vec<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>our-cdr <span style="color: #a626a4;">(</span>our-cdr three-d-vec<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>our-cdr three-d-vec<span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
3
4
5
#&lt;procedure:...6f_i/ob-2136OZJ.rkt:4:2&gt;
</pre>


<p>
It is worth thinking about the structure of <code>three-d-vec</code>:
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #a626a4;">(</span>pick<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">cond</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #a626a4;">=</span> pick <span style="color: #2e8b57;">1</span><span style="color: #da8548;">)</span> <span style="color: #2e8b57;">3</span><span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #a626a4;">=</span> pick <span style="color: #2e8b57;">2</span><span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #b751b6;">(</span>pick<span style="color: #b751b6;">)</span>
                      <span style="color: #b751b6;">(</span><span style="color: #e45649;">cond</span> <span style="color: #986801;">(</span><span style="color: #4db5bd;">(</span><span style="color: #a626a4;">=</span> pick <span style="color: #2e8b57;">1</span><span style="color: #4db5bd;">)</span> <span style="color: #2e8b57;">4</span><span style="color: #986801;">)</span>
                            <span style="color: #986801;">(</span><span style="color: #4db5bd;">(</span><span style="color: #a626a4;">=</span> pick <span style="color: #2e8b57;">2</span><span style="color: #4db5bd;">)</span> <span style="color: #2e8b57;">5</span><span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Picking <code>2</code> in the top-level lambda gives us another lambda, in
which we can pick either the first number (4) or the second (5).
Note that this is precisely the nested pair structure we were going
for.
</p>
</div>
</div>
</div>
