video_notes/video_notes.org
* Lecture 3A: Henderson Escher Example

  Recall our vector procedures:

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define (make-vec x y)
       (cons x y))

     (define (xcor v)
       (car v))

     (define (ycor v)
       (cdr v))
   #+END_SRC

   We could define more procedures using these:

   #+NAME: vec-proc
   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define (+vect v1 v2)
       (make-vec
        (+ (xcor v1) (xcor v2))
        (+ (ycor v1) (ycor v2))))

     (define (scale v s)
       (make-vec
        (* s (xcor v))
        (* s (ycor v))))
   #+END_SRC

   Recall that our representation of a line segment was as a pair of
   vectors, or pair of pairs. That is, we can use the property of
   closure that pairs have to store any amount of data.

** Lists
   Often, we want to store a sequence of data. Using pairs, there are
   many ways to do this, for instance:

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (cons (cons 1 2) (cons 3 4))
     (cons (cons 1 (cons 2 3)) 4)
   #+END_SRC

   #+RESULTS:
   : ((1 . 2) 3 . 4)
   : ((1 2 . 3) . 4)

   However, we want to establish a conventional way of dealing with
   sequences, to prevent having to make ad-hoc choices. Lisp uses a
   representation called a list:

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (cons 1 (cons 2 (cons 3 (cons 4 nil))))
   #+END_SRC

   #+RESULTS:
   : (1 2 3 4)

   Note that the =nil= represents the null or empty list. Since
   writing so many =cons= is painful, Lisp provides the primitive
   =list= which lets us build such a structure.

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (list 1 2 3 4)
   #+END_SRC

   #+RESULTS:
   : (1 2 3 4)

   Note that =list= is merely syntactic sugar for building up using
   pairs:

   #+NAME: one-to-four
   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define one-to-four (list 1 2 3 4))
   #+END_SRC

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
     <<one-to-four>>
     (car one-to-four)
     (cdr one-to-four)
     (car (cdr one-to-four))
     (cdr (cdr one-to-four))
     (car (cdr (cdr (cdr one-to-four))))
     (cdr (cdr (cdr (cdr one-to-four))))
   #+END_SRC

   #+RESULTS:
   : 1
   : (2 3 4)
   : 2
   : (3 4)
   : 4
   : ()

   Note that the empty list, =nil=, is also represented by =()=. This
   way of walking down the list for elements is called =cdr=-ing down
   a list, but it's a bit painful. Thus, when we want to process
   lists, we write procedures.

