video_notes/index.html

<div id="outline-container-org02db6cd" class="outline-2">
<h2 id="org02db6cd"><span class="section-number-2">6</span> Lecture 3A: Henderson Escher Example</h2>
<div class="outline-text-2" id="text-6">
<p>
Recall our vector procedures:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">make-vec</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cons</span> x y<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">xcor</span> v<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">car</span> v<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">ycor</span> v<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cdr</span> v<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
We could define more procedures using these:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org1e3c5b5"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">+vect</span> v1 v2<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>make-vec
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span>xcor v1<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>xcor v2<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span>ycor v1<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>ycor v2<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">scale</span> v s<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>make-vec
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> s <span style="color: #da8548;">(</span>xcor v<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> s <span style="color: #da8548;">(</span>ycor v<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Recall that our representation of a line segment was as a pair of
vectors, or pair of pairs. That is, we can use the property of
closure that pairs have to store any amount of data.
</p>
</div>

<div id="outline-container-org0b30152" class="outline-3">
<h3 id="org0b30152"><span class="section-number-3">6.1</span> Lists</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Often, we want to store a sequence of data. Using pairs, there are
many ways to do this, for instance:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">1</span> <span style="color: #2e8b57;">2</span><span style="color: #a626a4;">)</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">3</span> <span style="color: #2e8b57;">4</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">1</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">2</span> <span style="color: #2e8b57;">3</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span> <span style="color: #2e8b57;">4</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
((1 . 2) 3 . 4)
((1 2 . 3) . 4)
</pre>


<p>
However, we want to establish a conventional way of dealing with
sequences, to prevent having to make ad-hoc choices. Lisp uses a
representation called a list:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">1</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">2</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">3</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">4</span> nil<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
(1 2 3 4)
</pre>


<p>
Note that the <code>nil</code> represents the null or empty list. Since
writing so many <code>cons</code> is painful, Lisp provides the primitive
<code>list</code> which lets us build such a structure.
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #a626a4;">list</span> <span style="color: #2e8b57;">1</span> <span style="color: #2e8b57;">2</span> <span style="color: #2e8b57;">3</span> <span style="color: #2e8b57;">4</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
(1 2 3 4)
</pre>


<p>
Note that <code>list</code> is merely syntactic sugar for building up using
pairs:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org7314097"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">one-to-four</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">list</span> <span style="color: #2e8b57;">1</span> <span style="color: #2e8b57;">2</span> <span style="color: #2e8b57;">3</span> <span style="color: #2e8b57;">4</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket">
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">car</span> one-to-four<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">cdr</span> one-to-four<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">car</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cdr</span> one-to-four<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">cdr</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cdr</span> one-to-four<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">car</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cdr</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cdr</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">cdr</span> one-to-four<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">cdr</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cdr</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cdr</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">cdr</span> one-to-four<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
1
(2 3 4)
2
(3 4)
4
()
</pre>


<p>
Note that the empty list, <code>nil</code>, is also represented by <code>()</code>. This
way of walking down the list for elements is called <code>cdr</code>-ing down
a list, but it&rsquo;s a bit painful. Thus, when we want to process
lists, we write procedures.
</p>
</div>
