video_notes/video_notes.org
*** Procedures on Lists

    Say we wanted to write a procedure =scale-list= which multiplies
    every element in the list by a certain value. That is, when scale
    list is called on =one-to-four= with value 10, it returns =(10 20
    30 40)=. Here's one possible (recursive) implementation:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<one-to-four>>
      (define (scale-list l scale)
        (if (null? l)
            nil
            (cons (* scale (car l))
                  (scale-list (cdr l) scale))))

      (scale-list one-to-four 10)
    #+END_SRC

    #+RESULTS:
    : (10 20 30 40)

    =null?= is a predicate which tells us whether the given input is
    the empty list. This will be the case at the end of the list.
    Of course, this is /actually/ a general method for processing all
    values of a list and returning another list, so we write a
    higher-order procedure which applies a procedure to all elements
    of a list and returns the result as a list, called =map=.

    #+NAME: map
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (map p l)
        (if (null? l)
            nil
            (cons (p (car l))
                  (map p (cdr l)))))
    #+END_SRC

    Now defining =scale-list= in terms of =map=:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<map>>
      <<one-to-four>>
      (define (scale-list l s)
        (map (lambda (x) (* x s))
             l))

      (scale-list one-to-four 20)
    #+END_SRC

    #+RESULTS:
    : (20 40 60 80)

    We can now square lists:
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<square>>
      <<map>>
      <<one-to-four>>
      (map square one-to-four)
    #+END_SRC

    #+RESULTS:
    : (1 4 9 16)

    Similar to =map=, we define a higher-order procedure =for-each=,
    which, instead of =cons=-ing a list and returning it, simply
    applies to procedure to each element of the list.

    #+NAME: for-each
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      (define (for-each proc l)
        (cond ((null? l) done)
              (else
               (proc (car l))
               (for-each proc (cdr l)))))
    #+END_SRC

** Henderson's Picture Language

   Let's define a language. As usual, we'll concern ourselves with its
   primitives, means of combination, and means of abstraction,
   implementing some of this language in Lisp along the way.


*** Primitives
    This language has only one primitive: "picture", which is a figure
    scaled to fit a frame.


*** Means of Combination and Operations

    - Rotate, which rotates a picture and returns it.
    - Flip, which flips the picture across an axis and returns it.
    - Beside, which takes two pictures and a scale, then puts the two
      next to each other, returning a picture.
    - Above, like beside, but above.

    See that the closure property (that an operation on pictures
    returns a picture)[fn:4] allows us to combine these operations/means of
    combination to build complex pictures with ease.

    Let's now implement this part of the language.

*** An Implementation

**** Frames

     Three vectors are needed to uniquely identify a frame on the
     plane. By convention, we take these to be the bottom left corner
     ("origin"), the bottom right corner ("horizontal") and the top
     left corner ("vertical"). Their positions can be described
     relative to the $(0,0)$ of the display screen. Therefore,
     frame is implemented by:
     - Constructor =make-frame=.
     - Selectors =origin=, =horiz=, and =vert=, for the three vectors.

     Note that technically, a frame describes a transformation of
     the unit square, where each point in the unit square:
     $$(x,y)\mapsto \mathtt{origin} + x\cdot \mathtt{horiz} + y\cdot
     \mathtt{vert}$$

     We can define a procedure which returns a procedure which maps
     a pair of points $(x,y)$ on the unit square to a given frame:

     #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
       (define (coord-map rect)
         (lambda (point)
           (+vect
            (+vect (scale (xcor point)
                          (horiz rect))
                   (scale (ycor point)
                          (vert rect)))
            (origin rect))))
     #+END_SRC

     =coord-map= returns a procedure which given a point will map it
     correctly to =rect=.

