video_notes/index.html

<div id="outline-container-org987b324" class="outline-4">
<h4 id="org987b324"><span class="section-number-4">6.1.1</span> Procedures on Lists</h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
Say we wanted to write a procedure <code>scale-list</code> which multiplies
every element in the list by a certain value. That is, when scale
list is called on <code>one-to-four</code> with value 10, it returns <code>(10 20
    30 40)</code>. Here&rsquo;s one possible (recursive) implementation:
</p>

<div class="org-src-container">
<pre class="src src-racket">
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">scale-list</span> l scale<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">null?</span> l<span style="color: #50a14f;">)</span>
      nil
      <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> scale <span style="color: #b751b6;">(</span><span style="color: #a626a4;">car</span> l<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
            <span style="color: #da8548;">(</span>scale-list <span style="color: #b751b6;">(</span><span style="color: #a626a4;">cdr</span> l<span style="color: #b751b6;">)</span> scale<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>scale-list one-to-four <span style="color: #2e8b57;">10</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
(10 20 30 40)
</pre>


<p>
<code>null?</code> is a predicate which tells us whether the given input is
the empty list. This will be the case at the end of the list.
Of course, this is <i>actually</i> a general method for processing all
values of a list and returning another list, so we write a
higher-order procedure which applies a procedure to all elements
of a list and returns the result as a list, called <code>map</code>.
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org9580130"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">map</span> p l<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">null?</span> l<span style="color: #50a14f;">)</span>
      nil
      <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #da8548;">(</span>p <span style="color: #b751b6;">(</span><span style="color: #a626a4;">car</span> l<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
            <span style="color: #da8548;">(</span><span style="color: #a626a4;">map</span> p <span style="color: #b751b6;">(</span><span style="color: #a626a4;">cdr</span> l<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Now defining <code>scale-list</code> in terms of <code>map</code>:
</p>

<div class="org-src-container">
<pre class="src src-racket">

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">scale-list</span> l s<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">map</span> <span style="color: #50a14f;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #da8548;">(</span>x<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> x s<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
       l<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>scale-list one-to-four <span style="color: #2e8b57;">20</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
(20 40 60 80)
</pre>


<p>
We can now square lists:
</p>
<div class="org-src-container">
<pre class="src src-racket">


<span style="color: #4078f2;">(</span><span style="color: #a626a4;">map</span> square one-to-four<span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
(1 4 9 16)
</pre>


<p>
Similar to <code>map</code>, we define a higher-order procedure <code>for-each</code>,
which, instead of <code>cons</code>-ing a list and returning it, simply
applies to procedure to each element of the list.
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orga0d7c57"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">for-each</span> proc l<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">cond</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #a626a4;">null?</span> l<span style="color: #da8548;">)</span> done<span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span><span style="color: #e45649;">else</span>
         <span style="color: #da8548;">(</span>proc <span style="color: #b751b6;">(</span><span style="color: #a626a4;">car</span> l<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span><span style="color: #a626a4;">for-each</span> proc <span style="color: #b751b6;">(</span><span style="color: #a626a4;">cdr</span> l<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org094bcd7" class="outline-3">
<h3 id="org094bcd7"><span class="section-number-3">6.2</span> Henderson&rsquo;s Picture Language</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Let&rsquo;s define a language. As usual, we&rsquo;ll concern ourselves with its
primitives, means of combination, and means of abstraction,
implementing some of this language in Lisp along the way.
</p>
</div>


<div id="outline-container-orga15f9df" class="outline-4">
<h4 id="orga15f9df"><span class="section-number-4">6.2.1</span> Primitives</h4>
<div class="outline-text-4" id="text-6-2-1">
<p>
This language has only one primitive: &ldquo;picture&rdquo;, which is a figure
scaled to fit a frame.
</p>
</div>
</div>


<div id="outline-container-orgc2f83fc" class="outline-4">
<h4 id="orgc2f83fc"><span class="section-number-4">6.2.2</span> Means of Combination and Operations</h4>
<div class="outline-text-4" id="text-6-2-2">
<ul class="org-ul">
<li>Rotate, which rotates a picture and returns it.</li>
<li>Flip, which flips the picture across an axis and returns it.</li>
<li>Beside, which takes two pictures and a scale, then puts the two
next to each other, returning a picture.</li>
<li>Above, like beside, but above.</li>
</ul>

<p>
See that the closure property (that an operation on pictures
returns a picture)<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup> allows us to combine these operations/means of
combination to build complex pictures with ease.
</p>

<p>
Let&rsquo;s now implement this part of the language.
</p>
</div>
</div>

<div id="outline-container-org00dd696" class="outline-4">
<h4 id="org00dd696"><span class="section-number-4">6.2.3</span> An Implementation</h4>
<div class="outline-text-4" id="text-6-2-3">
</div>
<ol class="org-ol">
<li><a id="org4454118"></a>Frames<br />
<div class="outline-text-5" id="text-6-2-3-1">
<p>
Three vectors are needed to uniquely identify a frame on the
plane. By convention, we take these to be the bottom left corner
(&ldquo;origin&rdquo;), the bottom right corner (&ldquo;horizontal&rdquo;) and the top
left corner (&ldquo;vertical&rdquo;). Their positions can be described
relative to the \((0,0)\) of the display screen. Therefore,
frame is implemented by:
</p>
<ul class="org-ul">
<li>Constructor <code>make-frame</code>.</li>
<li>Selectors <code>origin</code>, <code>horiz</code>, and <code>vert</code>, for the three vectors.</li>
</ul>

<p>
Note that technically, a frame describes a transformation of
the unit square, where each point in the unit square:
\[(x,y)\mapsto \mathtt{origin} + x\cdot \mathtt{horiz} + y\cdot
     \mathtt{vert}\]
</p>

<p>
We can define a procedure which returns a procedure which maps
a pair of points \((x,y)\) on the unit square to a given frame:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">coord-map</span> rect<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #50a14f;">(</span>point<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span>+vect
     <span style="color: #da8548;">(</span>+vect <span style="color: #b751b6;">(</span>scale <span style="color: #986801;">(</span>xcor point<span style="color: #986801;">)</span>
                   <span style="color: #986801;">(</span>horiz rect<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span>
            <span style="color: #b751b6;">(</span>scale <span style="color: #986801;">(</span>ycor point<span style="color: #986801;">)</span>
                   <span style="color: #986801;">(</span>vert rect<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
     <span style="color: #da8548;">(</span>origin rect<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
<code>coord-map</code> returns a procedure which given a point will map it
correctly to <code>rect</code>.
</p>
</div>
</li>
