video_notes/video_notes.org
**** Pictures

     We can now easily define a procedure which makes a picture:
     #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
       (define (make-picture seglist)
         (lambda (rect)
           (for-each
            (lambda (s)
              (drawline
               ((coord-map rect) (seg-start s))
               ((coord-map rect) (seg-end s))))
            seglist)))
     #+END_SRC

     Well, relatively easily. Let's explain what =make-picture=
     actually does:

     - Takes argument =seglist=, which is a list of line segments
       (pairs of vectors) that the picture is.
     - Returns a procedure which:
       - Takes the argument of a frame.
       - For every element in =seglist=:
         - Draws the segment within frame, by scaling it correctly
           using =coord-map=.
         - This is done by giving =coord-map= the frame to scale
           to.
         - The procedure returned by =coord-map= then scales the
           vectors =(seg-start s)= and =(seg-end s)= to the frame.
         - This can now be drawn by =drawline=, since it has as
           arguments two points.

     Note that a picture is /actually/ a procedure which draws itself
     inside a given frame, and =make-picture= generates this
     procedure from a =seglist=. Or, in use:

     #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
       (define R (make-frame ;some vectors
                  ))
       (define draw-george-in-frame (make-picture ;some seglist
                       ))
       (draw-george-in-frame R)
     #+END_SRC

**** Beside

     =beside= needs to draw two pictures on the screen, after scaling
     them correctly (by =a=) and placing them side by side. Thus,
     =beside= returns a picture which takes in an argument =rect=.
     =beside= starts drawing the left picture at =(origin rect),
     (scale a (horiz rect)) (vert rect)= and the right picture at
     =(+vect (origin rect) (scale a (horiz rect))), (scale (- 1 a)
     (horiz rect)), (vert rect)=. This places the two pictures side by
     side and scales them correctly within =rect=. Or, in Lisp,

     #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
       (define (beside p1 p2 a)
         (lambda (rect)
           (p1 (make-frame
                (origin rect)
                (scale a (horiz rect))
                (vert rect)))
           (p2 (make-frame
                (+vect (origin rect)
                       (scale a (horiz rect)))
                (scale (-1 a) (horiz rect))
                (vert rect)))))
     #+END_SRC

**** Rotate-90

     To rotate a picture by 90 degrees counter-clockwise, all we have
     to do is make the =origin= shift to where =horiz= is, then draw
     the new =horiz= and =vert= correctly. With some vector algebra,
     the procedure in Lisp is:

     #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
       (define (rot90 pict)
         (lambda (rect)
           (pict (make-frame
                  (+vect (origin rect)
                         (horiz rect))
                  (vert rect)
                  (scale -1 (horiz rect))))))
     #+END_SRC


