video_notes/index.html

<li><a id="org32297ad"></a>Pictures<br />
<div class="outline-text-5" id="text-6-2-3-2">
<p>
We can now easily define a procedure which makes a picture:
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">make-picture</span> seglist<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #50a14f;">(</span>rect<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #a626a4;">for-each</span>
     <span style="color: #da8548;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #b751b6;">(</span>s<span style="color: #b751b6;">)</span>
       <span style="color: #b751b6;">(</span>drawline
        <span style="color: #986801;">(</span><span style="color: #4db5bd;">(</span>coord-map rect<span style="color: #4db5bd;">)</span> <span style="color: #4db5bd;">(</span>seg-start s<span style="color: #4db5bd;">)</span><span style="color: #986801;">)</span>
        <span style="color: #986801;">(</span><span style="color: #4db5bd;">(</span>coord-map rect<span style="color: #4db5bd;">)</span> <span style="color: #4db5bd;">(</span>seg-end s<span style="color: #4db5bd;">)</span><span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
     seglist<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Well, relatively easily. Let&rsquo;s explain what <code>make-picture</code>
actually does:
</p>

<ul class="org-ul">
<li>Takes argument <code>seglist</code>, which is a list of line segments
(pairs of vectors) that the picture is.</li>
<li>Returns a procedure which:
<ul class="org-ul">
<li>Takes the argument of a frame.</li>
<li>For every element in <code>seglist</code>:
<ul class="org-ul">
<li>Draws the segment within frame, by scaling it correctly
using <code>coord-map</code>.</li>
<li>This is done by giving <code>coord-map</code> the frame to scale
to.</li>
<li>The procedure returned by <code>coord-map</code> then scales the
vectors <code>(seg-start s)</code> and <code>(seg-end s)</code> to the frame.</li>
<li>This can now be drawn by <code>drawline</code>, since it has as
arguments two points.</li>
</ul></li>
</ul></li>
</ul>

<p>
Note that a picture is <i>actually</i> a procedure which draws itself
inside a given frame, and <code>make-picture</code> generates this
procedure from a <code>seglist</code>. Or, in use:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">R</span> <span style="color: #a626a4;">(</span>make-frame <span style="color: #a52a2a; font-style: italic;">;</span><span style="color: #a52a2a; font-style: italic;">some vectors</span>
           <span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">draw-george-in-frame</span> <span style="color: #a626a4;">(</span>make-picture <span style="color: #a52a2a; font-style: italic;">;</span><span style="color: #a52a2a; font-style: italic;">some seglist</span>
                <span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>draw-george-in-frame R<span style="color: #4078f2;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orge8b73d0"></a>Beside<br />
<div class="outline-text-5" id="text-6-2-3-3">
<p>
<code>beside</code> needs to draw two pictures on the screen, after scaling
them correctly (by <code>a</code>) and placing them side by side. Thus,
<code>beside</code> returns a picture which takes in an argument <code>rect</code>.
<code>beside</code> starts drawing the left picture at <code>(origin rect),
     (scale a (horiz rect)) (vert rect)</code> and the right picture at
<code>(+vect (origin rect) (scale a (horiz rect))), (scale (- 1 a)
     (horiz rect)), (vert rect)</code>. This places the two pictures side by
side and scales them correctly within <code>rect</code>. Or, in Lisp,
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">beside</span> p1 p2 a<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #50a14f;">(</span>rect<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span>p1 <span style="color: #da8548;">(</span>make-frame
         <span style="color: #b751b6;">(</span>origin rect<span style="color: #b751b6;">)</span>
         <span style="color: #b751b6;">(</span>scale a <span style="color: #986801;">(</span>horiz rect<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span>
         <span style="color: #b751b6;">(</span>vert rect<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span>p2 <span style="color: #da8548;">(</span>make-frame
         <span style="color: #b751b6;">(</span>+vect <span style="color: #986801;">(</span>origin rect<span style="color: #986801;">)</span>
                <span style="color: #986801;">(</span>scale a <span style="color: #4db5bd;">(</span>horiz rect<span style="color: #4db5bd;">)</span><span style="color: #986801;">)</span><span style="color: #b751b6;">)</span>
         <span style="color: #b751b6;">(</span>scale <span style="color: #986801;">(</span><span style="color: #2e8b57;">-1</span> a<span style="color: #986801;">)</span> <span style="color: #986801;">(</span>horiz rect<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span>
         <span style="color: #b751b6;">(</span>vert rect<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org55b69f2"></a>Rotate-90<br />
<div class="outline-text-5" id="text-6-2-3-4">
<p>
To rotate a picture by 90 degrees counter-clockwise, all we have
to do is make the <code>origin</code> shift to where <code>horiz</code> is, then draw
the new <code>horiz</code> and <code>vert</code> correctly. With some vector algebra,
the procedure in Lisp is:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">rot90</span> pict<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #50a14f;">(</span>rect<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span>pict <span style="color: #da8548;">(</span>make-frame
           <span style="color: #b751b6;">(</span>+vect <span style="color: #986801;">(</span>origin rect<span style="color: #986801;">)</span>
                  <span style="color: #986801;">(</span>horiz rect<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span>
           <span style="color: #b751b6;">(</span>vert rect<span style="color: #b751b6;">)</span>
           <span style="color: #b751b6;">(</span>scale <span style="color: #2e8b57;">-1</span> <span style="color: #986801;">(</span>horiz rect<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
