video_notes/video_notes.org
*** Means of Abstraction
    See that the picture language is now embedded in Lisp. We can
    write recursive procedures to modify a picture:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (right-push pict n a)
        (if (= n 0)
            pict
            (beside pict
                    (right-push pict (dec n) a)
                    a)))
    #+END_SRC

    We can even write a higher order procedure for "pushing":
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (push comb)
        (lambda (pict n a)
          ((repeated
            (lambda (p)
              (comb pict p a))
            n)
           pict)))

      (define right-push (push beside))
    #+END_SRC

    There's a lot to learn from this example:
    - We're embedding a language inside Lisp. All of Lisp's power is
      available to this small language now: including recursion.
    - There's no difference between a procedure and data: we're
      passing pictures around exactly like data, even though it's
      actually a procedure.
    - We've created a layered system of abstractions on top of Lisp,
      which allows /each layer/ to have all of Lisp's expressive
      power. This is contrasted to a designing such a system bottom-up
      as a tree, which would mean that:
      - Each node does a very specific purpose and is limited in
        complexity because a new feature has to be built ground-up at
        the node.
      - Making a change is near impossible, since there's no higher
        order procedural abstraction. Making a change that affects
        more than one node is a nightmare.

* Lecture 3B: Symbolic Differentiation; Quotation

  We saw that robust system design involves insensitivity to small
  changes, and that embedding a language within Lisp allows this. Let
  us turn to a somewhat similar thread, solving the problem of
  symbolic differentiation in Lisp.

  This problem is somewhat different from /numerical/ differentiation
  of a function like we did for Newton's method, since we actually
  want the expressions we work with to be in an algebraic language.
  Before figuring out how to implement such a thing, let's talk about
  the operation of differentiation itself.

** Differentiation v. Integration

   Why is it so much easier to differentiate than to integrate?
   Let us look at the basic rules of differentiation:

   $$\frac{\mathrm{d}k}{\mathrm{d}x} = 0$$
   $$\frac{\mathrm{d}x}{\mathrm{d}x} = 1$$
   $$\frac{\mathrm{d}k\cdot a}{\mathrm{d}x} = k\cdot \frac{\mathrm{d}a}{\mathrm{d}x}$$
   $$\frac{\mathrm{d}(a+b)}{\mathrm{d}x} =
   \frac{\mathrm{d}a}{\mathrm{d}x} + \frac{\mathrm{d}b}{\mathrm{d}x}$$
   $$\frac{\mathrm{d}(ab)}{\mathrm{d}x} =  a\cdot
   \frac{\mathrm{d}b}{\mathrm{d}x} +
   \frac{\mathrm{d}a}{\mathrm{d}x}\cdot b$$
   $$\frac{\mathrm{d}x^{n}}{\mathrm{d}x} = nx^{n-1}$$

   See that these rules are reduction rules, in that the derivative of
   some complex thing is the derivative of simpler things joined
   together by basic operations. Such reduction rules are naturally
   recursive in nature. This makes the problem of differentiation very
   easy to solve using simple algorithms.

   On the other hand, implementing an integration system is a much
   harder problem, since such a system would require us to go the
   other way, combining up simpler expressions to make more
   complicated ones, which often involves an intrinsically difficult
   choice to make.

   With these simple recursive rules in mind, let's implement a
   symbolic differentiation system.

** Some Wishful Thinking

   #+NAME: sym-deriv
   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define (deriv expr var)
       (cond ((constant? expr var) 0)
             ((same-var? expr var) 1)
             ((sum? expr)
              (make-sum (deriv (a1 expr) var)
                        (deriv (a2 expr) var)))
             ((product? expr)
              (make-sum
               (make-product (m1 expr)
                             (deriv (m2 expr) var))
               (make-product (deriv (m1 expr) var)
                             (m2 expr))))))
   #+END_SRC


   That's enough rules for now, we can add more later.

   Note that =a1= is a procedure returning the first term of the
   addition $x+y$ (in this case, $x$), and =a2= is a procedure
   returning the second (in this case, $y$). Similar for
   multiplication, =m1= and =m2=.

   All the -=?= procedures are predicates, and should be
   self-explanatory. =make-=, as expected, makes the object with given
   arguments as values and returns it. These are a level of
   abstraction below =deriv=, and involve the actual representation of
   algebraic expressions. Let's figure out how to do this.

** Representing Algebraic Expressions

*** Using Lisp Syntax

    One very simple way to represent expressions is to use Lisp's way:
    expressions that form trees. Consider:

    $$ax^{2} \mapsto \mathtt{(*~a~(*~x~x))}$$ $$bx+c \mapsto \mathtt{(
    \mathtt{+} ~(*~b~x)~c)}$$

    This has the advantage that representing such expression is just a
    list. Moreover, finding out the operation is merely the =car= of
    the list, and the operands are the =cdr=. This effectively
    eliminates our need for parsing algebraic expressions.

