video_notes/index.html


<div id="outline-container-orga4885f5" class="outline-4">
<h4 id="orga4885f5"><span class="section-number-4">6.2.4</span> Means of Abstraction</h4>
<div class="outline-text-4" id="text-6-2-4">
<p>
See that the picture language is now embedded in Lisp. We can
write recursive procedures to modify a picture:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">right-push</span> pict n a<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">=</span> n <span style="color: #2e8b57;">0</span><span style="color: #50a14f;">)</span>
      pict
      <span style="color: #50a14f;">(</span>beside pict
              <span style="color: #da8548;">(</span>right-push pict <span style="color: #b751b6;">(</span>dec n<span style="color: #b751b6;">)</span> a<span style="color: #da8548;">)</span>
              a<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
We can even write a higher order procedure for &ldquo;pushing&rdquo;:
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">push</span> comb<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #50a14f;">(</span>pict n a<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>repeated
      <span style="color: #b751b6;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #986801;">(</span>p<span style="color: #986801;">)</span>
        <span style="color: #986801;">(</span>comb pict p a<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span>
      n<span style="color: #da8548;">)</span>
     pict<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">right-push</span> <span style="color: #a626a4;">(</span>push beside<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
There&rsquo;s a lot to learn from this example:
</p>
<ul class="org-ul">
<li>We&rsquo;re embedding a language inside Lisp. All of Lisp&rsquo;s power is
available to this small language now: including recursion.</li>
<li>There&rsquo;s no difference between a procedure and data: we&rsquo;re
passing pictures around exactly like data, even though it&rsquo;s
actually a procedure.</li>
<li>We&rsquo;ve created a layered system of abstractions on top of Lisp,
which allows <i>each layer</i> to have all of Lisp&rsquo;s expressive
power. This is contrasted to a designing such a system bottom-up
as a tree, which would mean that:
<ul class="org-ul">
<li>Each node does a very specific purpose and is limited in
complexity because a new feature has to be built ground-up at
the node.</li>
<li>Making a change is near impossible, since there&rsquo;s no higher
order procedural abstraction. Making a change that affects
more than one node is a nightmare.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org29127fd" class="outline-2">
<h2 id="org29127fd"><span class="section-number-2">7</span> Lecture 3B: Symbolic Differentiation; Quotation</h2>
<div class="outline-text-2" id="text-7">
<p>
We saw that robust system design involves insensitivity to small
changes, and that embedding a language within Lisp allows this. Let
us turn to a somewhat similar thread, solving the problem of
symbolic differentiation in Lisp.
</p>

<p>
This problem is somewhat different from <i>numerical</i> differentiation
of a function like we did for Newton&rsquo;s method, since we actually
want the expressions we work with to be in an algebraic language.
Before figuring out how to implement such a thing, let&rsquo;s talk about
the operation of differentiation itself.
</p>
</div>

<div id="outline-container-org5f27bef" class="outline-3">
<h3 id="org5f27bef"><span class="section-number-3">7.1</span> Differentiation v. Integration</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Why is it so much easier to differentiate than to integrate?
Let us look at the basic rules of differentiation:
</p>

<p>
\[\frac{\mathrm{d}k}{\mathrm{d}x} = 0\]
\[\frac{\mathrm{d}x}{\mathrm{d}x} = 1\]
\[\frac{\mathrm{d}k\cdot a}{\mathrm{d}x} = k\cdot \frac{\mathrm{d}a}{\mathrm{d}x}\]
\[\frac{\mathrm{d}(a+b)}{\mathrm{d}x} =
   \frac{\mathrm{d}a}{\mathrm{d}x} + \frac{\mathrm{d}b}{\mathrm{d}x}\]
\[\frac{\mathrm{d}(ab)}{\mathrm{d}x} =  a\cdot
   \frac{\mathrm{d}b}{\mathrm{d}x} +
   \frac{\mathrm{d}a}{\mathrm{d}x}\cdot b\]
\[\frac{\mathrm{d}x^{n}}{\mathrm{d}x} = nx^{n-1}\]
</p>

<p>
See that these rules are reduction rules, in that the derivative of
some complex thing is the derivative of simpler things joined
together by basic operations. Such reduction rules are naturally
recursive in nature. This makes the problem of differentiation very
easy to solve using simple algorithms.
</p>

<p>
On the other hand, implementing an integration system is a much
harder problem, since such a system would require us to go the
other way, combining up simpler expressions to make more
complicated ones, which often involves an intrinsically difficult
choice to make.
</p>

<p>
With these simple recursive rules in mind, let&rsquo;s implement a
symbolic differentiation system.
</p>
</div>
</div>

<div id="outline-container-org9f6f879" class="outline-3">
<h3 id="org9f6f879"><span class="section-number-3">7.2</span> Some Wishful Thinking</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">
<pre class="src src-racket" id="org2a62ed8"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">deriv</span> expr var<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">cond</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>constant? expr var<span style="color: #da8548;">)</span> <span style="color: #2e8b57;">0</span><span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>same-var? expr var<span style="color: #da8548;">)</span> <span style="color: #2e8b57;">1</span><span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>sum? expr<span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span>make-sum <span style="color: #b751b6;">(</span>deriv <span style="color: #986801;">(</span>a1 expr<span style="color: #986801;">)</span> var<span style="color: #b751b6;">)</span>
                   <span style="color: #b751b6;">(</span>deriv <span style="color: #986801;">(</span>a2 expr<span style="color: #986801;">)</span> var<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>product? expr<span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span>make-sum
          <span style="color: #b751b6;">(</span>make-product <span style="color: #986801;">(</span>m1 expr<span style="color: #986801;">)</span>
                        <span style="color: #986801;">(</span>deriv <span style="color: #4db5bd;">(</span>m2 expr<span style="color: #4db5bd;">)</span> var<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span>
          <span style="color: #b751b6;">(</span>make-product <span style="color: #986801;">(</span>deriv <span style="color: #4db5bd;">(</span>m1 expr<span style="color: #4db5bd;">)</span> var<span style="color: #986801;">)</span>
                        <span style="color: #986801;">(</span>m2 expr<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>


<p>
That&rsquo;s enough rules for now, we can add more later.
</p>

<p>
Note that <code>a1</code> is a procedure returning the first term of the
addition \(x+y\) (in this case, \(x\)), and <code>a2</code> is a procedure
returning the second (in this case, \(y\)). Similar for
multiplication, <code>m1</code> and <code>m2</code>.
</p>

<p>
All the -<code>?</code> procedures are predicates, and should be
self-explanatory. <code>make-</code>, as expected, makes the object with given
arguments as values and returns it. These are a level of
abstraction below <code>deriv</code>, and involve the actual representation of
algebraic expressions. Let&rsquo;s figure out how to do this.
</p>
</div>
</div>

<div id="outline-container-orgae9dcf1" class="outline-3">
<h3 id="orgae9dcf1"><span class="section-number-3">7.3</span> Representing Algebraic Expressions</h3>
<div class="outline-text-3" id="text-7-3">
</div>
<div id="outline-container-orgef0b6c3" class="outline-4">
<h4 id="orgef0b6c3"><span class="section-number-4">7.3.1</span> Using Lisp Syntax</h4>
<div class="outline-text-4" id="text-7-3-1">
<p>
One very simple way to represent expressions is to use Lisp&rsquo;s way:
expressions that form trees. Consider:
</p>

<p>
\[ax^{2} \mapsto \mathtt{(*~a~(*~x~x))}\] \[bx+c \mapsto \mathtt{(
    \mathtt{+} ~(*~b~x)~c)}\]
</p>

<p>
This has the advantage that representing such expression is just a
list. Moreover, finding out the operation is merely the <code>car</code> of
the list, and the operands are the <code>cdr</code>. This effectively
eliminates our need for parsing algebraic expressions.
</p>
</div>
</div>
