video_notes/video_notes.org
*** Representation Implementation

    Let's start defining our procedures.

    #+NAME: atom?
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports none
      (define (atom? x)
        (and (not (null? x))
             (not (pair? x))))
    #+END_SRC


    #+NAME: deriv-preds
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (constant? expr var)
        (and (atom? expr)
             (not (eq? expr var))))

      (define (same-var? expr var)
        (and (atom? expr)
             (eq? expr var)))

      (define (sum? expr)
        (and (not (atom? expr))
             (eq? (car expr) '+)))

      (define (product? expr)
        (and (not (atom? expr))
             (eq? (car expr) '*)))
    #+END_SRC

    We see a new form here: ='+= and ='*=. This is called "quoting".
    Why do we need to do this? Consider:

    #+begin_verse
    "Say your name!"
    "Susanne."
    "Say 'your name'!"
    "Your name."
    #+end_verse

    To differentiate the cases where we mean /literally/ say "your
    name" and the case where we actually ask what "your name" /is/, we
    use quotation marks in English. Similarly, quoting a symbol in
    Lisp tells the interpreter to check /literally/ for =(car expr)=
    to be the symbol =+= and not the procedure =+=.

    Quotation is actually quite a complicated thing. Following the
    principle of substituting equals for equals, consider:

    #+begin_verse
    "Chicago" has seven letters.
    Chicago is the biggest city in Illinois.
    "The biggest city in Illinois" has seven letters.
    #+end_verse

    The first two statements are true, and quotation marks are used
    correctly in the first to show that we're talking about Chicago
    the word and not Chicago the city. However, the third statement is
    wrong entirely (although it is the result of changing equals for
    equals), because the phrase "The biggest city in Illinois" does
    not have seven letters.
    That is, we cannot substitute equals for equals in referentially
    opaque contexts.

    Note that the ='= symbol breaks the neat pattern of Lisp where all
    expressions are delimited by =()=. To resolve this, we introduce
    the special form =(quote +)=, which does the exactly same thing as
    ='+=.

    Now defining the constructors:

    #+NAME: deriv-makes
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (make-sum a1 a2)
        (list '+ a1 a2))

      (define (make-product m1 m2)
        (list '* m1 m2))
    #+END_SRC


    Finally, we must define the selectors:

    #+NAME: deriv-cadr
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define a1 cadr)
      (define a2 caddr)

      (define m1 cadr)
      (define m2 caddr)
    #+END_SRC


    =cadr= is the =car= of the =cdr= and =caddr= is the =car= of the
    =cdr= of the =cdr=. These are forms provided for convenience while
    programming, since list processing a big part of Lisp.[fn:5]

    Let's try it out:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<atom?>>
      <<deriv-preds>>
      <<deriv-makes>>
      <<deriv-cadr>>
      <<sym-deriv>>

      (deriv '(+ (* a (* x x)) (+ (* b x) c)) 'x)
      (deriv '(+ (* a (* x x)) (+ (* b x) c)) 'a)
      (deriv '(+ (* a (* x x)) (+ (* b x) c)) 'b)
      (deriv '(+ (* a (* x x)) (+ (* b x) c)) 'c)
    #+END_SRC

    #+RESULTS:
    : (+ (+ (* a (+ (* x 1) (* 1 x))) (* 0 (* x x))) (+ (+ (* b 1) (* 0 x)) 0))
    : (+ (+ (* a (+ (* x 0) (* 0 x))) (* 1 (* x x))) (+ (+ (* b 0) (* 0 x)) 0))
    : (+ (+ (* a (+ (* x 0) (* 0 x))) (* 0 (* x x))) (+ (+ (* b 0) (* 1 x)) 0))
    : (+ (+ (* a (+ (* x 0) (* 0 x))) (* 0 (* x x))) (+ (+ (* b 0) (* 0 x)) 1))

    Note the recursive nature of =deriv=: the process creates results
    with the same shape even when we differentiate with respect to
    some other variable. This is because the recursion only ends when
    an expression is decomposed to either =same-var?= or =constant?=.

