video_notes/index.html

<div id="outline-container-org5eb9df7" class="outline-4">
<h4 id="org5eb9df7"><span class="section-number-4">7.3.2</span> Representation Implementation</h4>
<div class="outline-text-4" id="text-7-3-2">
<p>
Let&rsquo;s start defining our procedures.
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orgf932dbb"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">constant?</span> expr var<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">and</span> <span style="color: #50a14f;">(</span>atom? expr<span style="color: #50a14f;">)</span>
       <span style="color: #50a14f;">(</span><span style="color: #a626a4;">not</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">eq?</span> expr var<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">same-var?</span> expr var<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">and</span> <span style="color: #50a14f;">(</span>atom? expr<span style="color: #50a14f;">)</span>
       <span style="color: #50a14f;">(</span><span style="color: #a626a4;">eq?</span> expr var<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">sum?</span> expr<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">and</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">not</span> <span style="color: #da8548;">(</span>atom? expr<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
       <span style="color: #50a14f;">(</span><span style="color: #a626a4;">eq?</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">car</span> expr<span style="color: #da8548;">)</span> <span style="color: #2e8b57;">'+</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">product?</span> expr<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">and</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">not</span> <span style="color: #da8548;">(</span>atom? expr<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
       <span style="color: #50a14f;">(</span><span style="color: #a626a4;">eq?</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">car</span> expr<span style="color: #da8548;">)</span> <span style="color: #2e8b57;">'*</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
We see a new form here: <code>'+</code> and <code>'*</code>. This is called &ldquo;quoting&rdquo;.
Why do we need to do this? Consider:
</p>

<p class="verse">
&ldquo;Say your name!&rdquo;<br />
&ldquo;Susanne.&rdquo;<br />
&ldquo;Say &lsquo;your name&rsquo;!&rdquo;<br />
&ldquo;Your name.&rdquo;<br />
</p>

<p>
To differentiate the cases where we mean <i>literally</i> say &ldquo;your
name&rdquo; and the case where we actually ask what &ldquo;your name&rdquo; <i>is</i>, we
use quotation marks in English. Similarly, quoting a symbol in
Lisp tells the interpreter to check <i>literally</i> for <code>(car expr)</code>
to be the symbol <code>+</code> and not the procedure <code>+</code>.
</p>

<p>
Quotation is actually quite a complicated thing. Following the
principle of substituting equals for equals, consider:
</p>

<p class="verse">
&ldquo;Chicago&rdquo; has seven letters.<br />
Chicago is the biggest city in Illinois.<br />
&ldquo;The biggest city in Illinois&rdquo; has seven letters.<br />
</p>

<p>
The first two statements are true, and quotation marks are used
correctly in the first to show that we&rsquo;re talking about Chicago
the word and not Chicago the city. However, the third statement is
wrong entirely (although it is the result of changing equals for
equals), because the phrase &ldquo;The biggest city in Illinois&rdquo; does
not have seven letters.
That is, we cannot substitute equals for equals in referentially
opaque contexts.
</p>

<p>
Note that the <code>'</code> symbol breaks the neat pattern of Lisp where all
expressions are delimited by <code>()</code>. To resolve this, we introduce
the special form <code>(quote +)</code>, which does the exactly same thing as
<code>'+</code>.
</p>

<p>
Now defining the constructors:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org010e731"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">make-sum</span> a1 a2<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">list</span> <span style="color: #2e8b57;">'+</span> a1 a2<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">make-product</span> m1 m2<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">list</span> <span style="color: #2e8b57;">'*</span> m1 m2<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>


<p>
Finally, we must define the selectors:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org12cc0a8"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">a1</span> <span style="color: #a626a4;">cadr</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">a2</span> <span style="color: #a626a4;">caddr</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">m1</span> <span style="color: #a626a4;">cadr</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">m2</span> <span style="color: #a626a4;">caddr</span><span style="color: #4078f2;">)</span>
</pre>
</div>


<p>
<code>cadr</code> is the <code>car</code> of the <code>cdr</code> and <code>caddr</code> is the <code>car</code> of the
<code>cdr</code> of the <code>cdr</code>. These are forms provided for convenience while
programming, since list processing a big part of Lisp.<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup>
</p>

<p>
Let&rsquo;s try it out:
</p>

<div class="org-src-container">
<pre class="src src-racket">





<span style="color: #4078f2;">(</span>deriv '<span style="color: #a626a4;">(</span><span style="color: #a626a4;">+</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> a <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> x x<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> b x<span style="color: #da8548;">)</span> c<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span> <span style="color: #2e8b57;">'x</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>deriv '<span style="color: #a626a4;">(</span><span style="color: #a626a4;">+</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> a <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> x x<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> b x<span style="color: #da8548;">)</span> c<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span> <span style="color: #2e8b57;">'a</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>deriv '<span style="color: #a626a4;">(</span><span style="color: #a626a4;">+</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> a <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> x x<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> b x<span style="color: #da8548;">)</span> c<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span> <span style="color: #2e8b57;">'b</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>deriv '<span style="color: #a626a4;">(</span><span style="color: #a626a4;">+</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> a <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> x x<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> b x<span style="color: #da8548;">)</span> c<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span> <span style="color: #2e8b57;">'c</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
(+ (+ (* a (+ (* x 1) (* 1 x))) (* 0 (* x x))) (+ (+ (* b 1) (* 0 x)) 0))
(+ (+ (* a (+ (* x 0) (* 0 x))) (* 1 (* x x))) (+ (+ (* b 0) (* 0 x)) 0))
(+ (+ (* a (+ (* x 0) (* 0 x))) (* 0 (* x x))) (+ (+ (* b 0) (* 1 x)) 0))
(+ (+ (* a (+ (* x 0) (* 0 x))) (* 0 (* x x))) (+ (+ (* b 0) (* 0 x)) 1))
</pre>


<p>
Note the recursive nature of <code>deriv</code>: the process creates results
with the same shape even when we differentiate with respect to
some other variable. This is because the recursion only ends when
an expression is decomposed to either <code>same-var?</code> or <code>constant?</code>.
</p>
</div>
</div>
