video_notes/index.html

<div id="outline-container-org4bac4f9" class="outline-4">
<h4 id="org4bac4f9"><span class="section-number-4">7.3.3</span> Simplification</h4>
<div class="outline-text-4" id="text-7-3-3">
<p>
However, these results are ugly, and we know why &#x2014; there&rsquo;s no
simplification. Technically, it&rsquo;s correct:
</p>

\begin{align*}
&a(1x+1x) + 0x^{2} + b + 0x + 0\\
=& 2ax + b
\end{align*}

<p>
Note that we&rsquo;ve faced this same problem before with fractions, and
recall that the solution was to change the constructors so that
they&rsquo;d simplify while creating the lists. Consider:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org3a2a786"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">make-sum</span> a1 a2<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">cond</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #e45649;">and</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">number?</span> a1<span style="color: #b751b6;">)</span>
              <span style="color: #b751b6;">(</span><span style="color: #a626a4;">number?</span> a2<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span><span style="color: #a626a4;">+</span> a1 a2<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #e45649;">and</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">number?</span> a1<span style="color: #b751b6;">)</span>
              <span style="color: #b751b6;">(</span><span style="color: #a626a4;">=</span> a1 <span style="color: #2e8b57;">0</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
         a2<span style="color: #50a14f;">)</span>
         <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #e45649;">and</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">number?</span> a2<span style="color: #b751b6;">)</span>
              <span style="color: #b751b6;">(</span><span style="color: #a626a4;">=</span> a2 <span style="color: #2e8b57;">0</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
          a1<span style="color: #50a14f;">)</span>
         <span style="color: #50a14f;">(</span><span style="color: #e45649;">else</span>
          <span style="color: #da8548;">(</span><span style="color: #a626a4;">list</span> <span style="color: #2e8b57;">'+</span> a1 a2<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">make-product</span> m1 m2<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">cond</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #e45649;">and</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">number?</span> m1<span style="color: #b751b6;">)</span>
              <span style="color: #b751b6;">(</span><span style="color: #a626a4;">number?</span> m2<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> m1 m2<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #e45649;">and</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">number?</span> m1<span style="color: #b751b6;">)</span>
              <span style="color: #b751b6;">(</span><span style="color: #a626a4;">=</span> m1 <span style="color: #2e8b57;">0</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
         <span style="color: #2e8b57;">0</span><span style="color: #50a14f;">)</span>
         <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #e45649;">and</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">number?</span> m2<span style="color: #b751b6;">)</span>
              <span style="color: #b751b6;">(</span><span style="color: #a626a4;">=</span> m2 <span style="color: #2e8b57;">0</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
          <span style="color: #2e8b57;">0</span><span style="color: #50a14f;">)</span>
         <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #e45649;">and</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">number?</span> m1<span style="color: #b751b6;">)</span>
               <span style="color: #b751b6;">(</span><span style="color: #a626a4;">=</span> m1 <span style="color: #2e8b57;">1</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
          m2<span style="color: #50a14f;">)</span>
         <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #e45649;">and</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">number?</span> m2<span style="color: #b751b6;">)</span>
               <span style="color: #b751b6;">(</span><span style="color: #a626a4;">=</span> m2 <span style="color: #2e8b57;">1</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
          m1<span style="color: #50a14f;">)</span>
         <span style="color: #50a14f;">(</span><span style="color: #e45649;">else</span>
          <span style="color: #da8548;">(</span><span style="color: #a626a4;">list</span> <span style="color: #2e8b57;">'+</span> m1 m2<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Now trying <code>deriv</code>:
</p>


<div class="org-src-container">
<pre class="src src-racket">





<span style="color: #4078f2;">(</span>deriv '<span style="color: #a626a4;">(</span><span style="color: #a626a4;">+</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> a <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> x x<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> b x<span style="color: #da8548;">)</span> c<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span> <span style="color: #2e8b57;">'x</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>deriv '<span style="color: #a626a4;">(</span><span style="color: #a626a4;">+</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> a <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> x x<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> b x<span style="color: #da8548;">)</span> c<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span> <span style="color: #2e8b57;">'a</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>deriv '<span style="color: #a626a4;">(</span><span style="color: #a626a4;">+</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> a <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> x x<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> b x<span style="color: #da8548;">)</span> c<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span> <span style="color: #2e8b57;">'b</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>deriv '<span style="color: #a626a4;">(</span><span style="color: #a626a4;">+</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> a <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> x x<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> b x<span style="color: #da8548;">)</span> c<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span> <span style="color: #2e8b57;">'c</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
(+ (+ a (+ x x)) b)
(* x x)
x
1
</pre>


<p>
Excellent, these are much better. Note, of course, that we could
simplify the first one further, but, in general, algebraic
simplification is a painful problem, since the definition of
simplest form varies with application. However, this is good
enough.
</p>
</div>
</div>
</div>

<div id="outline-container-org50c6f66" class="outline-3">
<h3 id="org50c6f66"><span class="section-number-3">7.4</span> On Abstract Syntax</h3>
<div class="outline-text-3" id="text-7-4">
<p>
Note that the syntax we used was abstract in the sense that it had
its own rules and grammar. However, since it followed Lisp&rsquo;s syntax
closely, we needed quotation to allow full expression.
</p>

<p>
This is a powerful paradigm: not only can we use meta-linguistic
abstraction to create languages embedded within Lisp, but we can
also use Lisp to interpret any syntax. We&rsquo;ll see more of this in
the future.
</p>
</div>
</div>
</div>

<div id="outline-container-orgdc5c673" class="outline-2">
<h2 id="orgdc5c673"><span class="section-number-2">8</span> Lecture 4A: Pattern Matching and Rule-Based Substitution</h2>
<div class="outline-text-2" id="text-8">
<p>
It&rsquo;s a funny technique we used last time, converting the rules of
differentiation to Lisp. In fact, if we wanted to explain (say) the
rules of algebra to the computer, we&rsquo;d have to again create a
similar program which converts the rules of algebra to Lisp.
</p>

<p>
See that there&rsquo;s a higher-order idea here, of explaining rules to
Lisp and having the rules applied to an input expression to
&ldquo;simplify&rdquo; it. Our style of writing a rule-based substitution
program is:
</p>

<p>
Rules &rarr; conditional &rarr; dispatch
</p>

<p>
That is, we try the rules on the given expression. If there&rsquo;s a
match, we &ldquo;dispatch&rdquo; the result to substitute. Now, in general, the
application of a rule is:
</p>

<ul class="org-ul">
<li>Compare LHS of rule to input expression.</li>
<li>If match, RHS with substituted values is replacement.</li>
</ul>

<p>
Or, diagrammatically:
</p>

<p>
Let us now build a simple language to express these rules, which can
then be pattern matched, skeletons created, then instantiated.
</p>
</div>
