video_notes/video_notes.org
** Rule Language

   Here's a sample bit of what we want the rule language to look like:

   #+NAME: rule-deriv-rules
   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define deriv-rules
       '(
         ((dd (?c c) (? v)) 0)
         ((dd (?v v) (? v)) 1)
         ((dd (?v u) (? v)) 0)

         ((dd (* (?c c) (? x)) (? v)) (* (: c) (dd (: x) (: v))))

         ((dd (+ (? x1) (? x2)) (? v))
          (+ (dd (: x1) (: v))
             (dd (: x2) (: v))))

         ((dd (* (? x1) (? x2)) (? v))
          (+ (* (: x1) (dd (: x2) (: v)))
             (* (: x2) (dd (: x1) (: v)))))
         ; ...
         ))
   #+END_SRC

   It is worth explaining what this syntax means exactly, because
   eventually, we want to parse it.

   The rules are a list of pairs. The =car= of each pair is the
   pattern to match (rule LHS), and the =cdr= is the skeleton
   substitution expression (rule RHS).

*** Pattern Matching

    The idea of the LHS language is to provide a framework where
    certain constructs can be matched and possibly named. These names
    will then be passed to the skeleton instantiator.[fn:6]

    #+ATTR_LATEX: :booktabs t
    | Syntax    | Meaning                                                                     |
    |-----------+-----------------------------------------------------------------------------|
    | =foo=     | Matches itself literally.                                                   |
    | =(f a b)= | Matches every 3-list whose =car= is =f=, =cadr= is =a=, and =caddr= is =b=. |
    | =(? x)=   | Matches any expression, and calls it =x=.                                   |
    | =(?c x)=  | Matches an expression which is a constant, and calls it =x=.                |
    | =(?v x)=  | Matches an expression which is a variable, and calls it =x=.                |


*** Skeleton and Instantiation
    The RHS language provides a skeleton wherein values provided by
    the LHS language can be substituted.

    #+ATTR_LATEX: :booktabs t
    | Syntax    | Meaning                                                       |
    |-----------+---------------------------------------------------------------|
    | =foo=     | Instantiates =foo=.                                           |
    | =(f a b)= | Instantiates each element of the list and returns a list.     |
    | =(: x)=   | Instantiate the value of =x= provided by the pattern matcher. |

** Desired Behaviour

   We expect to use this program by calling a procedure called
   =simplifier=, to which we provide the list of rules. The procedure
   should return another procedure, which is able to apply the rules
   to a given input expression. Or, in Lisp:

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define dsimp
       (simplifier deriv-rules))

     (dsimp '(dd (+ x y) x))
   #+END_SRC

   #+begin_example
    (+ 1 0)
   #+end_example

** Implementation

   We implement a procedure =match=, which takes a pattern, an
   expression, and a dictionary as arguments. If that pattern matches
   the expression, it writes the =?= values to the dictionary and
   returns it. Next, we implement =instantiate=, which takes as
   arguments a skeleton and a dictionary, and substitutes variables in
   the skeleton with their dictionary values. Finally, this new
   expression is returned to the =match=-er to match more patterns.
   Finally, we implement =simplify=, which takes in a list of the
   rules and applies these in a match-instantiate cycle until the
   expression cannot be further simplified (no more change after a
   round of match-instantiate).

