video_notes/index.html

<div id="outline-container-orga3dd5b4" class="outline-3">
<h3 id="orga3dd5b4"><span class="section-number-3">8.1</span> Rule Language</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Here&rsquo;s a sample bit of what we want the rule language to look like:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orgcccfb95"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">deriv-rules</span>
  '<span style="color: #a626a4;">(</span>
    <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>dd <span style="color: #b751b6;">(</span>?c c<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span>? v<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span> <span style="color: #2e8b57;">0</span><span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>dd <span style="color: #b751b6;">(</span>?v v<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span>? v<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span> <span style="color: #2e8b57;">1</span><span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>dd <span style="color: #b751b6;">(</span>?v u<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span>? v<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span> <span style="color: #2e8b57;">0</span><span style="color: #50a14f;">)</span>

    <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>dd <span style="color: #b751b6;">(</span><span style="color: #a626a4;">*</span> <span style="color: #986801;">(</span>?c c<span style="color: #986801;">)</span> <span style="color: #986801;">(</span>? x<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span>? v<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">:</span> c<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span>dd <span style="color: #986801;">(</span><span style="color: #a626a4;">:</span> x<span style="color: #986801;">)</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">:</span> v<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>

    <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>dd <span style="color: #b751b6;">(</span><span style="color: #a626a4;">+</span> <span style="color: #986801;">(</span>? x1<span style="color: #986801;">)</span> <span style="color: #986801;">(</span>? x2<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span>? v<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
     <span style="color: #da8548;">(</span><span style="color: #a626a4;">+</span> <span style="color: #b751b6;">(</span>dd <span style="color: #986801;">(</span><span style="color: #a626a4;">:</span> x1<span style="color: #986801;">)</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">:</span> v<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span>
        <span style="color: #b751b6;">(</span>dd <span style="color: #986801;">(</span><span style="color: #a626a4;">:</span> x2<span style="color: #986801;">)</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">:</span> v<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>

    <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>dd <span style="color: #b751b6;">(</span><span style="color: #a626a4;">*</span> <span style="color: #986801;">(</span>? x1<span style="color: #986801;">)</span> <span style="color: #986801;">(</span>? x2<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span>? v<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
     <span style="color: #da8548;">(</span><span style="color: #a626a4;">+</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">*</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">:</span> x1<span style="color: #986801;">)</span> <span style="color: #986801;">(</span>dd <span style="color: #4db5bd;">(</span><span style="color: #a626a4;">:</span> x2<span style="color: #4db5bd;">)</span> <span style="color: #4db5bd;">(</span><span style="color: #a626a4;">:</span> v<span style="color: #4db5bd;">)</span><span style="color: #986801;">)</span><span style="color: #b751b6;">)</span>
        <span style="color: #b751b6;">(</span><span style="color: #a626a4;">*</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">:</span> x2<span style="color: #986801;">)</span> <span style="color: #986801;">(</span>dd <span style="color: #4db5bd;">(</span><span style="color: #a626a4;">:</span> x1<span style="color: #4db5bd;">)</span> <span style="color: #4db5bd;">(</span><span style="color: #a626a4;">:</span> v<span style="color: #4db5bd;">)</span><span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
    <span style="color: #a52a2a; font-style: italic;">; </span><span style="color: #a52a2a; font-style: italic;">...</span>
    <span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
It is worth explaining what this syntax means exactly, because
eventually, we want to parse it.
</p>

<p>
The rules are a list of pairs. The <code>car</code> of each pair is the
pattern to match (rule LHS), and the <code>cdr</code> is the skeleton
substitution expression (rule RHS).
</p>
</div>

<div id="outline-container-org3b4b26e" class="outline-4">
<h4 id="org3b4b26e"><span class="section-number-4">8.1.1</span> Pattern Matching</h4>
<div class="outline-text-4" id="text-8-1-1">
<p>
The idea of the LHS language is to provide a framework where
certain constructs can be matched and possibly named. These names
will then be passed to the skeleton instantiator.<sup><a id="fnr.6" class="footref" href="#fn.6">6</a></sup>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Syntax</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>foo</code></td>
<td class="org-left">Matches itself literally.</td>
</tr>

<tr>
<td class="org-left"><code>(f a b)</code></td>
<td class="org-left">Matches every 3-list whose <code>car</code> is <code>f</code>, <code>cadr</code> is <code>a</code>, and <code>caddr</code> is <code>b</code>.</td>
</tr>

<tr>
<td class="org-left"><code>(? x)</code></td>
<td class="org-left">Matches any expression, and calls it <code>x</code>.</td>
</tr>

<tr>
<td class="org-left"><code>(?c x)</code></td>
<td class="org-left">Matches an expression which is a constant, and calls it <code>x</code>.</td>
</tr>

<tr>
<td class="org-left"><code>(?v x)</code></td>
<td class="org-left">Matches an expression which is a variable, and calls it <code>x</code>.</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org6ef267a" class="outline-4">
<h4 id="org6ef267a"><span class="section-number-4">8.1.2</span> Skeleton and Instantiation</h4>
<div class="outline-text-4" id="text-8-1-2">
<p>
The RHS language provides a skeleton wherein values provided by
the LHS language can be substituted.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Syntax</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>foo</code></td>
<td class="org-left">Instantiates <code>foo</code>.</td>
</tr>

<tr>
<td class="org-left"><code>(f a b)</code></td>
<td class="org-left">Instantiates each element of the list and returns a list.</td>
</tr>

<tr>
<td class="org-left"><code>(: x)</code></td>
<td class="org-left">Instantiate the value of <code>x</code> provided by the pattern matcher.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orge7381df" class="outline-3">
<h3 id="orge7381df"><span class="section-number-3">8.2</span> Desired Behaviour</h3>
<div class="outline-text-3" id="text-8-2">
<p>
We expect to use this program by calling a procedure called
<code>simplifier</code>, to which we provide the list of rules. The procedure
should return another procedure, which is able to apply the rules
to a given input expression. Or, in Lisp:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">dsimp</span>
  <span style="color: #a626a4;">(</span>simplifier deriv-rules<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>dsimp '<span style="color: #a626a4;">(</span>dd <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> x y<span style="color: #50a14f;">)</span> x<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
(+ 1 0)
</pre>
</div>
</div>

<div id="outline-container-org6b1e4f5" class="outline-3">
<h3 id="org6b1e4f5"><span class="section-number-3">8.3</span> Implementation</h3>
<div class="outline-text-3" id="text-8-3">
<p>
We implement a procedure <code>match</code>, which takes a pattern, an
expression, and a dictionary as arguments. If that pattern matches
the expression, it writes the <code>?</code> values to the dictionary and
returns it. Next, we implement <code>instantiate</code>, which takes as
arguments a skeleton and a dictionary, and substitutes variables in
the skeleton with their dictionary values. Finally, this new
expression is returned to the <code>match</code>-er to match more patterns.
Finally, we implement <code>simplify</code>, which takes in a list of the
rules and applies these in a match-instantiate cycle until the
expression cannot be further simplified (no more change after a
round of match-instantiate).
</p>
</div>
