video_notes/video_notes.org
*** Matcher

    Abstractly, the job of the matcher is to do a tree traversal and
    comparison. Consider the rule LHS: =(+ (* (? x) (? y)) (? y))=,
    and an expression to match: =(+ (* 3 x) x)= (say). Then, the trees
    are:

    #+LATEX: \begin{center}
    #+LATEX: \begin{forest}
    #+LATEX: [+ [* [\texttt{(? x)}] [\texttt{(? y)}]] [\texttt{(? y)}]]
    #+LATEX: \end{forest}
    #+LATEX: \begin{forest}
    #+LATEX: [+ [* [\texttt{3}] [\texttt{x}]] [\texttt{x}]]
    #+LATEX: \end{forest}
    #+LATEX: \end{center}

    Clearly, these expressions should be matched in the tree
    traversal. Don't confuse the =(? x)= in the rule LHS with the
    symbol =x= in the expression: for the rule, it's just a matching
    variable, but the =x= in the expression goes into the dictionary.

    Let's now write our first implementation of =match=:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (match pat expr dict)
        (cond ((eq? dict 'failed) 'failed)
              ; ... some other cases
              ((atom? expr) 'failed)
              (else
               (match (cdr pat)
                       (cdr expr)
                       (match (car pat)
                               (car expr)
                               dict)))))
    #+END_SRC

    Before we write the entire procedure, let's observe how the
    general case (=else=) works, because that's the bit which does the
    tree traversal. It calls =match= on the =car= of the pattern and
    expression. If they match, we return a dictionary, which is then
    used to match the =cdr= of the original expression. Why does this
    do tree traversal? Well, it's basically a depth first search on a
    tree. Consider what happens when =match= is called on the =car=.
    After being called for the =caar= and =caaar=...it'll eventually
    be called for the =cadr= and the =caddr= and so on. That's
    precisely what a depth first search is. It'll keep going deeper
    and deeper until it fails, which is when it takes one step back
    and goes deeper into another branch.

    Now, it is important to define the non-general cases, especially
    the ones that terminate =match=. The most important of these is
    when the expression passed is atomic, since that means we're at
    the leaf of the expression tree. Another possible failure is the
    insertion into the dictionary failing. How is this possible?
    Consider:

    #+LATEX: \begin{center}
    #+LATEX: \begin{forest}
    #+LATEX: [+ [* [\texttt{(? x)}] [\texttt{(? y)}]] [\boxed{\texttt{(?~y)}}]]
    #+LATEX: \end{forest}
    #+LATEX: \begin{forest}
    #+LATEX: [+ [* [\texttt{3}] [\texttt{x}]] [\boxed{\texttt{q}}]]
    #+LATEX: \end{forest}
    #+LATEX: \end{center}

    Just before =match= reaches the last leaf (boxed), our dictionary will look
    something like the following:

    #+ATTR_LATEX: :booktabs t
    | rule-vars | expr-vals |
    |-----------+-----------|
    | x         | 3         |
    | y         | x         |

    However, when it tries to insert =y: q=, the dictionary will
    =failed= to do so, because =y= already has value =x=, and thus the
    rule does not match.

    Finally, we implement as more cases in the =cond= other things we
    may need to match, according to the rule language ([[Rule Language]]).

    #+NAME: rule-match
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (match pattern expression dict)
        (cond ((eq? dict 'failed) 'failed)

              ((atom? pattern)
               (if (atom? expression)
                   (if (eq? pattern expression)
                       dict
                       'failed)
                   'failed))

              ((arbitrary-constant? pattern)
               (if (constant? expression)
                   (extend-dict pattern expression dict)
                   'failed))

              ((arbitrary-variable? pattern)
               (if (variable? expression)
                   (extend-dict pattern expression dict)
                   'failed))

              ((arbitrary-expression? pattern)
               (extend-dict pattern expression dict))

              ((atom? expression) 'failed)

              (else
               (match (cdr pattern)
                       (cdr expression)
                       (match (car pattern)
                               (car expression)
                               dict)))))
    #+END_SRC

    We add one case wherein both the pattern to be matched and the
    expression are atomic and the same, (the case =foo= in [[Rule
    Language]]), in which we simply return the dictionary, since the
    pattern matches. The other new cases are self-explanatory: they are
    merely matching =(?c)=, =(?v)=, and =(?)=.


