video_notes/index.html

<div id="outline-container-org30b967a" class="outline-4">
<h4 id="org30b967a"><span class="section-number-4">8.3.1</span> Matcher</h4>
<div class="outline-text-4" id="text-8-3-1">
<p>
Abstractly, the job of the matcher is to do a tree traversal and
comparison. Consider the rule LHS: <code>(+ (* (? x) (? y)) (? y))</code>,
and an expression to match: <code>(+ (* 3 x) x)</code> (say). Then, the trees
are:
</p>

<p>
Clearly, these expressions should be matched in the tree
traversal. Don&rsquo;t confuse the <code>(? x)</code> in the rule LHS with the
symbol <code>x</code> in the expression: for the rule, it&rsquo;s just a matching
variable, but the <code>x</code> in the expression goes into the dictionary.
</p>

<p>
Let&rsquo;s now write our first implementation of <code>match</code>:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">match</span> pat expr dict<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">cond</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #a626a4;">eq?</span> dict <span style="color: #2e8b57;">'failed</span><span style="color: #da8548;">)</span> <span style="color: #2e8b57;">'failed</span><span style="color: #50a14f;">)</span>
        <span style="color: #a52a2a; font-style: italic;">; </span><span style="color: #a52a2a; font-style: italic;">... some other cases</span>
        <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>atom? expr<span style="color: #da8548;">)</span> <span style="color: #2e8b57;">'failed</span><span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span><span style="color: #e45649;">else</span>
         <span style="color: #da8548;">(</span><span style="color: #a626a4;">match</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">cdr</span> pat<span style="color: #b751b6;">)</span>
                 <span style="color: #b751b6;">(</span><span style="color: #a626a4;">cdr</span> expr<span style="color: #b751b6;">)</span>
                 <span style="color: #b751b6;">(</span><span style="color: #a626a4;">match</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">car</span> pat<span style="color: #986801;">)</span>
                         <span style="color: #986801;">(</span><span style="color: #a626a4;">car</span> expr<span style="color: #986801;">)</span>
                         dict<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Before we write the entire procedure, let&rsquo;s observe how the
general case (<code>else</code>) works, because that&rsquo;s the bit which does the
tree traversal. It calls <code>match</code> on the <code>car</code> of the pattern and
expression. If they match, we return a dictionary, which is then
used to match the <code>cdr</code> of the original expression. Why does this
do tree traversal? Well, it&rsquo;s basically a depth first search on a
tree. Consider what happens when <code>match</code> is called on the <code>car</code>.
After being called for the <code>caar</code> and <code>caaar</code>&#x2026;it&rsquo;ll eventually
be called for the <code>cadr</code> and the <code>caddr</code> and so on. That&rsquo;s
precisely what a depth first search is. It&rsquo;ll keep going deeper
and deeper until it fails, which is when it takes one step back
and goes deeper into another branch.
</p>

<p>
Now, it is important to define the non-general cases, especially
the ones that terminate <code>match</code>. The most important of these is
when the expression passed is atomic, since that means we&rsquo;re at
the leaf of the expression tree. Another possible failure is the
insertion into the dictionary failing. How is this possible?
Consider:
</p>

<p>
Just before <code>match</code> reaches the last leaf (boxed), our dictionary will look
something like the following:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">rule-vars</th>
<th scope="col" class="org-left">expr-vals</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">x</td>
<td class="org-left">3</td>
</tr>

<tr>
<td class="org-left">y</td>
<td class="org-left">x</td>
</tr>
</tbody>
</table>

<p>
However, when it tries to insert <code>y: q</code>, the dictionary will
<code>failed</code> to do so, because <code>y</code> already has value <code>x</code>, and thus the
rule does not match.
</p>

<p>
Finally, we implement as more cases in the <code>cond</code> other things we
may need to match, according to the rule language (<a href="#orga3dd5b4">8.1</a>).
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org1a9ab68"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">match</span> pattern expression dict<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">cond</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #a626a4;">eq?</span> dict <span style="color: #2e8b57;">'failed</span><span style="color: #da8548;">)</span> <span style="color: #2e8b57;">'failed</span><span style="color: #50a14f;">)</span>

        <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>atom? pattern<span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span><span style="color: #e45649;">if</span> <span style="color: #b751b6;">(</span>atom? expression<span style="color: #b751b6;">)</span>
             <span style="color: #b751b6;">(</span><span style="color: #e45649;">if</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">eq?</span> pattern expression<span style="color: #986801;">)</span>
                 dict
                 <span style="color: #2e8b57;">'failed</span><span style="color: #b751b6;">)</span>
             <span style="color: #2e8b57;">'failed</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>

        <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>arbitrary-constant? pattern<span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span><span style="color: #e45649;">if</span> <span style="color: #b751b6;">(</span>constant? expression<span style="color: #b751b6;">)</span>
             <span style="color: #b751b6;">(</span>extend-dict pattern expression dict<span style="color: #b751b6;">)</span>
             <span style="color: #2e8b57;">'failed</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>

        <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>arbitrary-variable? pattern<span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span><span style="color: #e45649;">if</span> <span style="color: #b751b6;">(</span>variable? expression<span style="color: #b751b6;">)</span>
             <span style="color: #b751b6;">(</span>extend-dict pattern expression dict<span style="color: #b751b6;">)</span>
             <span style="color: #2e8b57;">'failed</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>

        <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>arbitrary-expression? pattern<span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span>extend-dict pattern expression dict<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>

        <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>atom? expression<span style="color: #da8548;">)</span> <span style="color: #2e8b57;">'failed</span><span style="color: #50a14f;">)</span>

        <span style="color: #50a14f;">(</span><span style="color: #e45649;">else</span>
         <span style="color: #da8548;">(</span><span style="color: #a626a4;">match</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">cdr</span> pattern<span style="color: #b751b6;">)</span>
                 <span style="color: #b751b6;">(</span><span style="color: #a626a4;">cdr</span> expression<span style="color: #b751b6;">)</span>
                 <span style="color: #b751b6;">(</span><span style="color: #a626a4;">match</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">car</span> pattern<span style="color: #986801;">)</span>
                         <span style="color: #986801;">(</span><span style="color: #a626a4;">car</span> expression<span style="color: #986801;">)</span>
                         dict<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
We add one case wherein both the pattern to be matched and the
expression are atomic and the same, (the case <code>foo</code> in <a href="#orga3dd5b4">8.1</a>), in which we simply return the dictionary, since the
pattern matches. The other new cases are self-explanatory: they are
merely matching <code>(?c)</code>, <code>(?v)</code>, and <code>(?)</code>.
</p>
</div>
</div>
