video_notes/video_notes.org
*** Instantiator

    Recall that instantiate must take accept the input of a skeleton
    and a dictionary, traverse the skeleton tree, and replace rule
    variables for expression values according to the dictionary. That
    is, given the tree:

    #+LATEX: \begin{center}
    #+LATEX: \begin{forest}
    #+LATEX: [* [\texttt{(: x)}] [\texttt{(: y)}]]
    #+LATEX: \end{forest}
    #+LATEX: \end{center}

    And the dictionary =(x: 3, y: 4)=, it should produce the tree:

    #+LATEX: \begin{center}
    #+LATEX: \begin{forest}
    #+LATEX: [* [\texttt{3}] [\texttt{4}]]
    #+LATEX: \end{forest}
    #+LATEX: \end{center}

    This is a fairly simple procedure to write:

    #+NAME: rule-instantiate
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (instantiate skeleton dict)
        (cond ((atom? skeleton) skeleton)
              ((skeleton-evaluation? skeleton)
               (evaluate (evaluation-expression skeleton)
                         dict))
              (else (cons (instantiate (car skeleton) dict)
                          (instantiate (cdr skeleton) dict)))))
    #+END_SRC

    The general case is our usual tree recursion: it first
    instantiates the =car=, then =cons=' that with the instantiated
    =cdr=. The depth-first search ends if the leaf is atomic, as
    usual.

    The interesting bit is what we do when we want to evaluate a
    skeleton of the =(:)= form (predicate =skeleton-evaluation?=). In
    this case, we call a procedure =evaluate=, to which we pass the
    expression to be evaluated (the =cadr=, really, since we don't
    need the =:=).

    Now, =evaluate= works in a special way we'll see later, so take on
    faith that the following =evaluate= function does its job of
    instantiation the way we want it to:

    #+NAME: rule-evaluate
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (evaluation-expression evaluation) (cadr evaluation))

      (define (evaluate form dict)
        (if (atom? form)
            (lookup form dict)
            (apply (eval (lookup (car form) dict)
                         user-initial-environment)
                   (map (lambda (v) (lookup v dict))
                        (cdr form)))))
    #+END_SRC

*** GIGO Simplifier

    The GIGO (garbage in, garbage out)[fn:7] simplifier is implemented
    by stringing together the matcher, the instantiator, and the list
    of rules we are given as an input. We write it in lexically scoped
    style, because the procedures within it are merely helpers.

    #+NAME: rule-simplifier
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (simplifier the-rules)
        (define (simplify-expression expression)
          (try-rules
           (if (compound? expression)
               (map simplify-expression expression)
               expression)))
        (define (try-rules expression)
          (define (scan rules)
            (if (null? rules)
                expression
                (let ((dict (match (pattern (car rules))
                              expression
                              (make-empty-dict))))
                  (if (eq? dict 'failed)
                      (scan (cdr rules))
                      (simplify-expression (instantiate
                                               (skeleton (car rules))
                                               dict))))))
        (scan the-rules))
        simplify-expression)
    #+END_SRC

    Okay, there's a fair amount to break down here.
    - =simplify-expression= tries /all/ the rules on every node in the
      given expression tree. It does this using our (by now) standard
      depth first tree recursion. In this case, the leaf is an atomic
      expression. The general case is when the expression is compound,
      in which case we try to simplify the =car=. If this doesn't
      work, we try the =cdr=, recursively. This fulfils our objective
      of trying all rules on all nodes. Note that instead of doing the
      recursion explicitly, we use =map=. This doesn't make a
      difference, it is merely somewhat easier to write.
    - =try-rules= accepts an expression as an input, and scans the
      input list of rules, applying each in turn using =scan=.
    - =scan= takes the pattern of the first rule in the list and tries
      to match it to the expression. If it succeeds, we instantiate
      the skeleton of this rule with the values from the dictionary.
      On the other hand, if the =match= failed, we simply try the rest
      of the rules (=cdr=).
    - Finally, =simplifier= returns the =simplify-expression=
      procedure, which can apply =the-rules= to any input expression.
      Note that this is what the desired behaviour is ([[Desired
      Behaviour]]).

