video_notes/index.html


<div id="outline-container-orgd0c41f8" class="outline-4">
<h4 id="orgd0c41f8"><span class="section-number-4">8.3.2</span> Instantiator</h4>
<div class="outline-text-4" id="text-8-3-2">
<p>
Recall that instantiate must take accept the input of a skeleton
and a dictionary, traverse the skeleton tree, and replace rule
variables for expression values according to the dictionary. That
is, given the tree:
</p>

<p>
And the dictionary <code>(x: 3, y: 4)</code>, it should produce the tree:
</p>

<p>
This is a fairly simple procedure to write:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org9273615"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">instantiate</span> skeleton dict<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">cond</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>atom? skeleton<span style="color: #da8548;">)</span> skeleton<span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>skeleton-evaluation? skeleton<span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span>evaluate <span style="color: #b751b6;">(</span>evaluation-expression skeleton<span style="color: #b751b6;">)</span>
                   dict<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span><span style="color: #e45649;">else</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">instantiate</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">car</span> skeleton<span style="color: #986801;">)</span> dict<span style="color: #b751b6;">)</span>
                    <span style="color: #b751b6;">(</span><span style="color: #a626a4;">instantiate</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">cdr</span> skeleton<span style="color: #986801;">)</span> dict<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
The general case is our usual tree recursion: it first
instantiates the <code>car</code>, then <code>cons</code>&rsquo; that with the instantiated
<code>cdr</code>. The depth-first search ends if the leaf is atomic, as
usual.
</p>

<p>
The interesting bit is what we do when we want to evaluate a
skeleton of the <code>(:)</code> form (predicate <code>skeleton-evaluation?</code>). In
this case, we call a procedure <code>evaluate</code>, to which we pass the
expression to be evaluated (the <code>cadr</code>, really, since we don&rsquo;t
need the <code>:</code>).
</p>

<p>
Now, <code>evaluate</code> works in a special way we&rsquo;ll see later, so take on
faith that the following <code>evaluate</code> function does its job of
instantiation the way we want it to:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orgc8ea9bf"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">evaluation-expression</span> evaluation<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cadr</span> evaluation<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">evaluate</span> form dict<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span>atom? form<span style="color: #50a14f;">)</span>
      <span style="color: #50a14f;">(</span>lookup form dict<span style="color: #50a14f;">)</span>
      <span style="color: #50a14f;">(</span><span style="color: #e45649;">apply</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">eval</span> <span style="color: #b751b6;">(</span>lookup <span style="color: #986801;">(</span><span style="color: #a626a4;">car</span> form<span style="color: #986801;">)</span> dict<span style="color: #b751b6;">)</span>
                   user-initial-environment<span style="color: #da8548;">)</span>
             <span style="color: #da8548;">(</span><span style="color: #a626a4;">map</span> <span style="color: #b751b6;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #986801;">(</span>v<span style="color: #986801;">)</span> <span style="color: #986801;">(</span>lookup v dict<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span>
                  <span style="color: #b751b6;">(</span><span style="color: #a626a4;">cdr</span> form<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org718f9fb" class="outline-4">
<h4 id="org718f9fb"><span class="section-number-4">8.3.3</span> GIGO Simplifier</h4>
<div class="outline-text-4" id="text-8-3-3">
<p>
The GIGO (garbage in, garbage out)<sup><a id="fnr.7" class="footref" href="#fn.7">7</a></sup> simplifier is implemented
by stringing together the matcher, the instantiator, and the list
of rules we are given as an input. We write it in lexically scoped
style, because the procedures within it are merely helpers.
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org4dc7a15"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">simplifier</span> the-rules<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">define</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">simplify-expression</span> expression<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span>try-rules
     <span style="color: #da8548;">(</span><span style="color: #e45649;">if</span> <span style="color: #b751b6;">(</span>compound? expression<span style="color: #b751b6;">)</span>
         <span style="color: #b751b6;">(</span><span style="color: #a626a4;">map</span> simplify-expression expression<span style="color: #b751b6;">)</span>
         expression<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">define</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">try-rules</span> expression<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">define</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">scan</span> rules<span style="color: #da8548;">)</span>
      <span style="color: #da8548;">(</span><span style="color: #e45649;">if</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">null?</span> rules<span style="color: #b751b6;">)</span>
          expression
          <span style="color: #b751b6;">(</span><span style="color: #e45649;">let</span> <span style="color: #986801;">(</span><span style="color: #4db5bd;">(</span><span style="color: #6a1868;">dict</span> <span style="color: #80a880;">(</span><span style="color: #a626a4;">match</span> <span style="color: #887070;">(</span>pattern <span style="color: #4078f2;">(</span><span style="color: #a626a4;">car</span> rules<span style="color: #4078f2;">)</span><span style="color: #887070;">)</span>
                        expression
                        <span style="color: #887070;">(</span>make-empty-dict<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #4db5bd;">)</span><span style="color: #986801;">)</span>
            <span style="color: #986801;">(</span><span style="color: #e45649;">if</span> <span style="color: #4db5bd;">(</span><span style="color: #a626a4;">eq?</span> dict <span style="color: #2e8b57;">'failed</span><span style="color: #4db5bd;">)</span>
                <span style="color: #4db5bd;">(</span>scan <span style="color: #80a880;">(</span><span style="color: #a626a4;">cdr</span> rules<span style="color: #80a880;">)</span><span style="color: #4db5bd;">)</span>
                <span style="color: #4db5bd;">(</span>simplify-expression <span style="color: #80a880;">(</span><span style="color: #a626a4;">instantiate</span>
                                         <span style="color: #887070;">(</span>skeleton <span style="color: #4078f2;">(</span><span style="color: #a626a4;">car</span> rules<span style="color: #4078f2;">)</span><span style="color: #887070;">)</span>
                                         dict<span style="color: #80a880;">)</span><span style="color: #4db5bd;">)</span><span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
  <span style="color: #50a14f;">(</span>scan the-rules<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span>
  simplify-expression<span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Okay, there&rsquo;s a fair amount to break down here.
</p>
<ul class="org-ul">
<li><code>simplify-expression</code> tries <i>all</i> the rules on every node in the
given expression tree. It does this using our (by now) standard
depth first tree recursion. In this case, the leaf is an atomic
expression. The general case is when the expression is compound,
in which case we try to simplify the <code>car</code>. If this doesn&rsquo;t
work, we try the <code>cdr</code>, recursively. This fulfils our objective
of trying all rules on all nodes. Note that instead of doing the
recursion explicitly, we use <code>map</code>. This doesn&rsquo;t make a
difference, it is merely somewhat easier to write.</li>
<li><code>try-rules</code> accepts an expression as an input, and scans the
input list of rules, applying each in turn using <code>scan</code>.</li>
<li><code>scan</code> takes the pattern of the first rule in the list and tries
to match it to the expression. If it succeeds, we instantiate
the skeleton of this rule with the values from the dictionary.
On the other hand, if the <code>match</code> failed, we simply try the rest
of the rules (<code>cdr</code>).</li>
<li>Finally, <code>simplifier</code> returns the <code>simplify-expression</code>
procedure, which can apply <code>the-rules</code> to any input expression.
Note that this is what the desired behaviour is (<a href="#orge7381df">8.2</a>).</li>
</ul>
</div>
</div>
