video_notes/video_notes.org
*** Dictionary Implementation
    The actual dictionary implementation isn't of much interest to us,
    since it has much more to do with Lisp primitives we'll study
    later than our program.

    #+NAME: rule-dict
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (make-empty-dict) '())

      (define (extend-dict pat dat dictionary)
        (let ((vname (variable-name pat)))
          (let ((v (assq vname dictionary)))
            (cond ((not v)
                   (cons (list vname dat) dictionary))
                  ((eq? (cadr v) dat) dictionary)
                  (else 'failed)))))

      (define (lookup var dictionary)
        (let ((v (assq var dictionary)))
          (if (null? v)
              var
              (cadr v))))
    #+END_SRC

*** Predicates
    Finally, we must implement the predicates we've used throughout.
    These are simple to implement and self-explanatory:

    #+NAME: rule-preds
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (compound? exp) (pair? exp))
      (define (constant? exp) (number? exp))
      (define (variable? exp) (atom? exp))
      (define (pattern rule) (car rule))
      (define (skeleton rule) (cadr rule))

      (define (arbitrary-constant? pat)
        (if (pair? pat) (eq? (car pat) '?c) false))

      (define (arbitrary-expression? pat)
        (if (pair? pat) (eq? (car pat) '?) false))

      (define (arbitrary-variable? pat)
        (if (pair? pat) (eq? (car pat) '?v) false))

      (define (variable-name pat) (cadr pat))

      (define (skeleton-evaluation? pat)
        (if (pair? pat) (eq? (car pat) ':) false))
    #+END_SRC

    #+NAME: rule-env-fix
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports none
      (define user-initial-environment (scheme-report-environment 5))
      (define (atom? x) (not (pair? x)))
    #+END_SRC


** Usage

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
     <<rule-env-fix>>
     <<rule-deriv-rules>>
     <<rule-match>>
     <<rule-evaluate>>
     <<rule-instantiate>>
     <<rule-simplifier>>
     <<rule-dict>>
     <<rule-preds>>
     (define dsimp
       (simplifier deriv-rules))

     (dsimp '(dd (* x x) x))
   #+END_SRC

   #+RESULTS:
   : (+ (* x 1) (* x 1))

   Excellent --- it works. Note that there is no algebraic
   simplification. Witness now the power of abstraction --- all we
   really have to do is define some rules for algebraic
   simplification, and pass the result of =dsimp= to =algsimp= to get
   a clean expression.

