video_notes/index.html

<div id="outline-container-orge2589df" class="outline-4">
<h4 id="orge2589df"><span class="section-number-4">8.3.4</span> Dictionary Implementation</h4>
<div class="outline-text-4" id="text-8-3-4">
<p>
The actual dictionary implementation isn&rsquo;t of much interest to us,
since it has much more to do with Lisp primitives we&rsquo;ll study
later than our program.
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org5d53125"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">make-empty-dict</span><span style="color: #a626a4;">)</span> '<span style="color: #a626a4;">()</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">extend-dict</span> pat dat dictionary<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">let</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #6a1868;">vname</span> <span style="color: #b751b6;">(</span>variable-name pat<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">let</span> <span style="color: #da8548;">(</span><span style="color: #b751b6;">(</span><span style="color: #6a1868;">v</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">assq</span> vname dictionary<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
      <span style="color: #da8548;">(</span><span style="color: #e45649;">cond</span> <span style="color: #b751b6;">(</span><span style="color: #986801;">(</span><span style="color: #a626a4;">not</span> v<span style="color: #986801;">)</span>
             <span style="color: #986801;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #4db5bd;">(</span><span style="color: #a626a4;">list</span> vname dat<span style="color: #4db5bd;">)</span> dictionary<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span>
            <span style="color: #b751b6;">(</span><span style="color: #986801;">(</span><span style="color: #a626a4;">eq?</span> <span style="color: #4db5bd;">(</span><span style="color: #a626a4;">cadr</span> v<span style="color: #4db5bd;">)</span> dat<span style="color: #986801;">)</span> dictionary<span style="color: #b751b6;">)</span>
            <span style="color: #b751b6;">(</span><span style="color: #e45649;">else</span> <span style="color: #2e8b57;">'failed</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">lookup</span> var dictionary<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">let</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #6a1868;">v</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">assq</span> var dictionary<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">if</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">null?</span> v<span style="color: #da8548;">)</span>
        var
        <span style="color: #da8548;">(</span><span style="color: #a626a4;">cadr</span> v<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb5de8fc" class="outline-4">
<h4 id="orgb5de8fc"><span class="section-number-4">8.3.5</span> Predicates</h4>
<div class="outline-text-4" id="text-8-3-5">
<p>
Finally, we must implement the predicates we&rsquo;ve used throughout.
These are simple to implement and self-explanatory:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org9d016b9"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">compound?</span> <span style="color: #a626a4;">exp</span><span style="color: #a626a4;">)</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">pair?</span> <span style="color: #a626a4;">exp</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">constant?</span> <span style="color: #a626a4;">exp</span><span style="color: #a626a4;">)</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">number?</span> <span style="color: #a626a4;">exp</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">variable?</span> <span style="color: #a626a4;">exp</span><span style="color: #a626a4;">)</span> <span style="color: #a626a4;">(</span>atom? <span style="color: #a626a4;">exp</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">pattern</span> rule<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">car</span> rule<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">skeleton</span> rule<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cadr</span> rule<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">arbitrary-constant?</span> pat<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">pair?</span> pat<span style="color: #50a14f;">)</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">eq?</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">car</span> pat<span style="color: #da8548;">)</span> <span style="color: #2e8b57;">'?c</span><span style="color: #50a14f;">)</span> <span style="color: #a626a4;">false</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">arbitrary-expression?</span> pat<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">pair?</span> pat<span style="color: #50a14f;">)</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">eq?</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">car</span> pat<span style="color: #da8548;">)</span> <span style="color: #2e8b57;">'?</span><span style="color: #50a14f;">)</span> <span style="color: #a626a4;">false</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">arbitrary-variable?</span> pat<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">pair?</span> pat<span style="color: #50a14f;">)</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">eq?</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">car</span> pat<span style="color: #da8548;">)</span> <span style="color: #2e8b57;">'?v</span><span style="color: #50a14f;">)</span> <span style="color: #a626a4;">false</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">variable-name</span> pat<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cadr</span> pat<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">skeleton-evaluation?</span> pat<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">pair?</span> pat<span style="color: #50a14f;">)</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">eq?</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">car</span> pat<span style="color: #da8548;">)</span> <span style="color: #2e8b57;">':</span><span style="color: #50a14f;">)</span> <span style="color: #a626a4;">false</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd9cc50f" class="outline-3">
<h3 id="orgd9cc50f"><span class="section-number-3">8.4</span> Usage</h3>
<div class="outline-text-3" id="text-8-4">
<div class="org-src-container">
<pre class="src src-racket">







<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">dsimp</span>
  <span style="color: #a626a4;">(</span>simplifier deriv-rules<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>dsimp '<span style="color: #a626a4;">(</span>dd <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> x x<span style="color: #50a14f;">)</span> x<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
(+ (* x 1) (* x 1))
</pre>


<p>
Excellent &#x2014; it works. Note that there is no algebraic
simplification. Witness now the power of abstraction &#x2014; all we
really have to do is define some rules for algebraic
simplification, and pass the result of <code>dsimp</code> to <code>algsimp</code> to get
a clean expression.
</p>
</div>
