video_notes/video_notes.org
*** Algebraic Simplification
    Consider the rule set:

    #+NAME: rule-alg-rules
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define algebra-rules
        '(
          ( ((? op) (?c c1) (?c c2))                (: (op c1 c2))                )
          ( ((? op) (?  e ) (?c c ))                ((: op) (: c) (: e))          )
          ( (+ 0 (? e))                             (: e)                         )
          ( (* 1 (? e))                             (: e)                         )
          ( (* 0 (? e))                             0                             )
          ( (* (?c c1) (* (?c c2) (? e )))          (* (: (* c1 c2)) (: e))       )
          ( (* (?  e1) (* (?c c ) (? e2)))          (* (: c ) (* (: e1) (: e2)))  )
          ( (* (* (? e1) (? e2)) (? e3))            (* (: e1) (* (: e2) (: e3)))  )
          ( (+ (?c c1) (+ (?c c2) (? e )))          (+ (: (+ c1 c2)) (: e))       )
          ( (+ (?  e1) (+ (?c c ) (? e2)))          (+ (: c ) (+ (: e1) (: e2)))  )
          ( (+ (+ (? e1) (? e2)) (? e3))            (+ (: e1) (+ (: e2) (: e3)))  )
          ( (+ (* (?c c1) (? e)) (* (?c c2) (? e))) (* (: (+ c1 c2)) (: e))       )
          ( (* (? e1) (+ (? e2) (? e3)))            (+ (* (: e1) (: e2)))         )
          ))
    #+END_SRC

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
     <<rule-env-fix>>
     <<rule-deriv-rules>>
     <<rule-alg-rules>>
     <<rule-match>>
     <<rule-evaluate>>
     <<rule-instantiate>>
     <<rule-simplifier>>
     <<rule-dict>>
     <<rule-preds>>
     (define dsimp
       (simplifier deriv-rules))

     (define algsimp
       (simplifier algebra-rules))

     (define (derivative x)
       (algsimp (dsimp x)))

     (derivative '(dd (* x x) x))
     (derivative '(dd (+ (+ x (* x 5)) (* x x)) x))
   #+END_SRC

   #+RESULTS:
   : (+ x x)
   : (+ 6 (+ x x))

   We now have a complete pattern matching and replacement language at
   our disposal, and we've tested it out on the rules of
   differentiation and algebraic simplification.

   # add pre-sec on tree recursion


