video_notes/index.html

<div id="outline-container-org9332c0d" class="outline-4">
<h4 id="org9332c0d"><span class="section-number-4">8.4.1</span> Algebraic Simplification</h4>
<div class="outline-text-4" id="text-8-4-1">
<p>
Consider the rule set:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org34ce963"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">algebra-rules</span>
  '<span style="color: #a626a4;">(</span>
    <span style="color: #50a14f;">(</span> <span style="color: #da8548;">(</span><span style="color: #b751b6;">(</span>? op<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span>?c c1<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span>?c c2<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>                <span style="color: #da8548;">(</span><span style="color: #a626a4;">:</span> <span style="color: #b751b6;">(</span>op c1 c2<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>                <span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span> <span style="color: #da8548;">(</span><span style="color: #b751b6;">(</span>? op<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span>?  e <span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span>?c c <span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>                <span style="color: #da8548;">(</span><span style="color: #b751b6;">(</span><span style="color: #a626a4;">:</span> op<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">:</span> c<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">:</span> e<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>          <span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">+</span> <span style="color: #2e8b57;">0</span> <span style="color: #b751b6;">(</span>? e<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>                             <span style="color: #da8548;">(</span><span style="color: #a626a4;">:</span> e<span style="color: #da8548;">)</span>                         <span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> <span style="color: #2e8b57;">1</span> <span style="color: #b751b6;">(</span>? e<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>                             <span style="color: #da8548;">(</span><span style="color: #a626a4;">:</span> e<span style="color: #da8548;">)</span>                         <span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> <span style="color: #2e8b57;">0</span> <span style="color: #b751b6;">(</span>? e<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>                             <span style="color: #2e8b57;">0</span>                             <span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> <span style="color: #b751b6;">(</span>?c c1<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">*</span> <span style="color: #986801;">(</span>?c c2<span style="color: #986801;">)</span> <span style="color: #986801;">(</span>? e <span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>          <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">:</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">*</span> c1 c2<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">:</span> e<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>       <span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> <span style="color: #b751b6;">(</span>?  e1<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">*</span> <span style="color: #986801;">(</span>?c c <span style="color: #986801;">)</span> <span style="color: #986801;">(</span>? e2<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>          <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">:</span> c <span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">*</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">:</span> e1<span style="color: #986801;">)</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">:</span> e2<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>  <span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">*</span> <span style="color: #986801;">(</span>? e1<span style="color: #986801;">)</span> <span style="color: #986801;">(</span>? e2<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span>? e3<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>            <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">:</span> e1<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">*</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">:</span> e2<span style="color: #986801;">)</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">:</span> e3<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>  <span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">+</span> <span style="color: #b751b6;">(</span>?c c1<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">+</span> <span style="color: #986801;">(</span>?c c2<span style="color: #986801;">)</span> <span style="color: #986801;">(</span>? e <span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>          <span style="color: #da8548;">(</span><span style="color: #a626a4;">+</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">:</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">+</span> c1 c2<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">:</span> e<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>       <span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">+</span> <span style="color: #b751b6;">(</span>?  e1<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">+</span> <span style="color: #986801;">(</span>?c c <span style="color: #986801;">)</span> <span style="color: #986801;">(</span>? e2<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>          <span style="color: #da8548;">(</span><span style="color: #a626a4;">+</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">:</span> c <span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">+</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">:</span> e1<span style="color: #986801;">)</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">:</span> e2<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>  <span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">+</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">+</span> <span style="color: #986801;">(</span>? e1<span style="color: #986801;">)</span> <span style="color: #986801;">(</span>? e2<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span>? e3<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>            <span style="color: #da8548;">(</span><span style="color: #a626a4;">+</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">:</span> e1<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">+</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">:</span> e2<span style="color: #986801;">)</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">:</span> e3<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>  <span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">+</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">*</span> <span style="color: #986801;">(</span>?c c1<span style="color: #986801;">)</span> <span style="color: #986801;">(</span>? e<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">*</span> <span style="color: #986801;">(</span>?c c2<span style="color: #986801;">)</span> <span style="color: #986801;">(</span>? e<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">:</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">+</span> c1 c2<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">:</span> e<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>       <span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> <span style="color: #b751b6;">(</span>? e1<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">+</span> <span style="color: #986801;">(</span>? e2<span style="color: #986801;">)</span> <span style="color: #986801;">(</span>? e3<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>            <span style="color: #da8548;">(</span><span style="color: #a626a4;">+</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">*</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">:</span> e1<span style="color: #986801;">)</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">:</span> e2<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>         <span style="color: #50a14f;">)</span>
    <span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket">








<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">dsimp</span>
  <span style="color: #a626a4;">(</span>simplifier deriv-rules<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">algsimp</span>
  <span style="color: #a626a4;">(</span>simplifier algebra-rules<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">derivative</span> x<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>algsimp <span style="color: #50a14f;">(</span>dsimp x<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>derivative '<span style="color: #a626a4;">(</span>dd <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> x x<span style="color: #50a14f;">)</span> x<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>derivative '<span style="color: #a626a4;">(</span>dd <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">+</span> x <span style="color: #b751b6;">(</span><span style="color: #a626a4;">*</span> x <span style="color: #2e8b57;">5</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> x x<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span> x<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
(+ x x)
(+ 6 (+ x x))
</pre>


<p>
We now have a complete pattern matching and replacement language at
our disposal, and we&rsquo;ve tested it out on the rules of
differentiation and algebraic simplification.
</p>
</div>
</div>
</div>
</div>
