video_notes/video_notes.org
* Lecture 4B: Generic Operators

  We've seen that data abstraction separates the use of data objects
  from its representation. Unfortunately, this is not sufficient for
  complex systems.

  Consider a situation where there are multiple representation
  designers and they cannot agree on a single uniform representation.
  This makes the use complicated, since the user has to use different
  operators for different representations of the same object, creating
  clutter.

  One of the ways to solve such a problem is to enforce a standard for
  representations, but this is often impossible. Alternately, we could
  make a generic set of operators for the user that work on any kind
  of representation correctly and without complaint. Diagrammatically:

  #+LATEX: \begin{center}
  #+LATEX: \begin{tabular}{|c|c|c|c|}
  #+LATEX: \hline
  #+LATEX: \multicolumn{4}{|c|}{Generic Operators}\\
  #+LATEX: \hline
  #+LATEX: &&&\\
  #+LATEX: &&&\\
  #+LATEX: &&&\\
  #+LATEX: R1 & R2 & R3 & $\dots$\\
  #+LATEX: &&&\\
  #+LATEX: &&&\\
  #+LATEX: &&&\\
  #+LATEX: \hline
  #+LATEX: \end{tabular}
  #+LATEX: \end{center}

  Moreover, note that it won't be too hard to add another
  representation R4, because all it needs to do is fit in the
  generic operators architecture.

  Throughout the rest of this lecture, we discuss the application of
  various generic operator techniques on an extended example: first
  representing complex numbers in rectangular and polar form, and then
  expanding this to include the entire real number system.

** Dispatch on Type

*** On Complex Numbers
    Complex numbers are represented in the complex plane as:

    #+LATEX: \begin{center}
    #+LATEX: \begin{tikzpicture}
    #+LATEX: \begin{scope}[every node/.style={fill=white,inner sep=2pt}]
    #+LATEX: \draw (0,-4)--(0,4) node[above] {$\Im$} (-4,0)--(4,0) node[right] {$\Re$};
    #+LATEX: \draw[dashed] (0,0) circle (3);
    #+LATEX: \coordinate (a) at (40:3);
    #+LATEX: \coordinate (b) at (3,0);
    #+LATEX: \coordinate (o) at (0,0);
    #+LATEX: \coordinate (h) at (2.3,0);
    #+LATEX: \coordinate (v) at (0,1.93);
    #+LATEX: \draw (a) node[above right] {$z=|z|e^{i\theta} = x+iy$};
    #+LATEX: \draw (b) node[below right] {$|z|$};
    #+LATEX: \draw (.1,1.5)--(0,1.5) node[left] {$i$};
    #+LATEX: \draw (1.5,.1)--(1.5,0) node[below] {$1$};
    #+LATEX: \draw (0,0)--(a);
    #+LATEX: \draw [dashed] (a)--(h) node[below right] {$x$};
    #+LATEX: \draw [dashed] (a)--(v) node[above left] {$y$};
    #+LATEX: \end{scope}
    #+LATEX: \pic[draw,"$\theta$",angle radius=0.8cm,angle eccentricity=1.3] {angle=b--o--a};
    #+LATEX: \fill[black] (a) circle (2pt) (b) circle (2pt) (h) circle (2pt) (v) circle (2pt);
    #+LATEX: \end{tikzpicture}
    #+LATEX: \end{center}

    It should be clear that for a complex number $z=|z|e^{i\theta}=x+iy$:
    $$|z|=\sqrt{x^{2}+y^{2}}$$
    $$\theta = \arctan{\frac{y}{x}}$$
    $$x=|z|\cos{\theta}$$
    $$y=|z|\sin{\theta}$$

    Let us say we want to add, subtract, multiply, and divide complex
    numbers. The most natural way to add is using rectangular form:

    $$\Re{(z_1+z_2)} = \Re{(z_1)} + \Re{(z_2)}$$
    $$\Im{(z_1+z_2)} = \Im{(z_1)} + \Im{(z_2)}$$

    However, the most natural way to multiply is using polar form:

    $$|z_1z_2|=|z_1||z_2|$$
    $$\theta{(z_1z_2)} = \theta{(z_1)}+\theta{(z_2)}$$

*** Arithmetic Implementation

    Let's implement the four basic arithmetic operations. As in the
    case of rational numbers, we assume the availability of the
    constructors and selectors:

    #+begin_example
    (make-rect x y)
    (make-pol magnitude theta)
    (real z)
    (img z)
    (mag z)
    (ang z)
    #+end_example

    Then,

    #+NAME: complex-arith
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (+c z1 z2)
        (make-rect
         (+ (real z1) (real z2))
         (+ (img z1) (img z2))))

      (define (-c z1 z2)
        (make-rect
         (- (real z1) (real z2))
         (- (img z1) (img z2))))

      (define (*c z1 z2)
        (make-pol
         (* (mag z1) (mag z2))
         (+ (ang z1) (ang z2))))

      (define (/c z1 z2)
        (make-pol
         (/ (mag z1) (mag z2))
         (- (ang z1) (ang z2))))
    #+END_SRC

*** George's Representation

    George loves the rectangular form of complex numbers. He therefore
    implements the constructors and selectors in the following way:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (make-rect x y)
        (cons x y))

      (define (real z)
        (car z))

      (define (img z)
        (cdr z))

      (define (make-pol r a)
        (cons
         (* r (cos a))
         (* r (sin a))))

      (define (mag z)
        (sqrt (+ (square (car z))
                 (square (cdr z)))))

      (define (ang z)
        (atan (cdr z) (car z)))
    #+END_SRC

