video_notes/index.html


<div id="outline-container-org347593e" class="outline-2">
<h2 id="org347593e"><span class="section-number-2">9</span> Lecture 4B: Generic Operators</h2>
<div class="outline-text-2" id="text-9">
<p>
We&rsquo;ve seen that data abstraction separates the use of data objects
from its representation. Unfortunately, this is not sufficient for
complex systems.
</p>

<p>
Consider a situation where there are multiple representation
designers and they cannot agree on a single uniform representation.
This makes the use complicated, since the user has to use different
operators for different representations of the same object, creating
clutter.
</p>

<p>
One of the ways to solve such a problem is to enforce a standard for
representations, but this is often impossible. Alternately, we could
make a generic set of operators for the user that work on any kind
of representation correctly and without complaint. Diagrammatically:
</p>

<p>
Moreover, note that it won&rsquo;t be too hard to add another
representation R4, because all it needs to do is fit in the
generic operators architecture.
</p>

<p>
Throughout the rest of this lecture, we discuss the application of
various generic operator techniques on an extended example: first
representing complex numbers in rectangular and polar form, and then
expanding this to include the entire real number system.
</p>
</div>

<div id="outline-container-orgf99fe15" class="outline-3">
<h3 id="orgf99fe15"><span class="section-number-3">9.1</span> Dispatch on Type</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-orga40476e" class="outline-4">
<h4 id="orga40476e"><span class="section-number-4">9.1.1</span> On Complex Numbers</h4>
<div class="outline-text-4" id="text-9-1-1">
<p>
Complex numbers are represented in the complex plane as:
</p>

<p>
It should be clear that for a complex number \(z=|z|e^{i\theta}=x+iy\):
\[|z|=\sqrt{x^{2}+y^{2}}\]
\[\theta = \arctan{\frac{y}{x}}\]
\[x=|z|\cos{\theta}\]
\[y=|z|\sin{\theta}\]
</p>

<p>
Let us say we want to add, subtract, multiply, and divide complex
numbers. The most natural way to add is using rectangular form:
</p>

<p>
\[\Re{(z_1+z_2)} = \Re{(z_1)} + \Re{(z_2)}\]
\[\Im{(z_1+z_2)} = \Im{(z_1)} + \Im{(z_2)}\]
</p>

<p>
However, the most natural way to multiply is using polar form:
</p>

<p>
\[|z_1z_2|=|z_1||z_2|\]
\[\theta{(z_1z_2)} = \theta{(z_1)}+\theta{(z_2)}\]
</p>
</div>
</div>

<div id="outline-container-org6c2da3c" class="outline-4">
<h4 id="org6c2da3c"><span class="section-number-4">9.1.2</span> Arithmetic Implementation</h4>
<div class="outline-text-4" id="text-9-1-2">
<p>
Let&rsquo;s implement the four basic arithmetic operations. As in the
case of rational numbers, we assume the availability of the
constructors and selectors:
</p>

<pre class="example">
(make-rect x y)
(make-pol magnitude theta)
(real z)
(img z)
(mag z)
(ang z)
</pre>

<p>
Then,
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orgc250ddc"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">+c</span> z1 z2<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>make-rect
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span>real z1<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>real z2<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span>img z1<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>img z2<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">-c</span> z1 z2<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>make-rect
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">-</span> <span style="color: #da8548;">(</span>real z1<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>real z2<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">-</span> <span style="color: #da8548;">(</span>img z1<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>img z2<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">*c</span> z1 z2<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>make-pol
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> <span style="color: #da8548;">(</span>mag z1<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>mag z2<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span>ang z1<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>ang z2<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">/c</span> z1 z2<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>make-pol
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">/</span> <span style="color: #da8548;">(</span>mag z1<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>mag z2<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">-</span> <span style="color: #da8548;">(</span>ang z1<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>ang z2<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd7fdfed" class="outline-4">
<h4 id="orgd7fdfed"><span class="section-number-4">9.1.3</span> George&rsquo;s Representation</h4>
<div class="outline-text-4" id="text-9-1-3">
<p>
George loves the rectangular form of complex numbers. He therefore
implements the constructors and selectors in the following way:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">make-rect</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cons</span> x y<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">real</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">car</span> z<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">img</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cdr</span> z<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">make-pol</span> r a<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cons</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> r <span style="color: #da8548;">(</span><span style="color: #a626a4;">cos</span> a<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> r <span style="color: #da8548;">(</span><span style="color: #a626a4;">sin</span> a<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">mag</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">sqrt</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span>square <span style="color: #b751b6;">(</span><span style="color: #a626a4;">car</span> z<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
           <span style="color: #da8548;">(</span>square <span style="color: #b751b6;">(</span><span style="color: #a626a4;">cdr</span> z<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">ang</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">atan</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cdr</span> z<span style="color: #50a14f;">)</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">car</span> z<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>
</div>
</div>
