video_notes/video_notes.org
*** Martha's Representation
    Martha, on the other hand, much prefers the polar representation.
    She implements the constructors and selectors as:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (make-pol r a)
        (cons r a))

      (define (mag z)
        (car z))

      (define (ang z)
        (cdr z))

      (define (real z)
        (* (car z)
           (cos (cdr z))))

      (define (img z)
        (* (car z)
           (sin (cdr z))))

      (define (make-rect x y)
        (cons
         (sqrt (square x) (square y))
         (atan y x)))
    #+END_SRC

    Naturally, George's representation is better if we want to use
    =+c= a lot, while Martha's is better if we want to use =*c= a lot.
    Often, it's impossible to choose between two equally good
    representations. The solution is to use generic selectors and
    constructors. Diagrammatically:

    #+LATEX: \begin{center}
    #+LATEX: \begin{tabular}[H]{|c|c|c|}
    #+LATEX: \hline
    #+LATEX: \multicolumn{3}{|c|}{\texttt{+c -c *c /c}}\\
    #+LATEX: \hline
    #+LATEX: \multicolumn{3}{|c|}{\texttt{make-rect make-pol mag real}}\\
    #+LATEX: \hline
    #+LATEX: &  &\\
    #+LATEX: &  &\\
    #+LATEX: &  &\\
    #+LATEX: Rectangular &  & Polar\\
    #+LATEX: &  &\\
    #+LATEX: &  &\\
    #+LATEX: &  &\\
    #+LATEX: \hline
    #+LATEX: \end{tabular}
    #+LATEX: \end{center}


