video_notes/index.html

<div id="outline-container-org1e9f668" class="outline-4">
<h4 id="org1e9f668"><span class="section-number-4">9.1.4</span> Martha&rsquo;s Representation</h4>
<div class="outline-text-4" id="text-9-1-4">
<p>
Martha, on the other hand, much prefers the polar representation.
She implements the constructors and selectors as:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">make-pol</span> r a<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cons</span> r a<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">mag</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">car</span> z<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">ang</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cdr</span> z<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">real</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">*</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">car</span> z<span style="color: #50a14f;">)</span>
     <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cos</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">cdr</span> z<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">img</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">*</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">car</span> z<span style="color: #50a14f;">)</span>
     <span style="color: #50a14f;">(</span><span style="color: #a626a4;">sin</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">cdr</span> z<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">make-rect</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cons</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">sqrt</span> <span style="color: #da8548;">(</span>square x<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>square y<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">atan</span> y x<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Naturally, George&rsquo;s representation is better if we want to use
<code>+c</code> a lot, while Martha&rsquo;s is better if we want to use <code>*c</code> a lot.
Often, it&rsquo;s impossible to choose between two equally good
representations. The solution is to use generic selectors and
constructors. Diagrammatically:
</p>
</div>
</div>
