video_notes/video_notes.org
*** Type Dispatch Manager

    One of our chief problems is that when we have a pair that's a
    complex number, we have no way of knowing whether it's rectangular
    or polar. By attaching this pair to a "type label", we can easily
    tell by reading the label which type it is, and accordingly call
    George's or Martha's procedures. Consider:

    #+NAME: type-arch
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (attach-type type contents)
        (cons type contents))

      (define (type datum)
        (car datum))

      (define (contents datum)
        (cdr datum))
    #+END_SRC

    Now, George redefines his procedures as:

    #+NAME: george-complex-procs
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (make-rect x y)
        (attach-type 'rectangular (cons x y)))

      (define (real-rectangular z)
        (car z))

      (define (img-rectangular z)
        (cdr z))

      (define (mag-rectangular z)
        (sqrt (+ (square (car z))
                 (square (cdr z)))))

      (define (ang-rectangular z)
        (atan (cdr z) (car z)))
    #+END_SRC

    Note that he changes his procedure names so that they don't
    conflict with the generic =make-rect=, =real=, and so on. The
    major change is that he rectangular complex numbers. Moreover,
    there's no need for George to have a =make-pol=, since that
    functionality is already provided by Martha, who implements her
    procedures as:

    #+NAME: martha-complex-procs
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (make-pol r a)
        (attach-type 'polar (cons r a)))

      (define (mag-polar z)
        (car z))

      (define (ang-polar z)
        (cdr z))

      (define (real-polar z)
        (* (car z)
           (cos (cdr z))))

      (define (img-polar z)
        (* (car z)
           (sin (cdr z))))
    #+END_SRC

    Now, we can implement the generic procedures as:

    #+NAME: complex-manager
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (real z)
        (cond ((rectangular? z)
               (real-rectangular (contents z)))
              ((polar? z)
               (real-polar (contents z)))))

      (define (img z)
        (cond ((rectangular? z)
               (img-rectangular (contents z)))
              ((polar? z)
               (img-polar (contents z)))))

      (define (mag z)
        (cond ((rectangular? z)
               (mag-rectangular (contents z)))
              ((polar? z)
               (mag-polar (contents z)))))

      (define (ang z)
        (cond ((rectangular? z)
               (ang-rectangular (contents z)))
              ((polar? z)
               (ang-polar (contents z)))))
    #+END_SRC

    We call procedures written this way "managers", since they decide
    whom to dispatch the data object to for processing. The predicates
    are simple label-checkers:

    #+NAME: complex-manager-preds
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (rectangular? z)
        (eq? 'rectangular (type z)))

      (define (polar? z)
        (eq? 'polar (type z)))
    #+END_SRC

