video_notes/index.html


<div id="outline-container-org93df0a7" class="outline-4">
<h4 id="org93df0a7"><span class="section-number-4">9.1.5</span> Type Dispatch Manager</h4>
<div class="outline-text-4" id="text-9-1-5">
<p>
One of our chief problems is that when we have a pair that&rsquo;s a
complex number, we have no way of knowing whether it&rsquo;s rectangular
or polar. By attaching this pair to a &ldquo;type label&rdquo;, we can easily
tell by reading the label which type it is, and accordingly call
George&rsquo;s or Martha&rsquo;s procedures. Consider:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orgdec9761"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">attach-type</span> type contents<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cons</span> type contents<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">type</span> datum<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">car</span> datum<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">contents</span> datum<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cdr</span> datum<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Now, George redefines his procedures as:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orgef7233f"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">make-rect</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>attach-type <span style="color: #2e8b57;">'rectangular</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> x y<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">real-rectangular</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">car</span> z<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">img-rectangular</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cdr</span> z<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">mag-rectangular</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">sqrt</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span>square <span style="color: #b751b6;">(</span><span style="color: #a626a4;">car</span> z<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
           <span style="color: #da8548;">(</span>square <span style="color: #b751b6;">(</span><span style="color: #a626a4;">cdr</span> z<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">ang-rectangular</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">atan</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cdr</span> z<span style="color: #50a14f;">)</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">car</span> z<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Note that he changes his procedure names so that they don&rsquo;t
conflict with the generic <code>make-rect</code>, <code>real</code>, and so on. The
major change is that he rectangular complex numbers. Moreover,
there&rsquo;s no need for George to have a <code>make-pol</code>, since that
functionality is already provided by Martha, who implements her
procedures as:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orgf318c02"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">make-pol</span> r a<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>attach-type <span style="color: #2e8b57;">'polar</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> r a<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">mag-polar</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">car</span> z<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">ang-polar</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cdr</span> z<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">real-polar</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">*</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">car</span> z<span style="color: #50a14f;">)</span>
     <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cos</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">cdr</span> z<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">img-polar</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">*</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">car</span> z<span style="color: #50a14f;">)</span>
     <span style="color: #50a14f;">(</span><span style="color: #a626a4;">sin</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">cdr</span> z<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Now, we can implement the generic procedures as:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orgf53c3d2"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">real</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">cond</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>rectangular? z<span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span>real-rectangular <span style="color: #b751b6;">(</span>contents z<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>polar? z<span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span>real-polar <span style="color: #b751b6;">(</span>contents z<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">img</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">cond</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>rectangular? z<span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span>img-rectangular <span style="color: #b751b6;">(</span>contents z<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>polar? z<span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span>img-polar <span style="color: #b751b6;">(</span>contents z<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">mag</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">cond</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>rectangular? z<span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span>mag-rectangular <span style="color: #b751b6;">(</span>contents z<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>polar? z<span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span>mag-polar <span style="color: #b751b6;">(</span>contents z<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">ang</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">cond</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>rectangular? z<span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span>ang-rectangular <span style="color: #b751b6;">(</span>contents z<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>polar? z<span style="color: #da8548;">)</span>
         <span style="color: #da8548;">(</span>ang-polar <span style="color: #b751b6;">(</span>contents z<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
We call procedures written this way &ldquo;managers&rdquo;, since they decide
whom to dispatch the data object to for processing. The predicates
are simple label-checkers:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org87d177f"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">rectangular?</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">eq?</span> <span style="color: #2e8b57;">'rectangular</span> <span style="color: #50a14f;">(</span>type z<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">polar?</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">eq?</span> <span style="color: #2e8b57;">'polar</span> <span style="color: #50a14f;">(</span>type z<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>
</div>
</div>
