video_notes/video_notes.org
*** Usage

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<square>>
      <<type-arch>>
      <<george-complex-procs>>
      <<martha-complex-procs>>
      <<complex-manager-preds>>
      <<complex-manager>>
      <<complex-arith>>
      (define a (make-rect 2 3))
      (define b (make-pol 5 (tan (/ 3 4))))

      (define result (+c a b))
      (real result)
      (img result)

      (car a)
      (car b)
      (car result)
      (cadr result)
      (cddr result)
    #+END_SRC

    #+RESULTS:
    : 4.98276733430013
    : 7.012866684732013
    : rectangular
    : polar
    : rectangular
    : 4.98276733430013
    : 7.012866684732013

    Note that complex numbers are now a pair of a label and a pair.

*** Review
    There are two major issues with this way of engineering the
    complex number system ("dispatch on type"):
    - George and Martha having to change their procedure names to
      prevent namespace violation. This issue, however, can be fixed
      by methods explored in later lectures.
    - A larger issue is that when an additional representation is
      added (say, Harry's), the manager's =cond= has to be changed.
      This isn't ideal, since it's a set of centralized procedures
      which all of George, Martha, and Harry have to be able to edit.
      This centralization and causes a bottleneck, and is annoying,
      especially because all the manager does, really, is a
      conditional dispatch --- it's a bureaucrat.

    Our next efforts will be directed at eliminating the manager
    procedures.

** Data-Directed Programming

   Abstractly, what does the manager do? It acts as a lookup table, of
   shape and form:

   #+ATTR_LATEX: :booktabs t
   | Generic | Polar        | Rectangular        |
   |---------+--------------+--------------------|
   | =real=  | =real-polar= | =real-rectangular= |
   | =img=   | =img-polar=  | =img-rectangular=  |
   | =mag=   | =mag-polar=  | =mag-rectangular=  |
   | =ang=   | =ang-polar=  | =ang-rectangular=  |

   We could decentralize the manager by simply constructing a globally
   accessible table like this, and letting George and Martha put their
   procedures into the correct place in the table. They must each set
   up their own columns, then they can continue to define their own
   "versions" of all the generic operators. They do this using two
   procedures:

   #+begin_example
   (put KEY1 KEY2 value)
   (get KEY1 KEY2)
   #+end_example

   =get= returns the value we'd =put= in the table. The precise way
   this table is represented is not of interest to us, and we defer
   its implementation to a later lecture.

   #+NAME: complex-ddp-tbl
   #+BEGIN_SRC racket :lang sicp :eval no-export :exports none
     (define (make-table)
       (let ((local-table (list '*table*)))
         (define (lookup key-1 key-2)
           (let ((subtable
                  (assoc key-1 (cdr local-table))))
             (if subtable
                 (let ((record
                        (assoc key-2 (cdr subtable))))
                   (if record (cdr record) false))
                 false)))
         (define (insert! key-1 key-2 value)
           (let ((subtable
                  (assoc key-1 (cdr local-table))))
             (if subtable
                 (let ((record
                        (assoc key-2 (cdr subtable))))
                   (if record
                       (set-cdr! record value)
                       (set-cdr! subtable
                                 (cons (cons key-2 value)
                                       (cdr subtable)))))
                 (set-cdr! local-table
                           (cons (list key-1 (cons key-2 value))
                                 (cdr local-table))))))
         (define (dispatch m)
           (cond ((eq? m 'lookup-proc) lookup)
                 ((eq? m 'insert-proc!) insert!)
                 (else (error "Unknown operation: TABLE" m))))
         dispatch))

     (define operation-table (make-table))
     (define get (operation-table 'lookup-proc))
     (define put (operation-table 'insert-proc!))
   #+END_SRC


*** Putting George's Procedures

    #+NAME: complex-george-puts
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (put 'rectangular 'real real-rectangular)
      (put 'rectangular 'img img-rectangular)
      (put 'rectangular 'mag mag-rectangular)
      (put 'rectangular 'ang ang-rectangular)
    #+END_SRC

    Note carefully that the value inserted into the table cell is
    actually a /lambda/, it's not a symbol. This means that the table
    literally contains within it the procedures, not their names.
    Technically, George could have given the third argument of =put=
    as a \lambda directly instead of first defining it. This is
    desirable, since George can safely debug and change his
    procedures, and only "commit" them when he puts them in the table.
    Moreover, it greatly simplifies lookups: to apply a procedure, one
    must only grab the correct cell of the table.


*** Putting Martha's Procedures
    Similarly:
    #+NAME: complex-martha-puts
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (put 'polar 'real real-polar)
      (put 'polar 'img img-polar)
      (put 'polar 'mag mag-polar)
      (put 'polar 'ang ang-polar)
    #+END_SRC

    Now, if Harry wants to add his procedures, he doesn't have to do
    anything except =put= them in the table.

