video_notes/index.html

<div id="outline-container-orga5cc5bb" class="outline-4">
<h4 id="orga5cc5bb"><span class="section-number-4">9.1.6</span> Usage</h4>
<div class="outline-text-4" id="text-9-1-6">
<div class="org-src-container">
<pre class="src src-racket">






<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">a</span> <span style="color: #a626a4;">(</span>make-rect <span style="color: #2e8b57;">2</span> <span style="color: #2e8b57;">3</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">b</span> <span style="color: #a626a4;">(</span>make-pol <span style="color: #2e8b57;">5</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">tan</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">/</span> <span style="color: #2e8b57;">3</span> <span style="color: #2e8b57;">4</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">result</span> <span style="color: #a626a4;">(</span>+c a b<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>real result<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>img result<span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #a626a4;">car</span> a<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">car</span> b<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">car</span> result<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">cadr</span> result<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">cddr</span> result<span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
4.98276733430013
7.012866684732013
rectangular
polar
rectangular
4.98276733430013
7.012866684732013
</pre>


<p>
Note that complex numbers are now a pair of a label and a pair.
</p>
</div>
</div>

<div id="outline-container-orgbf73897" class="outline-4">
<h4 id="orgbf73897"><span class="section-number-4">9.1.7</span> Review</h4>
<div class="outline-text-4" id="text-9-1-7">
<p>
There are two major issues with this way of engineering the
complex number system (&ldquo;dispatch on type&rdquo;):
</p>
<ul class="org-ul">
<li>George and Martha having to change their procedure names to
prevent namespace violation. This issue, however, can be fixed
by methods explored in later lectures.</li>
<li>A larger issue is that when an additional representation is
added (say, Harry&rsquo;s), the manager&rsquo;s <code>cond</code> has to be changed.
This isn&rsquo;t ideal, since it&rsquo;s a set of centralized procedures
which all of George, Martha, and Harry have to be able to edit.
This centralization and causes a bottleneck, and is annoying,
especially because all the manager does, really, is a
conditional dispatch &#x2014; it&rsquo;s a bureaucrat.</li>
</ul>

<p>
Our next efforts will be directed at eliminating the manager
procedures.
</p>
</div>
</div>
</div>

<div id="outline-container-org409eae3" class="outline-3">
<h3 id="org409eae3"><span class="section-number-3">9.2</span> Data-Directed Programming</h3>
<div class="outline-text-3" id="text-9-2">
<p>
Abstractly, what does the manager do? It acts as a lookup table, of
shape and form:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Generic</th>
<th scope="col" class="org-left">Polar</th>
<th scope="col" class="org-left">Rectangular</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>real</code></td>
<td class="org-left"><code>real-polar</code></td>
<td class="org-left"><code>real-rectangular</code></td>
</tr>

<tr>
<td class="org-left"><code>img</code></td>
<td class="org-left"><code>img-polar</code></td>
<td class="org-left"><code>img-rectangular</code></td>
</tr>

<tr>
<td class="org-left"><code>mag</code></td>
<td class="org-left"><code>mag-polar</code></td>
<td class="org-left"><code>mag-rectangular</code></td>
</tr>

<tr>
<td class="org-left"><code>ang</code></td>
<td class="org-left"><code>ang-polar</code></td>
<td class="org-left"><code>ang-rectangular</code></td>
</tr>
</tbody>
</table>

<p>
We could decentralize the manager by simply constructing a globally
accessible table like this, and letting George and Martha put their
procedures into the correct place in the table. They must each set
up their own columns, then they can continue to define their own
&ldquo;versions&rdquo; of all the generic operators. They do this using two
procedures:
</p>

<pre class="example">
(put KEY1 KEY2 value)
(get KEY1 KEY2)
</pre>

<p>
<code>get</code> returns the value we&rsquo;d <code>put</code> in the table. The precise way
this table is represented is not of interest to us, and we defer
its implementation to a later lecture.
</p>
</div>

<div id="outline-container-org4190d8f" class="outline-4">
<h4 id="org4190d8f"><span class="section-number-4">9.2.1</span> Putting George&rsquo;s Procedures</h4>
<div class="outline-text-4" id="text-9-2-1">
<div class="org-src-container">
<pre class="src src-racket" id="orge1d3406"><span style="color: #4078f2;">(</span>put <span style="color: #2e8b57;">'rectangular</span> <span style="color: #2e8b57;">'real</span> real-rectangular<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>put <span style="color: #2e8b57;">'rectangular</span> <span style="color: #2e8b57;">'img</span> img-rectangular<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>put <span style="color: #2e8b57;">'rectangular</span> <span style="color: #2e8b57;">'mag</span> mag-rectangular<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>put <span style="color: #2e8b57;">'rectangular</span> <span style="color: #2e8b57;">'ang</span> ang-rectangular<span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Note carefully that the value inserted into the table cell is
actually a <i>lambda</i>, it&rsquo;s not a symbol. This means that the table
literally contains within it the procedures, not their names.
Technically, George could have given the third argument of <code>put</code>
as a &lambda; directly instead of first defining it. This is
desirable, since George can safely debug and change his
procedures, and only &ldquo;commit&rdquo; them when he puts them in the table.
Moreover, it greatly simplifies lookups: to apply a procedure, one
must only grab the correct cell of the table.
</p>
</div>
</div>


<div id="outline-container-org8e9dced" class="outline-4">
<h4 id="org8e9dced"><span class="section-number-4">9.2.2</span> Putting Martha&rsquo;s Procedures</h4>
<div class="outline-text-4" id="text-9-2-2">
<p>
Similarly:
</p>
<div class="org-src-container">
<pre class="src src-racket" id="org4e4556c"><span style="color: #4078f2;">(</span>put <span style="color: #2e8b57;">'polar</span> <span style="color: #2e8b57;">'real</span> real-polar<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>put <span style="color: #2e8b57;">'polar</span> <span style="color: #2e8b57;">'img</span> img-polar<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>put <span style="color: #2e8b57;">'polar</span> <span style="color: #2e8b57;">'mag</span> mag-polar<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>put <span style="color: #2e8b57;">'polar</span> <span style="color: #2e8b57;">'ang</span> ang-polar<span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Now, if Harry wants to add his procedures, he doesn&rsquo;t have to do
anything except <code>put</code> them in the table.
</p>
</div>
</div>
