video_notes/video_notes.org
*** Manager Automation

    The procedures hanging around in the table isn't enough: when =+c=
    calls (say) =real=, it needs to =get= these values from the table.
    This is done by:

    #+NAME: complex-operate
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (operate op object)
        (let ((proc (get (type object) op)))
          (if (not (null? proc))
              (proc (contents object))
              (error "Operation undefined."))))
    #+END_SRC

    It is now simple to define the generic operators:

    #+NAME: complex-tbl-gen-ops
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (real obj)
        (operate 'real obj))

      (define (img obj)
        (operate 'img obj))

      (define (mag obj)
        (operate 'mag obj))

      (define (ang obj)
        (operate 'ang obj))
    #+END_SRC


*** Usage

    The usage is the same as last time, since the difference is in the
    implementation:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<square>>
      <<type-arch>>
      <<george-complex-procs>>
      <<martha-complex-procs>>
      <<complex-ddp-tbl>>
      <<complex-george-puts>>
      <<complex-martha-puts>>
      <<complex-operate>>
      <<complex-tbl-gen-ops>>
      <<complex-arith>>
      (define a (make-rect 2 3))
      (define b (make-pol 5 (tan (/ 3 4))))

      (define result (+c a b))
      (real result)
      (img result)

      (car a)
      (car b)
      (car result)
      (cadr result)
      (cddr result)

    #+END_SRC

    #+RESULTS:
    : 4.98276733430013
    : 7.012866684732013
    : rectangular
    : polar
    : rectangular
    : 4.98276733430013
    : 7.012866684732013

    #+begin_quote
    Note that an alternative to keeping the operations in a lookup
    table is to include the operations with the data object. This
    allows the data object to carry independently all the information
    required to work with it. This style of programming is called
    "message passing".
    #+end_quote

    We can see by the substitution rule how this system is working:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (real z)
      (operate 'real z)
      ((get 'polar 'real) (contents z))
      (real-polar (contents z))
    #+END_SRC

** Advanced Example: Semi-Complete Arithmetic System

*** Architecture
   Let us now embed our complex number system "package" in a more
   complex arithmetic system which, diagrammatically, looks like the
   following:

   #+LATEX: \begin{center}
   #+LATEX: \begin{tabulary}{1.0\textwidth}{|C|C|C|C|}
   #+LATEX: \hline
   #+LATEX: \multicolumn{4}{|c|}{\texttt{add sub mult div}}\\
   #+LATEX: \hline
   #+LATEX: \multicolumn{2}{|c|}{\texttt{+complex -complex *complex /complex}}&&\\
   #+LATEX: \cline{1-2}
   #+LATEX: \multicolumn{2}{|c|}{}&&\\
   #+LATEX: \multicolumn{2}{|c|}{Complex}& Rational & Lisp Numbers\\
   #+LATEX: \multicolumn{2}{|c|}{\texttt{+c -c *c /c}}& \texttt{+rat *rat}& \texttt{+ - * /}\\
   #+LATEX: \multicolumn{2}{|c|}{}&&\\
   #+LATEX: \cline{1-2}
   #+LATEX: &&&\\
   #+LATEX: \makecell{~~~~~~Rectangular~~~~~~} & \makecell{~~~~~~~~Polar} & & \\
   #+LATEX: &&&\\
   #+LATEX: \hline
   #+LATEX: \end{tabulary}
   #+LATEX: \end{center}

   Our goal is to embed our complex number, rational number, and
   standard Lisp number code into a single system. This will also be
   done with tags and a lookup table, with data being tagged as
   =complex=, =rational=, or =number=. The top-level operations
   =add=, =sub=, =mul=, and =div= are defined in terms of an =operate=
   which is binary rather than unary. Later, we expand this system by
   adding a way to add polynomials.

