video_notes/index.html

<div id="outline-container-org123d4a4" class="outline-4">
<h4 id="org123d4a4"><span class="section-number-4">9.2.3</span> Manager Automation</h4>
<div class="outline-text-4" id="text-9-2-3">
<p>
The procedures hanging around in the table isn&rsquo;t enough: when <code>+c</code>
calls (say) <code>real</code>, it needs to <code>get</code> these values from the table.
This is done by:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org0c5df6b"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">operate</span> op object<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">let</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #6a1868;">proc</span> <span style="color: #b751b6;">(</span>get <span style="color: #986801;">(</span>type object<span style="color: #986801;">)</span> op<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">if</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">not</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">null?</span> proc<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
        <span style="color: #da8548;">(</span>proc <span style="color: #b751b6;">(</span>contents object<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
        <span style="color: #da8548;">(</span><span style="color: #a626a4;">error</span> <span style="color: #50a14f;">"Operation undefined."</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
It is now simple to define the generic operators:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org4a52207"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">real</span> obj<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>operate <span style="color: #2e8b57;">'real</span> obj<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">img</span> obj<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>operate <span style="color: #2e8b57;">'img</span> obj<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">mag</span> obj<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>operate <span style="color: #2e8b57;">'mag</span> obj<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">ang</span> obj<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>operate <span style="color: #2e8b57;">'ang</span> obj<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org7a8f45c" class="outline-4">
<h4 id="org7a8f45c"><span class="section-number-4">9.2.4</span> Usage</h4>
<div class="outline-text-4" id="text-9-2-4">
<p>
The usage is the same as last time, since the difference is in the
implementation:
</p>

<div class="org-src-container">
<pre class="src src-racket">









<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">a</span> <span style="color: #a626a4;">(</span>make-rect <span style="color: #2e8b57;">2</span> <span style="color: #2e8b57;">3</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">b</span> <span style="color: #a626a4;">(</span>make-pol <span style="color: #2e8b57;">5</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">tan</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">/</span> <span style="color: #2e8b57;">3</span> <span style="color: #2e8b57;">4</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">result</span> <span style="color: #a626a4;">(</span>+c a b<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>real result<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>img result<span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #a626a4;">car</span> a<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">car</span> b<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">car</span> result<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">cadr</span> result<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">cddr</span> result<span style="color: #4078f2;">)</span>

</pre>
</div>

<pre class="example">
4.98276733430013
7.012866684732013
rectangular
polar
rectangular
4.98276733430013
7.012866684732013
</pre>


<blockquote>
<p>
Note that an alternative to keeping the operations in a lookup
table is to include the operations with the data object. This
allows the data object to carry independently all the information
required to work with it. This style of programming is called
&ldquo;message passing&rdquo;.
</p>
</blockquote>

<p>
We can see by the substitution rule how this system is working:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span>real z<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>operate <span style="color: #2e8b57;">'real</span> z<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">(</span>get <span style="color: #2e8b57;">'polar</span> <span style="color: #2e8b57;">'real</span><span style="color: #a626a4;">)</span> <span style="color: #a626a4;">(</span>contents z<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>real-polar <span style="color: #a626a4;">(</span>contents z<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2c21f98" class="outline-3">
<h3 id="org2c21f98"><span class="section-number-3">9.3</span> Advanced Example: Semi-Complete Arithmetic System</h3>
<div class="outline-text-3" id="text-9-3">
</div>
<div id="outline-container-orga9dffd8" class="outline-4">
<h4 id="orga9dffd8"><span class="section-number-4">9.3.1</span> Architecture</h4>
<div class="outline-text-4" id="text-9-3-1">
<p>
Let us now embed our complex number system &ldquo;package&rdquo; in a more
complex arithmetic system which, diagrammatically, looks like the
following:
</p>

<p>
Our goal is to embed our complex number, rational number, and
standard Lisp number code into a single system. This will also be
done with tags and a lookup table, with data being tagged as
<code>complex</code>, <code>rational</code>, or <code>number</code>. The top-level operations
<code>add</code>, <code>sub</code>, <code>mul</code>, and <code>div</code> are defined in terms of an <code>operate</code>
which is binary rather than unary. Later, we expand this system by
adding a way to add polynomials.
</p>
</div>
</div>
