video_notes/video_notes.org
*** Implementation

    The rational number procedures in this system are implemented thus:

    #+NAME: asn-rat-sel
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports none
      (define (numer x) (car x))
      (define (denom x) (cdr x))
    #+END_SRC
    # frac-proc
    #+NAME: asn-rat
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (make-rat n d)
        (attach-type 'rational (cons n d)))

      (put 'rational 'add +rat)
      (put 'rational 'mul *rat)
    #+END_SRC

    The definitions of =+rat= and =*rat= are the same as last time:
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (+rat x y)
        (make-rat
         (+ (* (numer x) (denom y))
            (* (numer y) (denom x)))
         (* (denom x) (denom y))))

      (define (*rat x y)
        (make-rat
         (* (numer x) (numer y))
         (* (denom x) (denom y))))
    #+END_SRC

    Similarly, we can implement constructors and =put= procedures for
    complex numbers and standard Lisp numbers in this system:

    #+NAME: asn-complex
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (make-complex z)
        (attach-type 'complex z))

      (define (+complex z1 z2)
        (make-complex (+c z1 z2)))

      (define (-complex z1 z2)
        (make-complex (-c z1 z2)))

      (define (*complex z1 z2)
        (make-complex (*c z1 z2)))

      (define (/complex z1 z2)
        (make-complex (/c z1 z2)))

      (put 'complex 'add +complex)
      (put 'complex 'sub -complex)
      (put 'complex 'mul *complex)
      (put 'complex 'div /complex)
    #+END_SRC

    Note that we define additional procedures =+complex=, =-complex=,
    and so on to add the =complex= tag to results of operating on
    complex numbers. Moving to standard numbers:

    #+NAME: asn-num
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (make-number n)
        (attach-type 'number n))

      (define (+number x y)
        (make-number (+ x y)))

      (define (-number x y)
        (make-number (- x y)))

      (define (*number x y)
        (make-number (* x y)))

      (define (/number x y)
        (make-number (/ x y)))

      (put 'number 'add +number)
      (put 'number 'sub -number)
      (put 'number 'mul *number)
      (put 'number 'div /number)
    #+END_SRC

    Finally, we must implement =add=, =sub=, =mul=, and =div=
    themselves:

    #+NAME: asn-toplevel
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (add x y)
        (operate-2 'add x y))

      (define (sub x y)
        (operate-2 'sub x y))

      (define (mul x y)
        (operate-2 'mul x y))

      (define (div x y)
        (operate-2 'div x y))
    #+END_SRC

    Finally, we implement the binary =operate=, =operate-2=:

    #+NAME: asn-operate-2
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (operate-2 op arg1 arg2)
        (if (eq? (type arg1) (type arg2))
            (let ((proc (get (type arg1) op)))
              (if (not (null? proc))
                  (proc (contents arg1)
                        (contents arg2))
                  (error "Operation undefined.")))
            (error "Argument type mismatch.")))
    #+END_SRC

