video_notes/index.html

<div id="outline-container-org543cabf" class="outline-4">
<h4 id="org543cabf"><span class="section-number-4">9.3.2</span> Implementation</h4>
<div class="outline-text-4" id="text-9-3-2">
<p>
The rational number procedures in this system are implemented thus:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org69abfcb"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">make-rat</span> n d<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>attach-type <span style="color: #2e8b57;">'rational</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> n d<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>put <span style="color: #2e8b57;">'rational</span> <span style="color: #2e8b57;">'add</span> +rat<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>put <span style="color: #2e8b57;">'rational</span> <span style="color: #2e8b57;">'mul</span> *rat<span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
The definitions of <code>+rat</code> and <code>*rat</code> are the same as last time:
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">+rat</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>make-rat
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> <span style="color: #b751b6;">(</span>numer x<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span>denom y<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
      <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> <span style="color: #b751b6;">(</span>numer y<span style="color: #b751b6;">)</span> <span style="color: #b751b6;">(</span>denom x<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> <span style="color: #da8548;">(</span>denom x<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>denom y<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">*rat</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>make-rat
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> <span style="color: #da8548;">(</span>numer x<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>numer y<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> <span style="color: #da8548;">(</span>denom x<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>denom y<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Similarly, we can implement constructors and <code>put</code> procedures for
complex numbers and standard Lisp numbers in this system:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org5ec0269"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">make-complex</span> z<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>attach-type <span style="color: #2e8b57;">'complex</span> z<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">+complex</span> z1 z2<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>make-complex <span style="color: #50a14f;">(</span>+c z1 z2<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">-complex</span> z1 z2<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>make-complex <span style="color: #50a14f;">(</span>-c z1 z2<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">*complex</span> z1 z2<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>make-complex <span style="color: #50a14f;">(</span>*c z1 z2<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">/complex</span> z1 z2<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>make-complex <span style="color: #50a14f;">(</span>/c z1 z2<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>put <span style="color: #2e8b57;">'complex</span> <span style="color: #2e8b57;">'add</span> +complex<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>put <span style="color: #2e8b57;">'complex</span> <span style="color: #2e8b57;">'sub</span> -complex<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>put <span style="color: #2e8b57;">'complex</span> <span style="color: #2e8b57;">'mul</span> *complex<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>put <span style="color: #2e8b57;">'complex</span> <span style="color: #2e8b57;">'div</span> /complex<span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Note that we define additional procedures <code>+complex</code>, <code>-complex</code>,
and so on to add the <code>complex</code> tag to results of operating on
complex numbers. Moving to standard numbers:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orgf9e2b9e"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">make-number</span> n<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>attach-type <span style="color: #2e8b57;">'number</span> n<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">+number</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>make-number <span style="color: #50a14f;">(</span><span style="color: #a626a4;">+</span> x y<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">-number</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>make-number <span style="color: #50a14f;">(</span><span style="color: #a626a4;">-</span> x y<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">*number</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>make-number <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> x y<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">/number</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>make-number <span style="color: #50a14f;">(</span><span style="color: #a626a4;">/</span> x y<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>put <span style="color: #2e8b57;">'number</span> <span style="color: #2e8b57;">'add</span> +number<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>put <span style="color: #2e8b57;">'number</span> <span style="color: #2e8b57;">'sub</span> -number<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>put <span style="color: #2e8b57;">'number</span> <span style="color: #2e8b57;">'mul</span> *number<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>put <span style="color: #2e8b57;">'number</span> <span style="color: #2e8b57;">'div</span> /number<span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Finally, we must implement <code>add</code>, <code>sub</code>, <code>mul</code>, and <code>div</code>
themselves:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org67bb2e7"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">add</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>operate-2 <span style="color: #2e8b57;">'add</span> x y<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">sub</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>operate-2 <span style="color: #2e8b57;">'sub</span> x y<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">mul</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>operate-2 <span style="color: #2e8b57;">'mul</span> x y<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">div</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>operate-2 <span style="color: #2e8b57;">'div</span> x y<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Finally, we implement the binary <code>operate</code>, <code>operate-2</code>:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org6f5fbfa"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">operate-2</span> op arg1 arg2<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">eq?</span> <span style="color: #da8548;">(</span>type arg1<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>type arg2<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
      <span style="color: #50a14f;">(</span><span style="color: #e45649;">let</span> <span style="color: #da8548;">(</span><span style="color: #b751b6;">(</span><span style="color: #6a1868;">proc</span> <span style="color: #986801;">(</span>get <span style="color: #4db5bd;">(</span>type arg1<span style="color: #4db5bd;">)</span> op<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
        <span style="color: #da8548;">(</span><span style="color: #e45649;">if</span> <span style="color: #b751b6;">(</span><span style="color: #a626a4;">not</span> <span style="color: #986801;">(</span><span style="color: #a626a4;">null?</span> proc<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span>
            <span style="color: #b751b6;">(</span>proc <span style="color: #986801;">(</span>contents arg1<span style="color: #986801;">)</span>
                  <span style="color: #986801;">(</span>contents arg2<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span>
            <span style="color: #b751b6;">(</span><span style="color: #a626a4;">error</span> <span style="color: #50a14f;">"Operation undefined."</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
      <span style="color: #50a14f;">(</span><span style="color: #a626a4;">error</span> <span style="color: #50a14f;">"Argument type mismatch."</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>
</div>
</div>
