video_notes/video_notes.org
*** Usage

    We're now ready to test this system:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<square>>
      <<type-arch>>
      <<george-complex-procs>>
      <<martha-complex-procs>>
      <<complex-ddp-tbl>>
      <<complex-george-puts>>
      <<complex-martha-puts>>
      <<complex-operate>>
      <<complex-tbl-gen-ops>>
      <<complex-arith>>
      <<asn-rat-sel>>
      <<frac-proc>>
      <<asn-rat>>
      <<asn-complex>>
      <<asn-num>>
      <<asn-operate-2>>
      <<asn-toplevel>>

      (define p (make-complex (make-pol 1 2)))
      (define q (make-complex (make-pol 3 4)))
      (mul q p)

      (define r (make-rat 2 4))
      (define s (make-rat 1 4))
      (add r s)

      (sub (make-number 65) (make-number 3))
    #+END_SRC

    #+RESULTS:
    : (complex polar 3 . 6)
    : (rational 12 . 16)
    : (number . 62)

    See from the output the structure: labels followed by actual value
    of the datum.

