video_notes/index.html

<div id="outline-container-org4896871" class="outline-4">
<h4 id="org4896871"><span class="section-number-4">9.3.3</span> Usage</h4>
<div class="outline-text-4" id="text-9-3-3">
<p>
We&rsquo;re now ready to test this system:
</p>

<div class="org-src-container">
<pre class="src src-racket">

















<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">p</span> <span style="color: #a626a4;">(</span>make-complex <span style="color: #50a14f;">(</span>make-pol <span style="color: #2e8b57;">1</span> <span style="color: #2e8b57;">2</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">q</span> <span style="color: #a626a4;">(</span>make-complex <span style="color: #50a14f;">(</span>make-pol <span style="color: #2e8b57;">3</span> <span style="color: #2e8b57;">4</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>mul q p<span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">r</span> <span style="color: #a626a4;">(</span>make-rat <span style="color: #2e8b57;">2</span> <span style="color: #2e8b57;">4</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">s</span> <span style="color: #a626a4;">(</span>make-rat <span style="color: #2e8b57;">1</span> <span style="color: #2e8b57;">4</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>add r s<span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>sub <span style="color: #a626a4;">(</span>make-number <span style="color: #2e8b57;">65</span><span style="color: #a626a4;">)</span> <span style="color: #a626a4;">(</span>make-number <span style="color: #2e8b57;">3</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
(complex polar 3 . 6)
(rational 12 . 16)
(number . 62)
</pre>


<p>
See from the output the structure: labels followed by actual value
of the datum.
</p>
</div>
</div>
