video_notes/video_notes.org
*** Adding Polynomials

    To do arithmetic on polynomials, we must first figure out how to
    represent them. Consider the polynomial:

    $$x^{15} + 2x^7 + 5$$

    One simple way to represent a polynomial is a list of
    coefficients, with the rightmost coefficient being the constant
    term, the second last being the linear term, followed by
    quadratic, and so on. However, for "sparse" polynomials like the
    one in the example, this will result in a list with a lot of
    zeros. We therefore choose a slightly different representation: a
    list of pairs. The =car= of the pair is the order, and the =cdr=
    is the coefficient. Thus, the polynomial in the example is
    represented as =((15 1) (7 2) (0 5))=. We call this the "term
    list" of the polynomial. In our final representation, we'll =cons=
    this with the last bit of missing information: the variable the
    polynomial is in.

    Thus, to construct a polynomial:

    #+NAME: asn-poly-cons
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (make-poly var term-list)
        (attach-type 'polynomial (cons var term-list)))

      (define (var poly) (car poly))
      (define (term-list poly) (cdr poly))
    #+END_SRC

    Now, implementing =+poly=:

    #+NAME: asn-+poly
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (+poly p1 p2)
        (if (eq? (var p1) (var p2))
            (make-poly
             (var p1)
             (+term (term-list p1)
                    (term-list p2)))
            (error "Polynomials not in same variable.")))

      (put 'polynomial 'add +poly)
    #+END_SRC

    Of course, this just pushed the real work onto =+term=, which is
    defined as:

    #+NAME: asn-+term
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (+term L1 L2)
        (cond ((empty-termlist? L1) L2)
              ((empty-termlist? L2) L1)
              (else
               (let ((t1 (first-term L1))
                     (t2 (first-term L2)))
                 (cond ((> (order t1) (order t2))
                        (adjoin-term
                         t1
                         (+term (rest-terms L1) L2)))
                       ((< (order t1) (order t2))
                        (adjoin-term
                         t2
                         (+term L1 (rest-terms L2))))
                       (else
                        (adjoin-term
                         (make-term (order t1)
                                    (add (coeff t1)
                                         (coeff t2)))
                         (+term (rest-terms L1) (rest-terms L2)))))))))
    #+END_SRC



    Clearly, we need to implement some predicates, constructors, and
    selectors for =term='s and =term-list='s:

    #+NAME: asn-tl-cons
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (empty-termlist? tl)
        (null? tl))

      (define (first-term tl)
        (car tl))

      (define (rest-terms tl)
        (cdr tl))

      (define (adjoin-term term tl)
        (cons term tl))

      (define (make-term o c)
        (cons o c))

      (define (order t)
        (car t))

      (define (coeff t)
        (cdr t))
    #+END_SRC

    Usage is obvious:


    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<square>>
      <<type-arch>>
      <<george-complex-procs>>
      <<martha-complex-procs>>
      <<complex-ddp-tbl>>
      <<complex-george-puts>>
      <<complex-martha-puts>>
      <<complex-operate>>
      <<complex-tbl-gen-ops>>
      <<complex-arith>>
      <<asn-rat-sel>>
      <<frac-proc>>
      <<asn-rat>>
      <<asn-complex>>
      <<asn-num>>
      <<asn-operate-2>>
      <<asn-toplevel>>
      <<asn-poly-cons>>
      <<asn-tl-cons>>
      <<asn-+term>>
      <<asn-+poly>>

      (define p1-tl
        (list
         (cons 15 (make-number 1))
         (cons 7 (make-number 2))
         (cons 0 (make-number 5))))
      (define poly1 (make-poly 'x p1-tl))

      (define p2-tl
        (list
         (cons 25 (make-number 1))
         (cons 15 (make-number 8))
         (cons 9 (make-number 4))
         (cons 7 (make-number 4))
         (cons 0 (make-number 15))))
      (define poly2 (make-poly 'x p2-tl))

      (add poly1 poly2)
    #+END_SRC

    #+RESULTS:
    : (polynomial x (25 number . 1) (15 number . 9)
    :               (9 number . 4) (7 number . 6) (0 number . 20))

    Although somewhat hard to read, this is just the polynomial:

    $$x^{25} + 9x^{15} + 4x^9 + 6x^7 + 20$$

    which is the correct result of summing the polynomials:

    $$(x^{15}+2x^7+5) + (x^{25} + 8x^{15} + 4x^9 + 4x^7 + 15)$$

