video_notes/index.html

<div id="outline-container-org162edd2" class="outline-4">
<h4 id="org162edd2"><span class="section-number-4">9.3.4</span> Adding Polynomials</h4>
<div class="outline-text-4" id="text-9-3-4">
<p>
To do arithmetic on polynomials, we must first figure out how to
represent them. Consider the polynomial:
</p>

<p>
\[x^{15} + 2x^7 + 5\]
</p>

<p>
One simple way to represent a polynomial is a list of
coefficients, with the rightmost coefficient being the constant
term, the second last being the linear term, followed by
quadratic, and so on. However, for &ldquo;sparse&rdquo; polynomials like the
one in the example, this will result in a list with a lot of
zeros. We therefore choose a slightly different representation: a
list of pairs. The <code>car</code> of the pair is the order, and the <code>cdr</code>
is the coefficient. Thus, the polynomial in the example is
represented as <code>((15 1) (7 2) (0 5))</code>. We call this the &ldquo;term
list&rdquo; of the polynomial. In our final representation, we&rsquo;ll <code>cons</code>
this with the last bit of missing information: the variable the
polynomial is in.
</p>

<p>
Thus, to construct a polynomial:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orgbf9f3a8"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">make-poly</span> var term-list<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>attach-type <span style="color: #2e8b57;">'polynomial</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> var term-list<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">var</span> poly<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">car</span> poly<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">term-list</span> poly<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cdr</span> poly<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Now, implementing <code>+poly</code>:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org1522a39"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">+poly</span> p1 p2<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">eq?</span> <span style="color: #da8548;">(</span>var p1<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>var p2<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
      <span style="color: #50a14f;">(</span>make-poly
       <span style="color: #da8548;">(</span>var p1<span style="color: #da8548;">)</span>
       <span style="color: #da8548;">(</span>+term <span style="color: #b751b6;">(</span>term-list p1<span style="color: #b751b6;">)</span>
              <span style="color: #b751b6;">(</span>term-list p2<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
      <span style="color: #50a14f;">(</span><span style="color: #a626a4;">error</span> <span style="color: #50a14f;">"Polynomials not in same variable."</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>put <span style="color: #2e8b57;">'polynomial</span> <span style="color: #2e8b57;">'add</span> +poly<span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Of course, this just pushed the real work onto <code>+term</code>, which is
defined as:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orge112c4f"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">+term</span> L1 L2<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">cond</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>empty-termlist? L1<span style="color: #da8548;">)</span> L2<span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span>empty-termlist? L2<span style="color: #da8548;">)</span> L1<span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span><span style="color: #e45649;">else</span>
         <span style="color: #da8548;">(</span><span style="color: #e45649;">let</span> <span style="color: #b751b6;">(</span><span style="color: #986801;">(</span><span style="color: #6a1868;">t1</span> <span style="color: #4db5bd;">(</span>first-term L1<span style="color: #4db5bd;">)</span><span style="color: #986801;">)</span>
               <span style="color: #986801;">(</span><span style="color: #6a1868;">t2</span> <span style="color: #4db5bd;">(</span>first-term L2<span style="color: #4db5bd;">)</span><span style="color: #986801;">)</span><span style="color: #b751b6;">)</span>
           <span style="color: #b751b6;">(</span><span style="color: #e45649;">cond</span> <span style="color: #986801;">(</span><span style="color: #4db5bd;">(</span><span style="color: #a626a4;">&gt;</span> <span style="color: #80a880;">(</span>order t1<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>order t2<span style="color: #80a880;">)</span><span style="color: #4db5bd;">)</span>
                  <span style="color: #4db5bd;">(</span>adjoin-term
                   t1
                   <span style="color: #80a880;">(</span>+term <span style="color: #887070;">(</span>rest-terms L1<span style="color: #887070;">)</span> L2<span style="color: #80a880;">)</span><span style="color: #4db5bd;">)</span><span style="color: #986801;">)</span>
                 <span style="color: #986801;">(</span><span style="color: #4db5bd;">(</span><span style="color: #a626a4;">&lt;</span> <span style="color: #80a880;">(</span>order t1<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>order t2<span style="color: #80a880;">)</span><span style="color: #4db5bd;">)</span>
                  <span style="color: #4db5bd;">(</span>adjoin-term
                   t2
                   <span style="color: #80a880;">(</span>+term L1 <span style="color: #887070;">(</span>rest-terms L2<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #4db5bd;">)</span><span style="color: #986801;">)</span>
                 <span style="color: #986801;">(</span><span style="color: #e45649;">else</span>
                  <span style="color: #4db5bd;">(</span>adjoin-term
                   <span style="color: #80a880;">(</span>make-term <span style="color: #887070;">(</span>order t1<span style="color: #887070;">)</span>
                              <span style="color: #887070;">(</span>add <span style="color: #4078f2;">(</span>coeff t1<span style="color: #4078f2;">)</span>
                                   <span style="color: #4078f2;">(</span>coeff t2<span style="color: #4078f2;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                   <span style="color: #80a880;">(</span>+term <span style="color: #887070;">(</span>rest-terms L1<span style="color: #887070;">)</span> <span style="color: #887070;">(</span>rest-terms L2<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #4db5bd;">)</span><span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>



<p>
Clearly, we need to implement some predicates, constructors, and
selectors for <code>term</code>&rsquo;s and <code>term-list</code>&rsquo;s:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org3ada9db"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">empty-termlist?</span> tl<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">null?</span> tl<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">first-term</span> tl<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">car</span> tl<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">rest-terms</span> tl<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cdr</span> tl<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">adjoin-term</span> term tl<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cons</span> term tl<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">make-term</span> o c<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cons</span> o c<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">order</span> t<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">car</span> t<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">coeff</span> t<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cdr</span> t<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Usage is obvious:
</p>


<div class="org-src-container">
<pre class="src src-racket">





















<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">p1-tl</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">list</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">15</span> <span style="color: #da8548;">(</span>make-number <span style="color: #2e8b57;">1</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">7</span> <span style="color: #da8548;">(</span>make-number <span style="color: #2e8b57;">2</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">0</span> <span style="color: #da8548;">(</span>make-number <span style="color: #2e8b57;">5</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">poly1</span> <span style="color: #a626a4;">(</span>make-poly <span style="color: #2e8b57;">'x</span> p1-tl<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">p2-tl</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">list</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">25</span> <span style="color: #da8548;">(</span>make-number <span style="color: #2e8b57;">1</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">15</span> <span style="color: #da8548;">(</span>make-number <span style="color: #2e8b57;">8</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">9</span> <span style="color: #da8548;">(</span>make-number <span style="color: #2e8b57;">4</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">7</span> <span style="color: #da8548;">(</span>make-number <span style="color: #2e8b57;">4</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">0</span> <span style="color: #da8548;">(</span>make-number <span style="color: #2e8b57;">15</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">poly2</span> <span style="color: #a626a4;">(</span>make-poly <span style="color: #2e8b57;">'x</span> p2-tl<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>add poly1 poly2<span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
(polynomial x (25 number . 1) (15 number . 9)
              (9 number . 4) (7 number . 6) (0 number . 20))
</pre>


<p>
Although somewhat hard to read, this is just the polynomial:
</p>

<p>
\[x^{25} + 9x^{15} + 4x^9 + 6x^7 + 20\]
</p>

<p>
which is the correct result of summing the polynomials:
</p>

<p>
\[(x^{15}+2x^7+5) + (x^{25} + 8x^{15} + 4x^9 + 4x^7 + 15)\]
</p>
</div>
</div>
