video_notes/video_notes.org
*** Recursive Data Directed Programming

    It's easy to miss one /very/ crucial point in the implementation
    of procedure =+term=: that when we actually add the coefficients
    of two same-order terms, we use the generic operator =add=. Or,
    instead of doing this:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (+ (coeff t1)
         (coeff t2))
    #+END_SRC

    we do:
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (add (coeff t1)
         (coeff t2))
    #+END_SRC

    What this does is that it lets our polynomial have any
    coefficients supported by the overall system. We therefore, "for
    free", have rational and complex coefficients. Therefore,
    expressions like the following are fully supported:

    $$\frac{3}{2}x^{2} + \frac{17}{7}$$ $$(3+2i)x^5+(4+7i)$$

    This works by calling =add= on the coefficients, which knows how
    to add fractions and complex numbers.


    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<square>>
      <<type-arch>>
      <<george-complex-procs>>
      <<martha-complex-procs>>
      <<complex-ddp-tbl>>
      <<complex-george-puts>>
      <<complex-martha-puts>>
      <<complex-operate>>
      <<complex-tbl-gen-ops>>
      <<complex-arith>>
      <<asn-rat-sel>>
      <<frac-proc>>
      <<asn-rat>>
      <<asn-complex>>
      <<asn-num>>
      <<asn-operate-2>>
      <<asn-toplevel>>
      <<asn-poly-cons>>
      <<asn-tl-cons>>
      <<asn-+term>>
      <<asn-+poly>>

      (define p1-tl
        (list
         (cons 15 (make-rat 1 2))
         (cons 7 (make-rat 2 17))
         (cons 0 (make-rat 5 4))))
      (define poly1 (make-poly 'x p1-tl))

      (define p2-tl
        (list
         (cons 25 (make-rat 1 3))
         (cons 15 (make-rat 8 7))
         (cons 9 (make-rat 4 13))
         (cons 7 (make-rat 14 7))
         (cons 0 (make-rat 15 1))))
      (define poly2 (make-poly 'x p2-tl))

      (add poly1 poly2)
    #+END_SRC

    #+RESULTS:
    : (polynomial x (25 rational 1 . 3) (15 rational 23 . 14)
    :               (9 rational 4 . 13) (7 rational 252 . 119) (0 rational 65 . 4))




    Even cooler is the fact that we have support for polynomials with
    polynomial coefficients, such as:

    $$(x^2+1)y^2 + (x^3-2x)y + (x^4-7)$$

    This is because =add= also knows, recursively, how to add
    polynomials. We can, theoretically, nest this as far as we want
    to, having polynomials whose coefficients are polynomials whose
    coefficients are polynomials whose\dots

    Note that we could rewrite =+rat= to use =add= instead of =+=, and
    we'd be able to support expressions such as

    $$\frac{3x+7}{x^2+1}$$

    This exposes a powerful technique: once we have the basic
    implementation of any operation, say matrix addition, in the form:

    $$\begin{bmatrix}
    a & b\\
    c & d
    \end{bmatrix} +
    \begin{bmatrix}
    p & q\\
    r & s
    \end{bmatrix} =
    \begin{bmatrix}
    a+p & b+q\\
    c+r & d+s
    \end{bmatrix} $$

    If we use generic operators, it doesn't matter what $a$, $b$, and
    the other operands are: they can be any type the generic operators
    support, including matrices.

** Review

   We started our implementation of generic operators by writing a
   manager to dispatch the correct procedure according to type using
   conditional statements. We saw that this created a bottleneck at
   the manager. We then eliminated the manager by using a lookup
   table, which the generic operators accessed and got the correct
   \lambda, effectively decentralising the manager's role, since
   any new representation can be added to the table without any
   interaction with the others. Finally, we saw how to use generic
   operators to allow the recursive use of operations on types within
   the system.

   One feature, however, missing from the system, is the idea of "type
   coercion". Our system fails when it tries to add, say,

   $$3 + \frac{2}{5}$$

   by reporting a type mismatch (it cannot add a =number= and a
   =rational=). However, it won't complain if we ask it to add

   $$\frac{3}{1} + \frac{2}{5}$$

   Despite the meanings being mathematically the same. We then need to
   implement a way to "coerce" types into other types when it is
   mathematically meaningful to do so, for instance, interpreting a
   pure real number $r$ as complex number $r+0i$. The implementation
   of "type coercion" is shown in the SICP book.

   # and in appendix A


* Lecture 5A: Assignment, State, and Side-Effects

  Up until now, we've used no assignment statements in our use of
  Lisp. If we add one, there must be a good reason to do so, and the
  creation of significant advantage.
  We will first consider how we'd go about dealing with assignment in
  Lisp, then the benefits it brings to our programming practice.

** Functional v. Imperative Style

