video_notes/index.html

<div id="outline-container-org82f46f7" class="outline-4">
<h4 id="org82f46f7"><span class="section-number-4">9.3.5</span> Recursive Data Directed Programming</h4>
<div class="outline-text-4" id="text-9-3-5">
<p>
It&rsquo;s easy to miss one <i>very</i> crucial point in the implementation
of procedure <code>+term</code>: that when we actually add the coefficients
of two same-order terms, we use the generic operator <code>add</code>. Or,
instead of doing this:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #a626a4;">+</span> <span style="color: #a626a4;">(</span>coeff t1<span style="color: #a626a4;">)</span>
   <span style="color: #a626a4;">(</span>coeff t2<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
we do:
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span>add <span style="color: #a626a4;">(</span>coeff t1<span style="color: #a626a4;">)</span>
   <span style="color: #a626a4;">(</span>coeff t2<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
What this does is that it lets our polynomial have any
coefficients supported by the overall system. We therefore, &ldquo;for
free&rdquo;, have rational and complex coefficients. Therefore,
expressions like the following are fully supported:
</p>

<p>
\[\frac{3}{2}x^{2} + \frac{17}{7}\] \[(3+2i)x^5+(4+7i)\]
</p>

<p>
This works by calling <code>add</code> on the coefficients, which knows how
to add fractions and complex numbers.
</p>


<div class="org-src-container">
<pre class="src src-racket">





















<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">p1-tl</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">list</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">15</span> <span style="color: #da8548;">(</span>make-rat <span style="color: #2e8b57;">1</span> <span style="color: #2e8b57;">2</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">7</span> <span style="color: #da8548;">(</span>make-rat <span style="color: #2e8b57;">2</span> <span style="color: #2e8b57;">17</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">0</span> <span style="color: #da8548;">(</span>make-rat <span style="color: #2e8b57;">5</span> <span style="color: #2e8b57;">4</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">poly1</span> <span style="color: #a626a4;">(</span>make-poly <span style="color: #2e8b57;">'x</span> p1-tl<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">p2-tl</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">list</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">25</span> <span style="color: #da8548;">(</span>make-rat <span style="color: #2e8b57;">1</span> <span style="color: #2e8b57;">3</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">15</span> <span style="color: #da8548;">(</span>make-rat <span style="color: #2e8b57;">8</span> <span style="color: #2e8b57;">7</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">9</span> <span style="color: #da8548;">(</span>make-rat <span style="color: #2e8b57;">4</span> <span style="color: #2e8b57;">13</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">7</span> <span style="color: #da8548;">(</span>make-rat <span style="color: #2e8b57;">14</span> <span style="color: #2e8b57;">7</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
   <span style="color: #50a14f;">(</span><span style="color: #a626a4;">cons</span> <span style="color: #2e8b57;">0</span> <span style="color: #da8548;">(</span>make-rat <span style="color: #2e8b57;">15</span> <span style="color: #2e8b57;">1</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">poly2</span> <span style="color: #a626a4;">(</span>make-poly <span style="color: #2e8b57;">'x</span> p2-tl<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>add poly1 poly2<span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
(polynomial x (25 rational 1 . 3) (15 rational 23 . 14)
              (9 rational 4 . 13) (7 rational 252 . 119) (0 rational 65 . 4))
</pre>





<p>
Even cooler is the fact that we have support for polynomials with
polynomial coefficients, such as:
</p>

<p>
\[(x^2+1)y^2 + (x^3-2x)y + (x^4-7)\]
</p>

<p>
This is because <code>add</code> also knows, recursively, how to add
polynomials. We can, theoretically, nest this as far as we want
to, having polynomials whose coefficients are polynomials whose
coefficients are polynomials whose&hellip;
</p>

<p>
Note that we could rewrite <code>+rat</code> to use <code>add</code> instead of <code>+</code>, and
we&rsquo;d be able to support expressions such as
</p>

<p>
\[\frac{3x+7}{x^2+1}\]
</p>

<p>
This exposes a powerful technique: once we have the basic
implementation of any operation, say matrix addition, in the form:
</p>

<p>
\[\begin{bmatrix}
    a & b\\
    c & d
    \end{bmatrix} +
    \begin{bmatrix}
    p & q\\
    r & s
    \end{bmatrix} =
    \begin{bmatrix}
    a+p & b+q\\
    c+r & d+s
    \end{bmatrix} \]
</p>

<p>
If we use generic operators, it doesn&rsquo;t matter what \(a\), \(b\), and
the other operands are: they can be any type the generic operators
support, including matrices.
</p>
</div>
</div>
</div>

<div id="outline-container-org4a0efd8" class="outline-3">
<h3 id="org4a0efd8"><span class="section-number-3">9.4</span> Review</h3>
<div class="outline-text-3" id="text-9-4">
<p>
We started our implementation of generic operators by writing a
manager to dispatch the correct procedure according to type using
conditional statements. We saw that this created a bottleneck at
the manager. We then eliminated the manager by using a lookup
table, which the generic operators accessed and got the correct
&lambda;, effectively decentralising the manager&rsquo;s role, since
any new representation can be added to the table without any
interaction with the others. Finally, we saw how to use generic
operators to allow the recursive use of operations on types within
the system.
</p>

<p>
One feature, however, missing from the system, is the idea of &ldquo;type
coercion&rdquo;. Our system fails when it tries to add, say,
</p>

<p>
\[3 + \frac{2}{5}\]
</p>

<p>
by reporting a type mismatch (it cannot add a <code>number</code> and a
<code>rational</code>). However, it won&rsquo;t complain if we ask it to add
</p>

<p>
\[\frac{3}{1} + \frac{2}{5}\]
</p>

<p>
Despite the meanings being mathematically the same. We then need to
implement a way to &ldquo;coerce&rdquo; types into other types when it is
mathematically meaningful to do so, for instance, interpreting a
pure real number \(r\) as complex number \(r+0i\). The implementation
of &ldquo;type coercion&rdquo; is shown in the SICP book.
</p>
</div>
</div>
</div>


<div id="outline-container-org2e05097" class="outline-2">
<h2 id="org2e05097"><span class="section-number-2">10</span> Lecture 5A: Assignment, State, and Side-Effects</h2>
<div class="outline-text-2" id="text-10">
<p>
Up until now, we&rsquo;ve used no assignment statements in our use of
Lisp. If we add one, there must be a good reason to do so, and the
creation of significant advantage.
We will first consider how we&rsquo;d go about dealing with assignment in
Lisp, then the benefits it brings to our programming practice.
</p>
</div>

<div id="outline-container-org27f865f" class="outline-3">
<h3 id="org27f865f"><span class="section-number-3">10.1</span> Functional v. Imperative Style</h3>
<div class="outline-text-3" id="text-10-1">
</div>
