video_notes/video_notes.org
*** Functional Programming
    Functional programs encode mathematical truth in a procedure. For
    instance,

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (fact n)
        (cond ((= n 1) 1)
              (else (* n (fact (dec n))))))

      (fact 4)
    #+END_SRC

    #+RESULTS:
    : 24

    This is almost precisely the mathematical definition of a factorial
    in Lisp:
    $$f(n) = \begin{cases} 1& n=1\\ n\times f(n-1) & n>1\end{cases}$$

    Moreover, such a function can be fully understood by substituting
    recursively:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (fact 4)
      (* 4 (fact 3))
      (* 4 (* 3 (fact 2)))
      (* 4 (* 3 (* 2 (fact 1))))
      (* 4 (* 3 (* 2 1)))
      (* 4 (* 3 2))
      (* 4 6)
      24
    #+END_SRC

    Furthermore, we can differentiate between procedures with different
    processes. Consider our Peano adders:

     #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
       (define (pa+ x y)
         (if (= x 0)
             y
             (pa+ (dec x) (inc y))))
     #+END_SRC

     and

     #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
       (define (pb+ x y)
         (if (= x 0)
             y
             (inc (pb+ (dec x) y))))
     #+END_SRC



*** Imperative Programming

    Imperative programming involves writing statements which change
    the overall /state/ of the program. Lisp does this using
    assignment statements called =set!=.
    =set!= is called by giving it two arguments. The second is a
    value, and the first is the variable to assign it to. Or:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (set! <var> <value?)
    #+END_SRC

    Consider what this assignment does. It creates an instant in time.
    Before this instant, =<var>= had no value, or some other value.
    /After/ this =set!=, =<var>= has value =<value>=, which means that
    the =set!= changed something in the program state. Before the
    =set!= the state was (say) A, and after, it was a different state,
    (say) B. This is entirely different from any of our previous
    programs, all of which used functional programming style.

    It should be obvious that procedures which use assignment are not
    bijective, that is, for the same input, they may have different
    outputs. Consider:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define count 1)

      (define (demo x)
        (set! count (inc count))
        (+ x count))

      (demo 3)
      (demo 3)
      (demo 3)
    #+END_SRC

    #+RESULTS:
    : 5
    : 6
    : 7

    =demo= does not compute any mathematical function.
    Instead, the successive values of =count= are =set!= and
    remembered somewhere in the environment each time =demo= is
    called.

    Clearly, assignment introduces difficulties. Even our previous
    substitution model is now insufficient, since it is a static
    phenomenon which cannot account for changing values in the
    environment. Symbols now can refer to some place where the values
    of variables are stored. While this certainly makes our job
    harder, assignment is worth the trouble, as we'll see later.

