video_notes/index.html
<div id="outline-container-orgfa0b6f7" class="outline-4">
<h4 id="orgfa0b6f7"><span class="section-number-4">10.1.1</span> Functional Programming</h4>
<div class="outline-text-4" id="text-10-1-1">
<p>
Functional programs encode mathematical truth in a procedure. For
instance,
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">fact</span> n<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">cond</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #a626a4;">=</span> n <span style="color: #2e8b57;">1</span><span style="color: #da8548;">)</span> <span style="color: #2e8b57;">1</span><span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span><span style="color: #e45649;">else</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> n <span style="color: #b751b6;">(</span>fact <span style="color: #986801;">(</span>dec n<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>fact <span style="color: #2e8b57;">4</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
24
</pre>


<p>
This is almost precisely the mathematical definition of a factorial
in Lisp:
\[f(n) = \begin{cases} 1& n=1\\ n\times f(n-1) & n>1\end{cases}\]
</p>

<p>
Moreover, such a function can be fully understood by substituting
recursively:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span>fact <span style="color: #2e8b57;">4</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">*</span> <span style="color: #2e8b57;">4</span> <span style="color: #a626a4;">(</span>fact <span style="color: #2e8b57;">3</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">*</span> <span style="color: #2e8b57;">4</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">*</span> <span style="color: #2e8b57;">3</span> <span style="color: #50a14f;">(</span>fact <span style="color: #2e8b57;">2</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">*</span> <span style="color: #2e8b57;">4</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">*</span> <span style="color: #2e8b57;">3</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> <span style="color: #2e8b57;">2</span> <span style="color: #da8548;">(</span>fact <span style="color: #2e8b57;">1</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">*</span> <span style="color: #2e8b57;">4</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">*</span> <span style="color: #2e8b57;">3</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">*</span> <span style="color: #2e8b57;">2</span> <span style="color: #2e8b57;">1</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">*</span> <span style="color: #2e8b57;">4</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">*</span> <span style="color: #2e8b57;">3</span> <span style="color: #2e8b57;">2</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #a626a4;">*</span> <span style="color: #2e8b57;">4</span> <span style="color: #2e8b57;">6</span><span style="color: #4078f2;">)</span>
<span style="color: #2e8b57;">24</span>
</pre>
</div>

<p>
Furthermore, we can differentiate between procedures with different
processes. Consider our Peano adders:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">pa+</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">=</span> x <span style="color: #2e8b57;">0</span><span style="color: #50a14f;">)</span>
      y
      <span style="color: #50a14f;">(</span>pa+ <span style="color: #da8548;">(</span>dec x<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span>inc y<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
and
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">pb+</span> x y<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">=</span> x <span style="color: #2e8b57;">0</span><span style="color: #50a14f;">)</span>
      y
      <span style="color: #50a14f;">(</span>inc <span style="color: #da8548;">(</span>pb+ <span style="color: #b751b6;">(</span>dec x<span style="color: #b751b6;">)</span> y<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>
</div>
</div>



<div id="outline-container-org8a874c5" class="outline-4">
<h4 id="org8a874c5"><span class="section-number-4">10.1.2</span> Imperative Programming</h4>
<div class="outline-text-4" id="text-10-1-2">
<p>
Imperative programming involves writing statements which change
the overall <i>state</i> of the program. Lisp does this using
assignment statements called <code>set!</code>.
<code>set!</code> is called by giving it two arguments. The second is a
value, and the first is the variable to assign it to. Or:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">set!</span> &lt;var&gt; &lt;value&gt;<span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Consider what this assignment does. It creates an instant in time.
Before this instant, <code>&lt;var&gt;</code> had no value, or some other value.
<i>After</i> this <code>set!</code>, <code>&lt;var&gt;</code> has value <code>&lt;value&gt;</code>, which means that
the <code>set!</code> changed something in the program state. Before the
<code>set!</code> the state was (say) A, and after, it was a different state,
(say) B. This is entirely different from any of our previous
programs, all of which used functional programming style.
</p>

<p>
It should be obvious that procedures which use assignment are not
bijective, that is, for the same input, they may have different
outputs. Consider:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">count</span> <span style="color: #2e8b57;">1</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">demo</span> x<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">set!</span> <span style="color: #a626a4;">count</span> <span style="color: #50a14f;">(</span>inc <span style="color: #a626a4;">count</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">+</span> x <span style="color: #a626a4;">count</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>demo <span style="color: #2e8b57;">3</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>demo <span style="color: #2e8b57;">3</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>demo <span style="color: #2e8b57;">3</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
5
6
7
</pre>


<p>
<code>demo</code> does not compute any mathematical function.
Instead, the successive values of <code>count</code> are <code>set!</code> and
remembered somewhere in the environment each time <code>demo</code> is
called.
</p>

<p>
Clearly, assignment introduces difficulties. Even our previous
substitution model is now insufficient, since it is a static
phenomenon which cannot account for changing values in the
environment. Symbols now can refer to some place where the values
of variables are stored. While this certainly makes our job
harder, assignment is worth the trouble, as we&rsquo;ll see later.
</p>
</div>
</div>
