video_notes/video_notes.org
*** Direct Comparison

    Here's an iterative implementation of a functional factorial
    procedure:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (fact n)
        (define (iter m i)
          (cond ((> i n) m)
                (else
                 (iter (* i m) (inc i)))))
        (iter 1 1))

      (fact 4)
    #+END_SRC

    #+RESULTS:
    : 24

    And an iterative implementation of an imperative-style factorial
    procedure:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (fact n)
        (let ((i 1) (m 1))
          (define (loop)
            (cond ((> i n) m)
                  (else
                   (set! m (* i m))
                   (set! i (inc i))
                   (loop))))
          (loop)))

      (fact 4)
    #+END_SRC

    #+RESULTS:
    : 24

    Note the difference between the two. The first passes successive
    values of =i= and =m= as parameters into the next call of =iter=.
    However, in the imperative style, the very values of =i= and =m=
    are changed to their new values, and the procedure simply called
    again without any arguments.

    Note also that swapping the =set!= statements:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (set! i (inc i))
      (set! m (* i m))
    #+END_SRC

    Will mess up the execution of the program, since =m= depends on
    =i= having the correct value /at the time/ it's reassigned to =(*
    i m)=. The time instance creation inherent in assignment creates
    these time-based dependencies, which are worth being aware of.

** Environment Model

   As we observed, assignment invalidates our substitution model of
   evaluating Lisp programs. We therefore work on the creation of a
   new model which supports assignment.

*** Bound and Free Variables

    #+begin_quote
    We say that a variable =v= is "bound in an expression" =E= if the
    meaning of =E= is unchanged by the uniform replacement of =v= with
    a variable =w= (not occurring in =E=) for every occurrence of =v=
    in =E=.
    #+end_quote

    Bound variables exist naturally in mathematics. Consider the
    expressions:
    $$\forall x\exists y P(x,y)$$
    $$\int_0^1 \frac{\mathrm{d}x}{1+x^2}$$

    have no difference in meaning when $x$ is substituted:
    $$\forall w\exists y P(w,y)$$
    $$\int_0^1 \frac{\mathrm{d}w}{1+w^2}$$

    This is because, in both cases, $x$ is a bound variable. Now,

    #+begin_quote
    A quantifier is a symbol which binds a variable.
    #+end_quote

    Thus, in these cases, $\forall$, $\exists$, and $\int$ were the
    quantifiers of bound variable $x$. Similarly, consider a Lisp
    expression:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (lambda (y) ((lambda (x) (* x y)) 3))
    #+END_SRC

    Here, =x= and =y= are bound variables, and the \lambda are
    quantifiers for them. This can be illustrated by swapping out the
    variables and having no change in meaning:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (lambda (v) ((lambda (w) (* w v)) 3))
    #+END_SRC

    However, it is not necessary that all variables be bound. Consider
    the Lisp expression:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (lambda (x) (* x y))
    #+END_SRC

    =x= is bound, with quantifier \lambda. However, =y= is not bound
    (it is a free variable). This is because the definition of =y=
    does not come from the formal parameter list of a
    \lambda-expression or any other known location within the
    expression. Instead, it comes from somewhere outside. We cannot
    replace =y= with another variable =v=, since we don't know what
    value =y= may have.
    Formally,
    #+begin_quote
    We say that a variable =v= is "free in an expression" =E= if the
    meaning of =E= is changed by the uniform replacement of =v= with
    a variable =w= (not occurring in =E=) for every occurrence of =v=
    in =E=.
    #+end_quote

    In fact, in the expression:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (lambda (y) ((lambda (x) (* x y)) 3))
    #+END_SRC

    The symbol =*= is a free variable, since the expression's meaning
    will change if we replace it with the symbol =+=.

