video_notes/index.html

<div id="outline-container-org2cf0b87" class="outline-4">
<h4 id="org2cf0b87"><span class="section-number-4">10.1.3</span> Direct Comparison</h4>
<div class="outline-text-4" id="text-10-1-3">
<p>
Here&rsquo;s an iterative implementation of a functional factorial
procedure:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">fact</span> n<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">define</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">iter</span> m i<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">cond</span> <span style="color: #da8548;">(</span><span style="color: #b751b6;">(</span><span style="color: #a626a4;">&gt;</span> i n<span style="color: #b751b6;">)</span> m<span style="color: #da8548;">)</span>
          <span style="color: #da8548;">(</span><span style="color: #e45649;">else</span>
           <span style="color: #b751b6;">(</span>iter <span style="color: #986801;">(</span><span style="color: #a626a4;">*</span> i m<span style="color: #986801;">)</span> <span style="color: #986801;">(</span>inc i<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>iter <span style="color: #2e8b57;">1</span> <span style="color: #2e8b57;">1</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>fact <span style="color: #2e8b57;">4</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
24
</pre>


<p>
And an iterative implementation of an imperative-style factorial
procedure:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">fact</span> n<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">let</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #6a1868;">i</span> <span style="color: #2e8b57;">1</span><span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span><span style="color: #6a1868;">m</span> <span style="color: #2e8b57;">1</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">define</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">loop</span><span style="color: #da8548;">)</span>
      <span style="color: #da8548;">(</span><span style="color: #e45649;">cond</span> <span style="color: #b751b6;">(</span><span style="color: #986801;">(</span><span style="color: #a626a4;">&gt;</span> i n<span style="color: #986801;">)</span> m<span style="color: #b751b6;">)</span>
            <span style="color: #b751b6;">(</span><span style="color: #e45649;">else</span>
             <span style="color: #986801;">(</span><span style="color: #e45649;">set!</span> m <span style="color: #4db5bd;">(</span><span style="color: #a626a4;">*</span> i m<span style="color: #4db5bd;">)</span><span style="color: #986801;">)</span>
             <span style="color: #986801;">(</span><span style="color: #e45649;">set!</span> i <span style="color: #4db5bd;">(</span>inc i<span style="color: #4db5bd;">)</span><span style="color: #986801;">)</span>
             <span style="color: #986801;">(</span>loop<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span>loop<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>fact <span style="color: #2e8b57;">4</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
24
</pre>


<p>
Note the difference between the two. The first passes successive
values of <code>i</code> and <code>m</code> as parameters into the next call of <code>iter</code>.
However, in the imperative style, the very values of <code>i</code> and <code>m</code>
are changed to their new values, and the procedure simply called
again without any arguments.
</p>

<p>
Note also that swapping the <code>set!</code> statements:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">set!</span> i <span style="color: #a626a4;">(</span>inc i<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">set!</span> m <span style="color: #a626a4;">(</span><span style="color: #a626a4;">*</span> i m<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Will mess up the execution of the program, since <code>m</code> depends on
<code>i</code> having the correct value <i>at the time</i> it&rsquo;s reassigned to <code>(*
    i m)</code>. The time instance creation inherent in assignment creates
these time-based dependencies, which are worth being aware of.
</p>
</div>
</div>
</div>

<div id="outline-container-org9d393be" class="outline-3">
<h3 id="org9d393be"><span class="section-number-3">10.2</span> Environment Model</h3>
<div class="outline-text-3" id="text-10-2">
<p>
As we observed, assignment invalidates our substitution model of
evaluating Lisp programs. We therefore work on the creation of a
new model which supports assignment.
</p>
</div>

<div id="outline-container-org1f522aa" class="outline-4">
<h4 id="org1f522aa"><span class="section-number-4">10.2.1</span> Bound and Free Variables</h4>
<div class="outline-text-4" id="text-10-2-1">
<blockquote>
<p>
We say that a variable <code>v</code> is &ldquo;bound in an expression&rdquo; <code>E</code> if the
meaning of <code>E</code> is unchanged by the uniform replacement of <code>v</code> with
a variable <code>w</code> (not occurring in <code>E</code>) for every occurrence of <code>v</code>
in <code>E</code>.
</p>
</blockquote>

<p>
Bound variables exist naturally in mathematics. Consider the
expressions:
\[\forall x\exists y P(x,y)\]
\[\int_0^1 \frac{\mathrm{d}x}{1+x^2}\]
</p>

<p>
have no difference in meaning when \(x\) is substituted:
\[\forall w\exists y P(w,y)\]
\[\int_0^1 \frac{\mathrm{d}w}{1+w^2}\]
</p>

<p>
This is because, in both cases, \(x\) is a bound variable. Now,
</p>

<blockquote>
<p>
A quantifier is a symbol which binds a variable.
</p>
</blockquote>

<p>
Thus, in these cases, \(\forall\), \(\exists\), and \(\int\) were the
quantifiers of bound variable \(x\). Similarly, consider a Lisp
expression:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #a626a4;">(</span>y<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">(</span><span style="color: #50a14f;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #da8548;">(</span>x<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> x y<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span> <span style="color: #2e8b57;">3</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Here, <code>x</code> and <code>y</code> are bound variables, and the &lambda; are
quantifiers for them. This can be illustrated by swapping out the
variables and having no change in meaning:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #a626a4;">(</span>v<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">(</span><span style="color: #50a14f;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #da8548;">(</span>w<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> w v<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span> <span style="color: #2e8b57;">3</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
However, it is not necessary that all variables be bound. Consider
the Lisp expression:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #a626a4;">(</span>x<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">*</span> x y<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
<code>x</code> is bound, with quantifier &lambda;. However, <code>y</code> is not bound
(it is a free variable). This is because the definition of <code>y</code>
does not come from the formal parameter list of a
&lambda;-expression or any other known location within the
expression. Instead, it comes from somewhere outside. We cannot
replace <code>y</code> with another variable <code>v</code>, since we don&rsquo;t know what
value <code>y</code> may have.
Formally,
</p>
<blockquote>
<p>
We say that a variable <code>v</code> is &ldquo;free in an expression&rdquo; <code>E</code> if the
meaning of <code>E</code> is changed by the uniform replacement of <code>v</code> with
a variable <code>w</code> (not occurring in <code>E</code>) for every occurrence of <code>v</code>
in <code>E</code>.
</p>
</blockquote>

<p>
In fact, in the expression:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #a626a4;">(</span>y<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">(</span><span style="color: #50a14f;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #da8548;">(</span>x<span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">*</span> x y<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span> <span style="color: #2e8b57;">3</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
The symbol <code>*</code> is a free variable, since the expression&rsquo;s meaning
will change if we replace it with the symbol <code>+</code>.
</p>
</div>
</div>
