video_notes/video_notes.org
*** Scope

    Formally,

    #+begin_quote
    If =x= is a bound variable in =E=, then there is a
    \lambda-expression where it is bound. We call the list of formal
    parameters of this \lambda-expression the "bound variable list"
    and we say that the \lambda-expression "binds" the variable
    defined in the bound variable list. Moreover, those parts of the
    expression where a variable has a value defined by the
    \lambda-expression which binds it is called the "scope" of the
    variable.
    #+end_quote


    Or, for example:
    $$\mathtt{(\lambda~(y)~\underbrace{\mathtt{((\lambda~(x)~\overbrace{\mathtt{(*~x~y)}}^{\mathrm{Scope~of~}\mathtt{x}})~3)}}_{\mathrm{Scope~of~}\mathtt{y}})}$$

*** Frames and Environments

    #+ATTR_LATEX: :width 250pt
    [[./images/frames.pdf]]


    An environment is made up of a linked chain of frames. Shown in
    the figure are three frames, I, II, and III. Now, each of A, B, C,
    and D are different environments, which view the frames in
    different ways.

    #+ATTR_LATEX: :booktabs t
    | Environment | x | y | z | m |
    |-------------+---+---+---+---|
    | A           | 7 | 5 | 6 | - |
    | B           | 3 | 2 | - | 1 |
    | C           | 3 | 5 | - | - |
    | D           | 3 | 5 | - | - |

    Environments can be considered as different "vantage points" of
    the frame chain. From A, we see the values of the frame II and the
    frames behind II, in this case I. Therefore, we get the values of
    x, y, and z. However, there are two possible values of x. In this
    case, we say that the value of x in frame II "shadows" the value
    of x in all previous frames, and we consider that value to be the
    correct one. Note that this is actually making the choice to use
    the innermost scope's variables over ones in outer scopes. Other
    environments are similarly analyzed. Note that C and D are the
    same environment.

*** Procedure Objects

    A procedure objects consists of:
    A. A pointer to the procedure object.
    B. A pointer to the environment the procedure will execute in.
    C. The actual body (code) of the procedure.

    Diagrammatically:

    #+ATTR_LATEX: :width 200pt
    [[./images/frameobj.pdf]]

*** Rules for Environment Model

    1. A procedure object is applied to a set of arguments by
       constructing a frame binding the formal parameters of the
       procedure to the actual arguments of the call, then evaluating
       the body of the procedure /in the context/ of the new
       environment thus constructed. The new frame has as its
       enclosing environment the environment part of the procedure
       being applied.

       For example, for a procedure =P=, evaluated at =(P 3 4)=, the
       actual arguments to =P= are "appended" to the environment =P=
       is called in. The procedure object itself has three pointers:

       - The first is to the procedure itself, =P=.
       - The second points to the extended environment.
       - The third point points to the actual \lambda.

       Diagrammatically:

       #+ATTR_LATEX: :width 300pt
       [[./images/rule1.pdf]]

    2. A \lambda-expression is evaluated relative to a given
       environment as follows: a new procedure object is formed, the
       combining the code of the \lambda-expression with a pointer to
       the environment of evaluation.

       This rule is self-explanatory.

    Our most important take-away is that an environment is a linked
    chain of frames, going all the way back to the first (global)
    frame. We now have a new working model, which works with
    assignment, as we'll soon see.


*** Assignment

    Let's play around with assignment in the environment model.
    Consider the following procedure:

    #+NAME: env-mod-make-counter
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define make-counter
        (lambda (n)
          (lambda ()
            (set! n (inc n))
            n)))
    #+END_SRC

    What does the environment look like once we define =make-counter=?
    Something like this:

    #+ATTR_LATEX: :width 0.8\textwidth
    [[./images/make-counter.pdf]]

    Let us now use =make-counter= to define two counters, each of
    which start at different values of =n=:

    #+NAME: env-mod-make-counter-inc
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<env-mod-make-counter>>
      (define C1 (make-counter 0))
      (define C2 (make-counter 10))
    #+END_SRC

    The environment now looks like:

    #+ATTR_LATEX: :width 0.95\textwidth
    [[./images/c1c2.pdf]]

    See that there is no /possible/ confusion between which =n= =C1=
    uses and which =n= =C2= uses. Moreover, neither =C1= nor =C2=
    would care about a globally defined =n=, or any =n= in a higher
    level frame, since it'd get shadowed by their own =n='s.

    We can now see how the following would work:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<env-mod-make-counter-inc>>
      (C1)
      (C2)
      (C1)
      (C2)
    #+END_SRC

    #+RESULTS:
    : 1
    : 11
    : 2
    : 12

    The first call to =(C1)= sees that =n= is zero in its environment,
    and sets =n= to =0+1=1=, and returns =1=. The first call to =(C2)=
    sees that /its/ =n= is =10=, sets it to =11=, and returns =11=. The
    second call to =(C1)= sees that its =n= is =1=, then sets and
    returns =2=. The final call to =(C2)= sees that its =n= is =11=,
    which is then sets to =12= and returned.


