video_notes/index.html

<div id="outline-container-org17d200c" class="outline-4">
<h4 id="org17d200c"><span class="section-number-4">10.2.2</span> Scope</h4>
<div class="outline-text-4" id="text-10-2-2">
<p>
Formally,
</p>

<blockquote>
<p>
If <code>x</code> is a bound variable in <code>E</code>, then there is a
&lambda;-expression where it is bound. We call the list of formal
parameters of this &lambda;-expression the &ldquo;bound variable list&rdquo;
and we say that the &lambda;-expression &ldquo;binds&rdquo; the variable
defined in the bound variable list. Moreover, those parts of the
expression where a variable has a value defined by the
&lambda;-expression which binds it is called the &ldquo;scope&rdquo; of the
variable.
</p>
</blockquote>


<p>
Or, for example:
\[\mathtt{(\lambda~(y)~\underbrace{\mathtt{((\lambda~(x)~\overbrace{\mathtt{(*~x~y)}}^{\mathrm{Scope~of~}\mathtt{x}})~3)}}_{\mathrm{Scope~of~}\mathtt{y}})}\]
</p>
</div>
</div>

<div id="outline-container-org7a62b11" class="outline-4">
<h4 id="org7a62b11"><span class="section-number-4">10.2.3</span> Frames and Environments</h4>
<div class="outline-text-4" id="text-10-2-3">
<p>
<a href="./images/frames.pdf">./images/frames.pdf</a>
</p>


<p>
An environment is made up of a linked chain of frames. Shown in
the figure are three frames, I, II, and III. Now, each of A, B, C,
and D are different environments, which view the frames in
different ways.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Environment</th>
<th scope="col" class="org-right">x</th>
<th scope="col" class="org-right">y</th>
<th scope="col" class="org-left">z</th>
<th scope="col" class="org-left">m</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A</td>
<td class="org-right">7</td>
<td class="org-right">5</td>
<td class="org-left">6</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-right">3</td>
<td class="org-right">2</td>
<td class="org-left">-</td>
<td class="org-left">1</td>
</tr>

<tr>
<td class="org-left">C</td>
<td class="org-right">3</td>
<td class="org-right">5</td>
<td class="org-left">-</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">D</td>
<td class="org-right">3</td>
<td class="org-right">5</td>
<td class="org-left">-</td>
<td class="org-left">-</td>
</tr>
</tbody>
</table>

<p>
Environments can be considered as different &ldquo;vantage points&rdquo; of
the frame chain. From A, we see the values of the frame II and the
frames behind II, in this case I. Therefore, we get the values of
x, y, and z. However, there are two possible values of x. In this
case, we say that the value of x in frame II &ldquo;shadows&rdquo; the value
of x in all previous frames, and we consider that value to be the
correct one. Note that this is actually making the choice to use
the innermost scope&rsquo;s variables over ones in outer scopes. Other
environments are similarly analyzed. Note that C and D are the
same environment.
</p>
</div>
</div>

<div id="outline-container-org5e6cda4" class="outline-4">
<h4 id="org5e6cda4"><span class="section-number-4">10.2.4</span> Procedure Objects</h4>
<div class="outline-text-4" id="text-10-2-4">
<p>
A procedure objects consists of:
</p>
<ol class="org-ol">
<li>A pointer to the procedure object.</li>
<li>A pointer to the environment the procedure will execute in.</li>
<li>The actual body (code) of the procedure.</li>
</ol>

<p>
Diagrammatically:
</p>

<p>
<a href="./images/frameobj.pdf">./images/frameobj.pdf</a>
</p>
</div>
</div>

<div id="outline-container-orge53ca4e" class="outline-4">
<h4 id="orge53ca4e"><span class="section-number-4">10.2.5</span> Rules for Environment Model</h4>
<div class="outline-text-4" id="text-10-2-5">
<ol class="org-ol">
<li><p>
A procedure object is applied to a set of arguments by
constructing a frame binding the formal parameters of the
procedure to the actual arguments of the call, then evaluating
the body of the procedure <i>in the context</i> of the new
environment thus constructed. The new frame has as its
enclosing environment the environment part of the procedure
being applied.
</p>

<p>
For example, for a procedure <code>P</code>, evaluated at <code>(P 3 4)</code>, the
actual arguments to <code>P</code> are &ldquo;appended&rdquo; to the environment <code>P</code>
is called in. The procedure object itself has three pointers:
</p>

<ul class="org-ul">
<li>The first is to the procedure itself, <code>P</code>.</li>
<li>The second points to the extended environment.</li>
<li>The third point points to the actual &lambda;.</li>
</ul>

<p>
Diagrammatically:
</p>

<p>
<a href="./images/rule1.pdf">./images/rule1.pdf</a>
</p></li>

<li><p>
A &lambda;-expression is evaluated relative to a given
environment as follows: a new procedure object is formed, the
combining the code of the &lambda;-expression with a pointer to
the environment of evaluation.
</p>

<p>
This rule is self-explanatory.
</p></li>
</ol>

<p>
Our most important take-away is that an environment is a linked
chain of frames, going all the way back to the first (global)
frame. We now have a new working model, which works with
assignment, as we&rsquo;ll soon see.
</p>
</div>
</div>


<div id="outline-container-org02448ae" class="outline-4">
<h4 id="org02448ae"><span class="section-number-4">10.2.6</span> Assignment</h4>
<div class="outline-text-4" id="text-10-2-6">
<p>
Let&rsquo;s play around with assignment in the environment model.
Consider the following procedure:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org578e779"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">make-counter</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #50a14f;">(</span>n<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #da8548;">()</span>
      <span style="color: #da8548;">(</span><span style="color: #e45649;">set!</span> n <span style="color: #b751b6;">(</span>inc n<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
      n<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
What does the environment look like once we define <code>make-counter</code>?
Something like this:
</p>

<p>
<a href="./images/make-counter.pdf">./images/make-counter.pdf</a>
</p>

<p>
Let us now use <code>make-counter</code> to define two counters, each of
which start at different values of <code>n</code>:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org42f3d3e">
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">C1</span> <span style="color: #a626a4;">(</span>make-counter <span style="color: #2e8b57;">0</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">C2</span> <span style="color: #a626a4;">(</span>make-counter <span style="color: #2e8b57;">10</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
The environment now looks like:
</p>

<p>
<a href="./images/c1c2.pdf">./images/c1c2.pdf</a>
</p>

<p>
See that there is no <i>possible</i> confusion between which <code>n</code> <code>C1</code>
uses and which <code>n</code> <code>C2</code> uses. Moreover, neither <code>C1</code> nor <code>C2</code>
would care about a globally defined <code>n</code>, or any <code>n</code> in a higher
level frame, since it&rsquo;d get shadowed by their own <code>n</code>&rsquo;s.
</p>

<p>
We can now see how the following would work:
</p>

<div class="org-src-container">
<pre class="src src-racket">
<span style="color: #4078f2;">(</span>C1<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>C2<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>C1<span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span>C2<span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
1
11
2
12
</pre>


<p>
The first call to <code>(C1)</code> sees that <code>n</code> is zero in its environment,
and sets <code>n</code> to <code>0+1=1</code>, and returns <code>1</code>. The first call to <code>(C2)</code>
sees that <i>its</i> <code>n</code> is <code>10</code>, sets it to <code>11</code>, and returns <code>11</code>. The
second call to <code>(C1)</code> sees that its <code>n</code> is <code>1</code>, then sets and
returns <code>2</code>. The final call to <code>(C2)</code> sees that its <code>n</code> is <code>11</code>,
which is then sets to <code>12</code> and returned.
</p>
</div>
</div>
