video_notes/video_notes.org
*** Some Philosophy

    We have some questions to answer about sameness and change of
    objects. Consider that in the previous example, =C1='s =n= and
    =C2='s =n= are both called =n=, and yet refer to different
    objects. However, =C1= refers to only one object, =C1=. How then,
    can we tell if an identifier refers to an object? This issue is
    almost philosophical: if the only way know of an object is its
    identifier, what is an object anyway?

    We avoid these issues in Lisp's environment model by defining
    action, change, and identity as follows:

    #+begin_quote
    Action $A$ has an effect on object $X$ ($A$ changes $X$) if
    property $P$ true of $X$ before $A$ is false of $X$ after $A$.
    #+end_quote

    and

    #+begin_quote
    $X$ and $Y$ are the same object if any action which changes $X$
    changes $Y$.
    #+end_quote

    The (Lisp) world is thus made up of many individual objects, all
    with some local state.

** Advantages of Assignment

   We've seen that introducing assignment makes our pure functional
   programming somewhat "murky". One of the reasons to do this is that
   assignment often greatly enhances modularity, as we will show in an
   example. A word of caution, however: do not use assignment unless
   it is necessary.

*** Cesro's Pi Finder
    Cesro's theorem tells us that:

    $$P(\mathrm{gcd}(a,b)=1) = \frac{6}{\pi^{2}}$$

    Of course, we can estimate probabilities using the Monte Carlo
    method (do lots of tests, and divide the number of successful tests
    by the total number of tests conducted). Using assignment, the
    program looks like:

    #+NAME: c-mcarlo-1
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (estimate-pi n)
        (sqrt (/ 6 (monte-carlo n cesaro))))

      (define (cesaro)
        (= (gcd (random 4294967087) (random 4294967087)) 1))

      (define (monte-carlo trials experiment)
        (define (iter remaining passed)
          (cond ((= remaining 0)
                 (/ passed trials))
                ((experiment)
                 (iter (dec remaining)
                       (inc passed)))
                (else
                 (iter (dec remaining)
                       passed))))
        (iter trials 0))

      (estimate-pi 10000000)
    #+END_SRC

    #+RESULTS: c-mcarlo-1
    : 3.141330429791511

    Note that we use Racket's built in =random= to generate a random
    number. However, if we had to implement a PRNG on our own, it'd
    look something like:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define rand
        (let ((x random-init))
          (lambda ()
            (set! x (rand-update x))
            x)))
    #+END_SRC

    Assignment is used most naturally here because we want to give =x=
    the value of computing some function with input =x= to use the
    next time =rand= is called. This function is evaluated within a
    local scope where =x= at first has some constant seed value
    =random-init=.


