video_notes/index.html


<div id="outline-container-orgfa39873" class="outline-4">
<h4 id="orgfa39873"><span class="section-number-4">10.2.7</span> Some Philosophy</h4>
<div class="outline-text-4" id="text-10-2-7">
<p>
We have some questions to answer about sameness and change of
objects. Consider that in the previous example, <code>C1</code>&rsquo;s <code>n</code> and
<code>C2</code>&rsquo;s <code>n</code> are both called <code>n</code>, and yet refer to different
objects. However, <code>C1</code> refers to only one object, <code>C1</code>. How then,
can we tell if an identifier refers to an object? This issue is
almost philosophical: if the only way know of an object is its
identifier, what is an object anyway?
</p>

<p>
We avoid these issues in Lisp&rsquo;s environment model by defining
action, change, and identity as follows:
</p>

<blockquote>
<p>
Action \(A\) has an effect on object \(X\) (\(A\) changes \(X\)) if
property \(P\) true of \(X\) before \(A\) is false of \(X\) after \(A\).
</p>
</blockquote>

<p>
and
</p>

<blockquote>
<p>
\(X\) and \(Y\) are the same object if any action which changes \(X\)
changes \(Y\).
</p>
</blockquote>

<p>
The (Lisp) world is thus made up of many individual objects, all
with some local state.
</p>
</div>
</div>
</div>

<div id="outline-container-orgfe24657" class="outline-3">
<h3 id="orgfe24657"><span class="section-number-3">10.3</span> Advantages of Assignment</h3>
<div class="outline-text-3" id="text-10-3">
<p>
We&rsquo;ve seen that introducing assignment makes our pure functional
programming somewhat &ldquo;murky&rdquo;. One of the reasons to do this is that
assignment often greatly enhances modularity, as we will show in an
example. A word of caution, however: do not use assignment unless
it is necessary.
</p>
</div>

<div id="outline-container-org0df3d23" class="outline-4">
<h4 id="org0df3d23"><span class="section-number-4">10.3.1</span> Cesàro&rsquo;s Pi Finder</h4>
<div class="outline-text-4" id="text-10-3-1">
<p>
Cesàro&rsquo;s theorem tells us that:
</p>

<p>
\[P(\mathrm{gcd}(a,b)=1) = \frac{6}{\pi^{2}}\]
</p>

<p>
Of course, we can estimate probabilities using the Monte Carlo
method (do lots of tests, and divide the number of successful tests
by the total number of tests conducted). Using assignment, the
program looks like:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orgf3d8966"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">estimate-pi</span> n<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">sqrt</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">/</span> <span style="color: #2e8b57;">6</span> <span style="color: #da8548;">(</span>monte-carlo n cesaro<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">cesaro</span><span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">=</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">gcd</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">random</span> <span style="color: #2e8b57;">4294967087</span><span style="color: #da8548;">)</span> <span style="color: #da8548;">(</span><span style="color: #a626a4;">random</span> <span style="color: #2e8b57;">4294967087</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span> <span style="color: #2e8b57;">1</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">monte-carlo</span> trials experiment<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">define</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">iter</span> remaining passed<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">cond</span> <span style="color: #da8548;">(</span><span style="color: #b751b6;">(</span><span style="color: #a626a4;">=</span> remaining <span style="color: #2e8b57;">0</span><span style="color: #b751b6;">)</span>
           <span style="color: #b751b6;">(</span><span style="color: #a626a4;">/</span> passed trials<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
          <span style="color: #da8548;">(</span><span style="color: #b751b6;">(</span>experiment<span style="color: #b751b6;">)</span>
           <span style="color: #b751b6;">(</span>iter <span style="color: #986801;">(</span>dec remaining<span style="color: #986801;">)</span>
                 <span style="color: #986801;">(</span>inc passed<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
          <span style="color: #da8548;">(</span><span style="color: #e45649;">else</span>
           <span style="color: #b751b6;">(</span>iter <span style="color: #986801;">(</span>dec remaining<span style="color: #986801;">)</span>
                 passed<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>iter trials <span style="color: #2e8b57;">0</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span>estimate-pi <span style="color: #2e8b57;">10000000</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<pre class="example">
3.141330429791511
</pre>


<p>
Note that we use Racket&rsquo;s built in <code>random</code> to generate a random
number. However, if we had to implement a PRNG on our own, it&rsquo;d
look something like:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #6a1868;">rand</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">let</span> <span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #6a1868;">x</span> random-init<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">lambda</span> <span style="color: #da8548;">()</span>
      <span style="color: #da8548;">(</span><span style="color: #e45649;">set!</span> x <span style="color: #b751b6;">(</span>rand-update x<span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
      x<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Assignment is used most naturally here because we want to give <code>x</code>
the value of computing some function with input <code>x</code> to use the
next time <code>rand</code> is called. This function is evaluated within a
local scope where <code>x</code> at first has some constant seed value
<code>random-init</code>.
</p>
</div>
</div>
