video_notes/video_notes.org
*** Functional Cesro's Pi Finder

    Since we can't use assignment to keep track of the "state" of the
    PRNG, we must write our program like:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (estimate-pi n)
        (sqrt (/ 6 (random-gcd-test n))))

      (define (random-gcd-test trials)
        (define (iter remaining passed x)
          (let ((x1 (rand-update x))
                (x2 (rand-update x1)))
            (cond ((= remaining 0)
                   (/ passed trials))
                  ((= (gcd x1 x2) 1)
                   (iter (dec remaining)
                         (inc passed)
                         x))
                  (else
                   (iter (dec remaining)
                         passed
                         x2)))))
        (iter trials 0 random-seed))
    #+END_SRC

    The state of the PRNG has "leaked" out into our program, that is,
    =iter= has to keep track of successive values of the seed. Worse
    still, this makes =monte-carlo= and =cesaro= non-general, reducing
    modularity. It is applications like these where assignment is
    incredibly useful, and helps keep our programs neat and modular.




























































































* Footnotes

[fn:1] =let= is a Lisp primitive which takes as its first argument a
series of definitions, and second input a series of applications that may
use these definitions. The trick is that these definitions are only
valid in the body (second argument) of =let=, effectively creating a
local namespace.

[fn:2] For an operation defined on members of a set, the result of
that operation is a member of the set. For instance, addition on
natural numbers.

[fn:3] Note that Lisp actually implements pairs using "real" data
structures, since using procedures this way is less efficient.

[fn:4] $p \otimes p = p$

[fn:5] LISP actually stands for LISt Processing.

[fn:6] We use "initiate" and "substitute" interchangeably to mean
swapping out expressions in the skeleton provided by the RHS of the
rules.

[fn:7] "Garbage in, garbage out" means that the simplifier will
produce garbage output if the rules supplied to it are garbage. That
is, it makes no attempt to fix flaws in logic on the part of the user,
much like a computer. This underlying principle of computing was noted
by the father of computers, Charles Babbage: "On two occasions I have
been asked, 'Pray, Mr. Babbage, if you put into the machine wrong
figures, will the right answers come out?' I am not able rightly
to apprehend the kind of confusion of ideas that could provoke such a
question."
