video_notes/index.html


<div id="outline-container-org01e2557" class="outline-4">
<h4 id="org01e2557"><span class="section-number-4">10.3.2</span> Functional Cesàro&rsquo;s Pi Finder</h4>
<div class="outline-text-4" id="text-10-3-2">
<p>
Since we can&rsquo;t use assignment to keep track of the &ldquo;state&rdquo; of the
PRNG, we must write our program like:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">estimate-pi</span> n<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #a626a4;">sqrt</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">/</span> <span style="color: #2e8b57;">6</span> <span style="color: #da8548;">(</span>random-gcd-test n<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

<span style="color: #4078f2;">(</span><span style="color: #e45649;">define</span> <span style="color: #a626a4;">(</span><span style="color: #a626a4;">random-gcd-test</span> trials<span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span><span style="color: #e45649;">define</span> <span style="color: #50a14f;">(</span><span style="color: #a626a4;">iter</span> remaining passed x<span style="color: #50a14f;">)</span>
    <span style="color: #50a14f;">(</span><span style="color: #e45649;">let</span> <span style="color: #da8548;">(</span><span style="color: #b751b6;">(</span><span style="color: #6a1868;">x1</span> <span style="color: #986801;">(</span>rand-update x<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span>
          <span style="color: #b751b6;">(</span><span style="color: #6a1868;">x2</span> <span style="color: #986801;">(</span>rand-update x1<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span>
      <span style="color: #da8548;">(</span><span style="color: #e45649;">cond</span> <span style="color: #b751b6;">(</span><span style="color: #986801;">(</span><span style="color: #a626a4;">=</span> remaining <span style="color: #2e8b57;">0</span><span style="color: #986801;">)</span>
             <span style="color: #986801;">(</span><span style="color: #a626a4;">/</span> passed trials<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span>
            <span style="color: #b751b6;">(</span><span style="color: #986801;">(</span><span style="color: #a626a4;">=</span> <span style="color: #4db5bd;">(</span><span style="color: #a626a4;">gcd</span> x1 x2<span style="color: #4db5bd;">)</span> <span style="color: #2e8b57;">1</span><span style="color: #986801;">)</span>
             <span style="color: #986801;">(</span>iter <span style="color: #4db5bd;">(</span>dec remaining<span style="color: #4db5bd;">)</span>
                   <span style="color: #4db5bd;">(</span>inc passed<span style="color: #4db5bd;">)</span>
                   x<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span>
            <span style="color: #b751b6;">(</span><span style="color: #e45649;">else</span>
             <span style="color: #986801;">(</span>iter <span style="color: #4db5bd;">(</span>dec remaining<span style="color: #4db5bd;">)</span>
                   passed
                   x2<span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span>
  <span style="color: #a626a4;">(</span>iter trials <span style="color: #2e8b57;">0</span> <span style="color: #a626a4;">random-seed</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
The state of the PRNG has &ldquo;leaked&rdquo; out into our program, that is,
<code>iter</code> has to keep track of successive values of the seed. Worse
still, this makes <code>monte-carlo</code> and <code>cesaro</code> non-general, reducing
modularity. It is applications like these where assignment is
incredibly useful, and helps keep our programs neat and modular.
</p>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<code>let</code> is a Lisp primitive which takes as its first argument a
series of definitions, and second input a series of applications that may
use these definitions. The trick is that these definitions are only
valid in the body (second argument) of <code>let</code>, effectively creating a
local namespace.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
For an operation defined on members of a set, the result of
that operation is a member of the set. For instance, addition on
natural numbers.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
Note that Lisp actually implements pairs using &ldquo;real&rdquo; data
structures, since using procedures this way is less efficient.
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
\(p \otimes p = p\)
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
LISP actually stands for LISt Processing.
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6">6</a></sup> <div class="footpara"><p class="footpara">
We use &ldquo;initiate&rdquo; and &ldquo;substitute&rdquo; interchangeably to mean
swapping out expressions in the skeleton provided by the RHS of the
rules.
</p></div></div>

<div class="footdef"><sup><a id="fn.7" class="footnum" href="#fnr.7">7</a></sup> <div class="footpara"><p class="footpara">
&ldquo;Garbage in, garbage out&rdquo; means that the simplifier will
produce garbage output if the rules supplied to it are garbage. That
is, it makes no attempt to fix flaws in logic on the part of the user,
much like a computer. This underlying principle of computing was noted
by the father of computers, Charles Babbage: &ldquo;On two occasions I have
been asked, &lsquo;Pray, Mr. Babbage, if you put into the machine wrong
figures, will the right answers come out?&rsquo; I am not able rightly
to apprehend the kind of confusion of ideas that could provoke such a
question.&rdquo;
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<hr><p style="font-size: 75%">Created in GNU <a href="https://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="https://orgmode.org">Org</a> mode 9.3.6).</p>
</div>
</body>
</html>
